[Survived] ConditionalExpression
packages/alfa-act/src/cache.ts:29:9
       | Future<Iterable<Outcome<I, T, Q, S>>>
       | undefined;
 
-    if (outcomes === undefined) {
+    if (true) {
       outcomes = ifMissing();
       this._storage.set(rule, outcomes);
