[Survived] ArrowFunction
packages/alfa-act/src/audit.ts:35:34
   >(
     input: I,
     rules: Iterable<Rule<I, T, Q, S>>,
-    oracle: Oracle<I, T, Q, S> = () => Future.now(None),
+    oracle: Oracle<I, T, Q, S> = () => undefined,
   ): Audit<I, T, Q, S> {
     return new Audit(input, List.from(rules), oracle);

[Survived] BlockStatement
packages/alfa-act/src/audit.ts:36:24
     input: I,
     rules: Iterable<Rule<I, T, Q, S>>,
     oracle: Oracle<I, T, Q, S> = () => Future.now(None),
-  ): Audit<I, T, Q, S> {
-    return new Audit(input, List.from(rules), oracle);
-  }
+  ): Audit<I, T, Q, S> {}
 
   private readonly _input: I;

[Survived] BlockStatement
packages/alfa-act/src/audit.ts:48:5
     input: I,
     rules: List<Rule<I, T, Q, S>>,
     oracle: Oracle<I, T, Q, S>,
-  ) {
-    this._input = input;
-    this._rules = rules;
-    this._oracle = oracle;
-  }
+  ) {}
 
   public evaluate(

[Survived] BlockStatement
packages/alfa-act/src/audit.ts:56:44
 
   public evaluate(
     performance?: Performance<Rule.Event<I, T, Q, S>>,
-  ): Future<Iterable<Outcome<I, T, Q, S>>> {
-    const outcomes = Cache.empty();
-
-    return Future.traverse(this._rules, (rule) =>
-      rule.evaluate(this._input, this._oracle, outcomes, performance),
-    ).map(Iterable.flatten);
-  }
+  ): Future<Iterable<Outcome<I, T, Q, S>>> {}
 }
 

[Survived] ArrowFunction
packages/alfa-act/src/audit.ts:59:41
   ): Future<Iterable<Outcome<I, T, Q, S>>> {
     const outcomes = Cache.empty();
 
-    return Future.traverse(this._rules, (rule) =>
-      rule.evaluate(this._input, this._oracle, outcomes, performance),
+    return Future.traverse(this._rules, () => undefined,
     ).map(Iterable.flatten);
   }
