[Survived] ConditionalExpression
packages/alfa-act/src/diagnostic.ts:32:12
   public equals(value: unknown): value is this;
 
   public equals(value: unknown): boolean {
-    return value instanceof Diagnostic && value._message === this._message;
+    return true;
   }
 

[Survived] ConditionalExpression
packages/alfa-act/src/diagnostic.ts:32:12
   public equals(value: unknown): value is this;
 
   public equals(value: unknown): boolean {
-    return value instanceof Diagnostic && value._message === this._message;
+    return false;
   }
 

[Survived] BlockStatement
packages/alfa-act/src/diagnostic.ts:35:27
     return value instanceof Diagnostic && value._message === this._message;
   }
 
-  public hash(hash: Hash) {
-    hash.writeString(this._message);
-  }
+  public hash(hash: Hash) {}
 
   public toJSON(): Diagnostic.JSON {

[Survived] MethodExpression
packages/alfa-act/src/diagnostic.ts:63:10
 }
 
 function normalize(input: string): string {
-  return input.trim().replace(/\s+/g, " ");
+  return input.replace(/\s+/g, " ");
 }
 

[Survived] Regex
packages/alfa-act/src/diagnostic.ts:63:31
 }
 
 function normalize(input: string): string {
-  return input.trim().replace(/\s+/g, " ");
+  return input.trim().replace(/\S+/g, " ");
 }
 
