[Killed] BooleanLiteral
packages/alfa-act/src/interview.ts:95:27
     interview: Interview<QUESTION, SUBJECT, TARGET, ANSWER>,
     rule: Rule<INPUT, TARGET, QUESTION, SUBJECT>,
     oracle: Oracle<INPUT, TARGET, QUESTION, SUBJECT>,
-    oracleUsed: boolean = false,
+    oracleUsed: boolean = true,
   ): Future<Either<Tuple<[ANSWER, boolean]>, Tuple<[Diagnostic, boolean]>>> {
     if (interview instanceof Question) {
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-dr6/rule.spec.js(14,7): evaluate() passes an html element which has identical primary language subtags for its lang and xml:lang attributes

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] ArrowFunction
packages/alfa-act/src/interview.ts:106:18
         answer = oracle(rule, interview).map((option) =>
           option
             // Record that the oracle was successfully used
-            .tee((_) => (oracleUsed = true))
+            .tee(() => undefined)
             // If oracle has no answer, use fallback
             .or(interview.fallback)
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r109/rule.spec.js(21,7): evaluate() passes documents whose lang attribute matches the main language

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] BooleanLiteral
packages/alfa-act/src/interview.ts:106:39
         answer = oracle(rule, interview).map((option) =>
           option
             // Record that the oracle was successfully used
-            .tee((_) => (oracleUsed = true))
+            .tee((_) => (oracleUsed = false))
             // If oracle has no answer, use fallback
             .or(interview.fallback)
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r109/rule.spec.js(21,7): evaluate() passes documents whose lang attribute matches the main language

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...
