[Killed] EqualityOperator
packages/alfa-act/src/outcome.ts:85:12
   }
 
   public get isSemiAuto(): boolean {
-    return this._mode === Outcome.Mode.SemiAuto;
+    return this._mode !== Outcome.Mode.SemiAuto;
   }
 
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r27/rule.spec.js(16,7): evaluate() passes when R22 passes

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] ConditionalExpression
packages/alfa-act/src/outcome.ts:85:12
   }
 
   public get isSemiAuto(): boolean {
-    return this._mode === Outcome.Mode.SemiAuto;
+    return true;
   }
 
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r27/rule.spec.js(74,7): evaluate() is inapplicable when Applicability questions are unanswered

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     mode: 'semiAuto',

[Survived] ConditionalExpression
packages/alfa-act/src/outcome.ts:104:7
 
   public equals(value: unknown): boolean {
     return (
-      value instanceof Outcome &&
-      value._rule.equals(this._rule) &&
-      value._outcome === this._outcome &&
-      value._mode === this._mode
+      false
     );
   }

[Survived] ConditionalExpression
packages/alfa-act/src/outcome.ts:104:7
 
   public equals(value: unknown): boolean {
     return (
-      value instanceof Outcome &&
-      value._rule.equals(this._rule) &&
-      value._outcome === this._outcome &&
-      value._mode === this._mode
+      true
     );
   }

[Survived] ConditionalExpression
packages/alfa-act/src/outcome.ts:106:7
     return (
       value instanceof Outcome &&
       value._rule.equals(this._rule) &&
-      value._outcome === this._outcome &&
+      true &&
       value._mode === this._mode
     );

[Survived] EqualityOperator
packages/alfa-act/src/outcome.ts:106:7
     return (
       value instanceof Outcome &&
       value._rule.equals(this._rule) &&
-      value._outcome === this._outcome &&
+      value._outcome !== this._outcome &&
       value._mode === this._mode
     );

[Survived] EqualityOperator
packages/alfa-act/src/outcome.ts:107:7
       value instanceof Outcome &&
       value._rule.equals(this._rule) &&
       value._outcome === this._outcome &&
-      value._mode === this._mode
+      value._mode !== this._mode
     );
   }

[Survived] ConditionalExpression
packages/alfa-act/src/outcome.ts:107:7
       value instanceof Outcome &&
       value._rule.equals(this._rule) &&
       value._outcome === this._outcome &&
-      value._mode === this._mode
+      true
     );
   }

[Survived] BlockStatement
packages/alfa-act/src/outcome.ts:111:33
     );
   }
 
-  public hash(hash: Hash): void {
-    this._rule.hash(hash);
-    hash.writeString(this._outcome);
-    hash.writeString(this._mode);
-  }
+  public hash(hash: Hash): void {}
 
   public toJSON(): Outcome.JSON<V> {

[Survived] LogicalOperator
packages/alfa-act/src/outcome.ts:234:9
 
     public equals(value: unknown): boolean {
       return (
-        super.equals(value) &&
-        value instanceof Passed &&
+        super.equals(value) || value instanceof Passed &&
         Equatable.equals(value._target, this._target) &&
         value._expectations.equals(this._expectations)

[Survived] ConditionalExpression
packages/alfa-act/src/outcome.ts:234:9
 
     public equals(value: unknown): boolean {
       return (
-        super.equals(value) &&
-        value instanceof Passed &&
-        Equatable.equals(value._target, this._target) &&
-        value._expectations.equals(this._expectations)
+        true
       );
     }

[Survived] BlockStatement
packages/alfa-act/src/outcome.ts:241:29
       );
     }
 
-    public hash(hash: Hash) {
-      super.hash(hash);
-      this._target.hash(hash);
-      for (const [id, result] of this._expectations) {
-        hash.writeString(id);
-        result.hash(hash);
-      }
-    }
+    public hash(hash: Hash) {}
 
     public toJSON(): Passed.JSON<T> {

[Survived] BlockStatement
packages/alfa-act/src/outcome.ts:244:54
     public hash(hash: Hash) {
       super.hash(hash);
       this._target.hash(hash);
-      for (const [id, result] of this._expectations) {
-        hash.writeString(id);
-        result.hash(hash);
-      }
+      for (const [id, result] of this._expectations) {}
     }
 

[Survived] MethodExpression
packages/alfa-act/src/outcome.ts:268:24
           "earl:outcome": {
             "@id": "earl:passed",
           },
-          "earl:info": this._expectations
-            .toArray()
-            .reduce(
-              (message, [, expectation]) =>
-                // the outcome is passed, so all expectations should be Ok
-                message + "\n" + expectation.getUnsafe().message,
-              "",
-            )
-            .trim(),
+          "earl:info": this._expectations.toArray().reduce((message, [, expectation]) =>
+// the outcome is passed, so all expectations should be Ok
+message + "\n" + expectation.getUnsafe().message, ""),
         },
       };

[Survived] BlockStatement
packages/alfa-act/src/outcome.ts:280:69
         },
       };
 
-      for (const pointer of earl.Serializable.toEARL(this._target)) {
-        outcome["earl:result"]["earl:pointer"] = pointer;
-      }
+      for (const pointer of earl.Serializable.toEARL(this._target)) {}
 
       return outcome;

[Survived] StringLiteral
packages/alfa-act/src/outcome.ts:289:9
 
     public toSARIF(): sarif.Result {
       const message =
-        "The test target passes all requirements:\n\n" +
+        "" +
         this._expectations
           .toArray()

[Survived] ArrowFunction
packages/alfa-act/src/outcome.ts:293:16
         this._expectations
           .toArray()
           // the outcome is passed, so all expectations should be Ok
-          .map(([, expectation]) => `- ${expectation.getUnsafe().message}`)
+          .map(() => undefined)
           .join("\n");
 

[Survived] StringLiteral
packages/alfa-act/src/outcome.ts:293:37
         this._expectations
           .toArray()
           // the outcome is passed, so all expectations should be Ok
-          .map(([, expectation]) => `- ${expectation.getUnsafe().message}`)
+          .map(([, expectation]) => ``)
           .join("\n");
 

[Survived] StringLiteral
packages/alfa-act/src/outcome.ts:294:17
           .toArray()
           // the outcome is passed, so all expectations should be Ok
           .map(([, expectation]) => `- ${expectation.getUnsafe().message}`)
-          .join("\n");
+          .join("");
 
       const locations: Array<sarif.Location> = [];

[Survived] BlockStatement
packages/alfa-act/src/outcome.ts:298:72
 
       const locations: Array<sarif.Location> = [];
 
-      for (const location of sarif.Serializable.toSARIF(this._target)) {
-        locations.push(location as sarif.Location);
-      }
+      for (const location of sarif.Serializable.toSARIF(this._target)) {}
 
       return {

[Survived] ObjectLiteral
packages/alfa-act/src/outcome.ts:306:18
         ruleId: this._rule.uri,
         kind: "pass",
         level: "none",
-        message: {
-          text: message,
-          markdown: message,
-        },
+        message: {},
         locations,
       };

[Survived] ConditionalExpression
packages/alfa-act/src/outcome.ts:413:9
 
     public equals(value: unknown): boolean {
       return (
-        super.equals(value) &&
-        value instanceof Failed &&
-        Equatable.equals(value._target, this._target) &&
-        value._expectations.equals(this._expectations)
+        true
       );
     }

[Survived] LogicalOperator
packages/alfa-act/src/outcome.ts:413:9
 
     public equals(value: unknown): boolean {
       return (
-        super.equals(value) &&
-        value instanceof Failed &&
+        super.equals(value) || value instanceof Failed &&
         Equatable.equals(value._target, this._target) &&
         value._expectations.equals(this._expectations)

[Survived] MethodExpression
packages/alfa-act/src/outcome.ts:447:24
           "earl:outcome": {
             "@id": "earl:failed",
           },
-          "earl:info": this._expectations
-            .toArray()
-            .reduce((message, [, expectation]) => {
-              if (expectation.isErr()) {
-                message += "\n" + expectation.getErr().message;
-              }
-
-              return message;
-            }, "")
-            .trim(),
+          "earl:info": this._expectations.toArray().reduce((message, [, expectation]) => {
+  if (expectation.isErr()) {
+    message += "\n" + expectation.getErr().message;
+  }
+  return message;
+}, ""),
         },
       };

[Survived] BlockStatement
packages/alfa-act/src/outcome.ts:450:40
           "earl:info": this._expectations
             .toArray()
             .reduce((message, [, expectation]) => {
-              if (expectation.isErr()) {
-                message += "\n" + expectation.getErr().message;
-              }
+              if (expectation.isErr()) {}
 
               return message;

[Survived] ArrowFunction
packages/alfa-act/src/outcome.ts:475:17
             Iterable.filter(
               Iterable.map(
                 this._expectations.entries(),
-                ([, expectation]) => expectation,
+                () => undefined,
               ),
               Err.isErr<Diagnostic>,

[Survived] ArrowFunction
packages/alfa-act/src/outcome.ts:479:13
               ),
               Err.isErr<Diagnostic>,
             ),
-            (expectation) => `- ${expectation.getErr().message}`,
+            () => undefined,
           ),
           "\n",

[Survived] StringLiteral
packages/alfa-act/src/outcome.ts:479:30
               ),
               Err.isErr<Diagnostic>,
             ),
-            (expectation) => `- ${expectation.getErr().message}`,
+            (expectation) => ``,
           ),
           "\n",

[Survived] StringLiteral
packages/alfa-act/src/outcome.ts:481:11
             ),
             (expectation) => `- ${expectation.getErr().message}`,
           ),
-          "\n",
+          "",
         );
 

[Survived] ObjectLiteral
packages/alfa-act/src/outcome.ts:494:18
         ruleId: this._rule.uri,
         kind: "fail",
         level: "error",
-        message: {
-          text: message,
-          markdown: message,
-        },
+        message: {},
         locations,
       };

[Survived] ConditionalExpression
packages/alfa-act/src/outcome.ts:593:9
 
     public equals(value: unknown): boolean {
       return (
-        super.equals(value) &&
-        value instanceof CantTell &&
-        Equatable.equals(value._target, this._target) &&
-        value._diagnostic.equals(this._diagnostic)
+        false
       );
     }

[Survived] ConditionalExpression
packages/alfa-act/src/outcome.ts:593:9
 
     public equals(value: unknown): boolean {
       return (
-        super.equals(value) &&
-        value instanceof CantTell &&
-        Equatable.equals(value._target, this._target) &&
-        value._diagnostic.equals(this._diagnostic)
+        true
       );
     }

[Survived] BlockStatement
packages/alfa-act/src/outcome.ts:600:29
       );
     }
 
-    public hash(hash: Hash) {
-      super.hash(hash);
-      this._target.hash(hash);
-      this._diagnostic.hash(hash);
-    }
+    public hash(hash: Hash) {}
 
     public toJSON(): CantTell.JSON<T> {

[Killed] LogicalOperator
packages/alfa-act/src/outcome.ts:726:14
       Q extends Question.Metadata,
       S,
     >(value: unknown): value is Applicable<I, T, Q, S> {
-      return isPassed(value) || isFailed(value) || isCantTell(value);
+      return isPassed(value) && isFailed(value) || isCantTell(value);
     }
   }
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r27/rule.spec.js(16,7): evaluate() passes when R22 passes

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     diagnostic: {

[Killed] ConditionalExpression
packages/alfa-act/src/outcome.ts:726:14
       Q extends Question.Metadata,
       S,
     >(value: unknown): value is Applicable<I, T, Q, S> {
-      return isPassed(value) || isFailed(value) || isCantTell(value);
+      return false;
     }
   }
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r27/rule.spec.js(16,7): evaluate() passes when R22 passes

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     mode: 'semiAuto',

[Survived] ConditionalExpression
packages/alfa-act/src/outcome.ts:756:14
     public equals(value: unknown): value is this;
 
     public equals(value: unknown): boolean {
-      return super.equals(value) && value instanceof Inapplicable;
+      return false;
     }
 

[Survived] LogicalOperator
packages/alfa-act/src/outcome.ts:756:14
     public equals(value: unknown): value is this;
 
     public equals(value: unknown): boolean {
-      return super.equals(value) && value instanceof Inapplicable;
+      return super.equals(value) || value instanceof Inapplicable;
     }
 

[Killed] ArrowFunction
packages/alfa-act/src/outcome.ts:837:7
     mode: Mode,
   ): Outcome.Applicable<I, T, Q, S> {
     return Trilean.fold(
-      (expectations) =>
-        Trilean.every(expectations, (expectation) =>
-          expectation
-            .map<Trilean>((expectation) => expectation.isOk())
-            .getOr(undefined),
-        ),
+      () => undefined,
       () =>
         Passed.of(
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-dr6/rule.spec.js(14,7): evaluate() passes an html element which has identical primary language subtags for its lang and xml:lang attributes

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     diagnostic: {

[Killed] MethodExpression
packages/alfa-act/src/outcome.ts:838:9
   ): Outcome.Applicable<I, T, Q, S> {
     return Trilean.fold(
       (expectations) =>
-        Trilean.every(expectations, (expectation) =>
-          expectation
-            .map<Trilean>((expectation) => expectation.isOk())
-            .getOr(undefined),
-        ),
+        Trilean.some(expectations, expectation => expectation.map<Trilean>(expectation => expectation.isOk()).getOr(undefined)),
       () =>
         Passed.of(
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r1/rule.spec.js(31,7): evaluate() fails a document that has an empty <title> element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] ArrowFunction
packages/alfa-act/src/outcome.ts:838:37
   ): Outcome.Applicable<I, T, Q, S> {
     return Trilean.fold(
       (expectations) =>
-        Trilean.every(expectations, (expectation) =>
-          expectation
-            .map<Trilean>((expectation) => expectation.isOk())
-            .getOr(undefined),
+        Trilean.every(expectations, () => undefined,
         ),
       () =>
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-dr6/rule.spec.js(14,7): evaluate() passes an html element which has identical primary language subtags for its lang and xml:lang attributes

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     diagnostic: {

[Killed] ArrowFunction
packages/alfa-act/src/outcome.ts:840:27
       (expectations) =>
         Trilean.every(expectations, (expectation) =>
           expectation
-            .map<Trilean>((expectation) => expectation.isOk())
+            .map<Trilean>(() => undefined)
             .getOr(undefined),
         ),
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-dr6/rule.spec.js(14,7): evaluate() passes an html element which has identical primary language subtags for its lang and xml:lang attributes

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     diagnostic: {
