[Killed] BooleanLiteral
packages/alfa-act/src/question.ts:170:21
       | Result<ANSWER, unknown>,
     answerOrMerger?: ANSWER | Mapper<Diagnostic, Diagnostic, [Diagnostic]>,
   ): Question<TYPE, SUBJECT, CONTEXT, ANSWER, T, URI> {
-    let condition = false;
+    let condition = true;
     let answer: ANSWER;
     let diagnostic = this._diagnostic;
killedBy: All tests
statusReason: packages/alfa-iterable/src/iterable.js(70,29): evaluate() cannot tell when encountering a non-ignored interposed ancestor's sibling before encountering an opaque background
TypeError: iterable is not iterable

[Killed] BlockStatement
packages/alfa-act/src/question.ts:174:50
     let answer: ANSWER;
     let diagnostic = this._diagnostic;
 
-    if (isBoolean(conditionOrPredicateOrAnswer)) {
-      condition = conditionOrPredicateOrAnswer;
-      // Type is enforced by overload.
-      answer = answerOrMerger as ANSWER;
-    } else if (isFunction(conditionOrPredicateOrAnswer)) {
+    if (isBoolean(conditionOrPredicateOrAnswer)) {} else if (isFunction(conditionOrPredicateOrAnswer)) {
       condition = conditionOrPredicateOrAnswer(this._subject, this._context);
       // Type is enforced by overload.
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-er87/rule.spec.js(18,7): evaluate() passes a document whose first tabbable link references an element with a role of main

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     diagnostic: {

[Killed] BlockStatement
packages/alfa-act/src/question.ts:178:58
       condition = conditionOrPredicateOrAnswer;
       // Type is enforced by overload.
       answer = answerOrMerger as ANSWER;
-    } else if (isFunction(conditionOrPredicateOrAnswer)) {
-      condition = conditionOrPredicateOrAnswer(this._subject, this._context);
-      // Type is enforced by overload.
-      answer = answerOrMerger as ANSWER;
-    } else if (isOption(conditionOrPredicateOrAnswer)) {
+    } else if (isFunction(conditionOrPredicateOrAnswer)) {} else if (isOption(conditionOrPredicateOrAnswer)) {
       if (conditionOrPredicateOrAnswer.isSome()) {
         condition = true;
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r23/rule.spec.js(30,7): evaluate() passes an audio with autoplay attribute and with perceivable transcript

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     mode: 'semiAuto',

[Killed] BlockStatement
packages/alfa-act/src/question.ts:182:56
       condition = conditionOrPredicateOrAnswer(this._subject, this._context);
       // Type is enforced by overload.
       answer = answerOrMerger as ANSWER;
-    } else if (isOption(conditionOrPredicateOrAnswer)) {
-      if (conditionOrPredicateOrAnswer.isSome()) {
-        condition = true;
-        answer = conditionOrPredicateOrAnswer.get();
-      }
-    } else {
+    } else if (isOption(conditionOrPredicateOrAnswer)) {} else {
       // Result
       condition = conditionOrPredicateOrAnswer.isOk();
killedBy: All tests
statusReason: message(NaN,NaN): evaluate() passes a text node that has sufficient contrast

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     diagnostic: {

[Killed] BlockStatement
packages/alfa-act/src/question.ts:183:50
       // Type is enforced by overload.
       answer = answerOrMerger as ANSWER;
     } else if (isOption(conditionOrPredicateOrAnswer)) {
-      if (conditionOrPredicateOrAnswer.isSome()) {
-        condition = true;
-        answer = conditionOrPredicateOrAnswer.get();
-      }
+      if (conditionOrPredicateOrAnswer.isSome()) {}
     } else {
       // Result
killedBy: All tests
statusReason: message(NaN,NaN): evaluate() passes a text node that has sufficient contrast

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     diagnostic: {

[Killed] BooleanLiteral
packages/alfa-act/src/question.ts:184:21
       answer = answerOrMerger as ANSWER;
     } else if (isOption(conditionOrPredicateOrAnswer)) {
       if (conditionOrPredicateOrAnswer.isSome()) {
-        condition = true;
+        condition = false;
         answer = conditionOrPredicateOrAnswer.get();
       }
killedBy: All tests
statusReason: message(NaN,NaN): evaluate() passes a text node that has sufficient contrast

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     diagnostic: {

[Killed] BlockStatement
packages/alfa-act/src/question.ts:187:12
         condition = true;
         answer = conditionOrPredicateOrAnswer.get();
       }
-    } else {
-      // Result
-      condition = conditionOrPredicateOrAnswer.isOk();
-
-      if (condition) {
-        // the check ensures that the result is Ok
-        answer = conditionOrPredicateOrAnswer.getUnsafe();
-      } else {
-        // since the condition is false, we know the result is an Err
-        const error = conditionOrPredicateOrAnswer.getErrUnsafe();
-
-        if (Diagnostic.isDiagnostic(error)) {
-          // Type is enforced by overload.
-          const merger =
-            (answerOrMerger as Mapper<Diagnostic, Diagnostic, [Diagnostic]>) ??
-            // Default is to overwrite the old diagnostic
-            ((old: Diagnostic, cur: Diagnostic) => cur);
-
-          diagnostic = merger(diagnostic, error);
-        }
-      }
-    }
+    } else {}
 
     return condition
killedBy: All tests
statusReason: message(NaN,NaN): evaluate() passes a text node that has sufficient contrast

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     diagnostic: {

[Killed] BlockStatement
packages/alfa-act/src/question.ts:191:22
       // Result
       condition = conditionOrPredicateOrAnswer.isOk();
 
-      if (condition) {
-        // the check ensures that the result is Ok
-        answer = conditionOrPredicateOrAnswer.getUnsafe();
-      } else {
+      if (condition) {} else {
         // since the condition is false, we know the result is an Err
         const error = conditionOrPredicateOrAnswer.getErrUnsafe();
killedBy: All tests
statusReason: packages/alfa-cache/src/cache.js(29,23): evaluate() passes a text node that has sufficient contrast
TypeError: Invalid value used as weak map key

[Killed] BlockStatement
packages/alfa-act/src/question.ts:194:14
       if (condition) {
         // the check ensures that the result is Ok
         answer = conditionOrPredicateOrAnswer.getUnsafe();
-      } else {
-        // since the condition is false, we know the result is an Err
-        const error = conditionOrPredicateOrAnswer.getErrUnsafe();
-
-        if (Diagnostic.isDiagnostic(error)) {
-          // Type is enforced by overload.
-          const merger =
-            (answerOrMerger as Mapper<Diagnostic, Diagnostic, [Diagnostic]>) ??
-            // Default is to overwrite the old diagnostic
-            ((old: Diagnostic, cur: Diagnostic) => cur);
-
-          diagnostic = merger(diagnostic, error);
-        }
-      }
+      } else {}
     }
 
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-dr66/rule.spec.js(144,7): evaluate() correctly handles circular `currentcolor` references

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
      diagnostic: {

[Killed] BlockStatement
packages/alfa-act/src/question.ts:198:45
         // since the condition is false, we know the result is an Err
         const error = conditionOrPredicateOrAnswer.getErrUnsafe();
 
-        if (Diagnostic.isDiagnostic(error)) {
-          // Type is enforced by overload.
-          const merger =
-            (answerOrMerger as Mapper<Diagnostic, Diagnostic, [Diagnostic]>) ??
-            // Default is to overwrite the old diagnostic
-            ((old: Diagnostic, cur: Diagnostic) => cur);
-
-          diagnostic = merger(diagnostic, error);
-        }
+        if (Diagnostic.isDiagnostic(error)) {}
       }
     }
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-dr66/rule.spec.js(144,7): evaluate() correctly handles circular `currentcolor` references

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
      diagnostic: {

[Killed] LogicalOperator
packages/alfa-act/src/question.ts:201:13
         if (Diagnostic.isDiagnostic(error)) {
           // Type is enforced by overload.
           const merger =
-            (answerOrMerger as Mapper<Diagnostic, Diagnostic, [Diagnostic]>) ??
-            // Default is to overwrite the old diagnostic
-            ((old: Diagnostic, cur: Diagnostic) => cur);
+            (answerOrMerger as Mapper<Diagnostic, Diagnostic, [Diagnostic]>) && (
+// Default is to overwrite the old diagnostic
+(old: Diagnostic, cur: Diagnostic) => cur);
 
           diagnostic = merger(diagnostic, error);
killedBy: All tests
statusReason: packages/alfa-act/src/question.js(266,50): evaluate() correctly handles circular `currentcolor` references
TypeError: merger is not a function

[Killed] ArrowFunction
packages/alfa-act/src/question.ts:203:14
           const merger =
             (answerOrMerger as Mapper<Diagnostic, Diagnostic, [Diagnostic]>) ??
             // Default is to overwrite the old diagnostic
-            ((old: Diagnostic, cur: Diagnostic) => cur);
+            (() => undefined);
 
           diagnostic = merger(diagnostic, error);
killedBy: All tests
statusReason: packages/alfa-act/src/outcome.js(613,50): evaluate() correctly handles circular `currentcolor` references
TypeError: Cannot read properties of undefined (reading 'toJSON')
