[Survived] ConditionalExpression
packages/alfa-act/src/requirement.ts:24:12
   public equals(value: unknown): value is this;
 
   public equals(value: unknown): boolean {
-    return value instanceof Requirement && value.uri === this.uri;
+    return true;
   }
 

[Survived] ConditionalExpression
packages/alfa-act/src/requirement.ts:24:12
   public equals(value: unknown): value is this;
 
   public equals(value: unknown): boolean {
-    return value instanceof Requirement && value.uri === this.uri;
+    return false;
   }
 
