[Survived] MethodExpression
packages/alfa-act/src/rule.ts:91:12
     const predicate = Requirement.isRequirement(requirementOrPredicate)
       ? (requirement: unknown) => requirementOrPredicate.equals(requirement)
       : requirementOrPredicate;
-    return Array.some(this._requirements, predicate);
+    return Array.every(this._requirements, predicate);
   }
 

[Survived] MethodExpression
packages/alfa-act/src/rule.ts:103:12
       ? (tag: unknown) => tagOrPredicate.equals(tag)
       : tagOrPredicate;
 
-    return Array.some(this._tags, predicate);
+    return Array.every(this._tags, predicate);
   }
 

[Survived] ConditionalExpression
packages/alfa-act/src/rule.ts:123:37
   public equals(value: unknown): value is this;
 
   public equals(value: unknown): boolean {
-    return value instanceof Rule && value._uri === this._uri;
+    return value instanceof Rule && true;
   }
 

[Survived] EqualityOperator
packages/alfa-act/src/rule.ts:123:37
   public equals(value: unknown): value is this;
 
   public equals(value: unknown): boolean {
-    return value instanceof Rule && value._uri === this._uri;
+    return value instanceof Rule && value._uri !== this._uri;
   }
 

[Survived] BlockStatement
packages/alfa-act/src/rule.ts:126:27
     return value instanceof Rule && value._uri === this._uri;
   }
 
-  public hash(hash: Hash) {
-    hash.writeString(this._uri);
-  }
+  public hash(hash: Hash) {}
 
   public abstract toJSON(): Rule.JSON;

[Survived] OptionalChaining
packages/alfa-act/src/rule.ts:272:21
             performance !== undefined
               ? {
                   mark: (name: string) =>
-                    performance?.mark(Event.start(this, name)),
+                    performance.mark(Event.start(this, name)),
                   measure: (name: string, start?: number) =>
                     performance?.measure(Event.end(this, name), start),

[Survived] OptionalChaining
packages/alfa-act/src/rule.ts:274:21
                   mark: (name: string) =>
                     performance?.mark(Event.start(this, name)),
                   measure: (name: string, start?: number) =>
-                    performance?.measure(Event.end(this, name), start),
+                    performance.measure(Event.end(this, name), start),
                 }
               : undefined;

[Killed] ConditionalExpression
packages/alfa-act/src/rule.ts:316:21
                     cur.isSome()
                       ? acc.prepend(Tuple.of(cur.get(), isUsed))
                       : acc,
-                    wasUsed || isUsed,
+                    false,
                   ),
                 Tuple.of(Sequence.empty<Tuple<[T, boolean]>>(), false),
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-dr34/rule.spec.js(48,7): evaluate() is inapplicable to videos with audio

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     mode: 'automatic',

[Killed] LogicalOperator
packages/alfa-act/src/rule.ts:316:21
                     cur.isSome()
                       ? acc.prepend(Tuple.of(cur.get(), isUsed))
                       : acc,
-                    wasUsed || isUsed,
+                    wasUsed && isUsed,
                   ),
                 Tuple.of(Sequence.empty<Tuple<[T, boolean]>>(), false),
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-dr34/rule.spec.js(48,7): evaluate() is inapplicable to videos with audio

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     mode: 'automatic',

[Killed] BooleanLiteral
packages/alfa-act/src/rule.ts:318:65
                       : acc,
                     wasUsed || isUsed,
                   ),
-                Tuple.of(Sequence.empty<Tuple<[T, boolean]>>(), false),
+                Tuple.of(Sequence.empty<Tuple<[T, boolean]>>(), true),
               ),
             )
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-dr6/rule.spec.js(56,7): evaluate() is inapplicable to svg elements

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     mode: 'semiAuto',

[Survived] BlockStatement
packages/alfa-act/src/rule.ts:321:24
                 Tuple.of(Sequence.empty<Tuple<[T, boolean]>>(), false),
               ),
             )
-            .tee(() => {
-              performance?.measure(
-                Event.endApplicability(this),
-                startApplicability,
-              );
-              startExpectation = performance?.mark(Event.startExpectation(this))
-                .start;
-            })
+            .tee(() => {})
             .flatMap<Iterable<Outcome<I, T, Q, S>>>(([targets, oracleUsed]) => {
               if (targets.isEmpty()) {

[Killed] ConditionalExpression
packages/alfa-act/src/rule.ts:330:19
                 .start;
             })
             .flatMap<Iterable<Outcome<I, T, Q, S>>>(([targets, oracleUsed]) => {
-              if (targets.isEmpty()) {
+              if (true) {
                 return Future.now([
                   Outcome.Inapplicable.of(this, getMode(oracleUsed)),
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-dr6/rule.spec.js(14,7): evaluate() passes an html element which has identical primary language subtags for its lang and xml:lang attributes

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     mode: 'automatic',

[Killed] ConditionalExpression
packages/alfa-act/src/rule.ts:330:19
                 .start;
             })
             .flatMap<Iterable<Outcome<I, T, Q, S>>>(([targets, oracleUsed]) => {
-              if (targets.isEmpty()) {
+              if (false) {
                 return Future.now([
                   Outcome.Inapplicable.of(this, getMode(oracleUsed)),
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-dr6/rule.spec.js(56,7): evaluate() is inapplicable to svg elements

Expected values to be strictly deep-equal:
+ actual - expected

+ []
- [
-   {

[Killed] ArrayDeclaration
packages/alfa-act/src/rule.ts:331:35
             })
             .flatMap<Iterable<Outcome<I, T, Q, S>>>(([targets, oracleUsed]) => {
               if (targets.isEmpty()) {
-                return Future.now([
-                  Outcome.Inapplicable.of(this, getMode(oracleUsed)),
-                ]);
+                return Future.now([]);
               }
 
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-dr6/rule.spec.js(56,7): evaluate() is inapplicable to svg elements

Expected values to be strictly deep-equal:
+ actual - expected

+ []
- [
-   {

[Killed] MethodExpression
packages/alfa-act/src/rule.ts:339:17
               return Future.traverse(
                 // Since targets were prepended when Applicability was processed,
                 // we now need to reverse the sequence to restore initial order.
-                targets.reverse(),
+                targets,
                 ([target, oracleUsedInApplicability]) =>
                   resolve(
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-dr18/rule.spec.js(67,7): evaluate() passes a div element with checkbox role, and an aria-controls state

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Survived] BlockStatement
packages/alfa-act/src/rule.ts:348:27
                     oracle,
                     oracleUsedInApplicability,
                   ),
-              ).tee(() => {
-                performance?.measure(
-                  Event.endExpectation(this),
-                  startExpectation,
-                );
-              });
+              ).tee(() => {});
             })
             .tee(() => {

[Survived] BlockStatement
packages/alfa-act/src/rule.ts:355:24
                 );
               });
             })
-            .tee(() => {
-              performance?.measure(Event.end(this), startRule);
-            });
+            .tee(() => {});
         }),
       );

[Killed] LogicalOperator
packages/alfa-act/src/rule.ts:499:21
                     Applicable.isApplicable<I, T, Q, S>(outcome)
                       ? acc.prepend(outcome)
                       : acc,
-                    wasUsed || outcome.isSemiAuto,
+                    wasUsed && outcome.isSemiAuto,
                   ),
                 Tuple.of(
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r27/rule.spec.js(16,7): evaluate() passes when R22 passes

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] ConditionalExpression
packages/alfa-act/src/rule.ts:499:21
                     Applicable.isApplicable<I, T, Q, S>(outcome)
                       ? acc.prepend(outcome)
                       : acc,
-                    wasUsed || outcome.isSemiAuto,
+                    true,
                   ),
                 Tuple.of(
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r27/rule.spec.js(74,7): evaluate() is inapplicable when Applicability questions are unanswered

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     mode: 'semiAuto',

[Killed] BooleanLiteral
packages/alfa-act/src/rule.ts:503:19
                   ),
                 Tuple.of(
                   Sequence.empty<Outcome.Applicable<I, T, Q, S>>(),
-                  false,
+                  true,
                 ),
               ),
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r27/rule.spec.js(74,7): evaluate() is inapplicable when Applicability questions are unanswered

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     mode: 'semiAuto',

[Killed] BlockStatement
packages/alfa-act/src/rule.ts:508:38
               ),
             )
             .flatMap<Iterable<Outcome<I, T, Q, S>>>(([targets, oracleUsed]) => {
-              if (targets.isEmpty()) {
-                return Future.now([
-                  Outcome.Inapplicable.of(this, getMode(oracleUsed)),
-                ]);
-              }
+              if (targets.isEmpty()) {}
 
               const { expectations } = evaluate(input, rulePerformance);
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r27/rule.spec.js(74,7): evaluate() is inapplicable when Applicability questions are unanswered

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

+ []
...
- [

[Survived] MethodExpression
packages/alfa-act/src/rule.ts:519:17
               return Future.traverse(
                 // Since targets were prepended when Applicability was processed,
                 // we now need to reverse the sequence to restore initial order.
-                targets.reverse().groupBy((outcome) => outcome.target),
+                targets.groupBy((outcome) => outcome.target),
                 ([target, outcomes]) =>
                   resolve(

[Killed] LogicalOperator
packages/alfa-act/src/rule.ts:800:15
           Left.of(
             Tuple.of(
               accumulator.append([id, Maybe.toOption(result)]),
-              oracleUsedAccumulator || oracleUsed,
+              oracleUsedAccumulator && oracleUsed,
             ),
           ),
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r109/rule.spec.js(21,7): evaluate() passes documents whose lang attribute matches the main language

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] ConditionalExpression
packages/alfa-act/src/rule.ts:800:15
           Left.of(
             Tuple.of(
               accumulator.append([id, Maybe.toOption(result)]),
-              oracleUsedAccumulator || oracleUsed,
+              false,
             ),
           ),
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r109/rule.spec.js(21,7): evaluate() passes documents whose lang attribute matches the main language

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] LogicalOperator
packages/alfa-act/src/rule.ts:805:41
           ),
         // The current result is cantTell, abort.
         ([diagnostic, oracleUsed]) =>
-          Right.of(Tuple.of(diagnostic, oracleUsedAccumulator || oracleUsed)),
+          Right.of(Tuple.of(diagnostic, oracleUsedAccumulator && oracleUsed)),
       ),
     // The accumulator already contains cantTell, skip.
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-dr34/rule.spec.js(38,7): evaluate() cannot tell if questions are left unanswered

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
      diagnostic: {

[Killed] ConditionalExpression
packages/alfa-act/src/rule.ts:805:41
           ),
         // The current result is cantTell, abort.
         ([diagnostic, oracleUsed]) =>
-          Right.of(Tuple.of(diagnostic, oracleUsedAccumulator || oracleUsed)),
+          Right.of(Tuple.of(diagnostic, true)),
       ),
     // The accumulator already contains cantTell, skip.
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r109/rule.spec.js(57,7): evaluate() can't tell if questions are left unanswered

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
      diagnostic: {
