[Survived] EqualityOperator
packages/alfa-act/src/tag.ts:21:36
   public equals(value: unknown): value is this;
 
   public equals(value: unknown): boolean {
-    return value instanceof Tag && value.type === this.type;
+    return value instanceof Tag && value.type !== this.type;
   }
 

[Survived] ConditionalExpression
packages/alfa-act/src/tag.ts:21:12
   public equals(value: unknown): value is this;
 
   public equals(value: unknown): boolean {
-    return value instanceof Tag && value.type === this.type;
+    return true;
   }
 

[Survived] LogicalOperator
packages/alfa-act/src/tag.ts:44:37
     value: unknown,
     type?: T,
   ): value is Tag<T> {
-    return value instanceof Tag && (type === undefined || value.type === type);
+    return value instanceof Tag && (type === undefined && value.type === type);
   }
 }

[Survived] EqualityOperator
packages/alfa-act/src/tag.ts:44:59
     value: unknown,
     type?: T,
   ): value is Tag<T> {
-    return value instanceof Tag && (type === undefined || value.type === type);
+    return value instanceof Tag && (type === undefined || value.type !== type);
   }
 }
