[Killed] ArrayDeclaration
packages/alfa-affine/src/transformation.ts:24:7
 
     return new Transformation([
       [a, b, c, d],
-      [e, f, g, h],
+      [],
       [i, j, k, l],
       [m, n, o, p],
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(7,7): #decompose() decomposes a translation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Killed] ArrayDeclaration
packages/alfa-affine/src/transformation.ts:25:7
     return new Transformation([
       [a, b, c, d],
       [e, f, g, h],
-      [i, j, k, l],
+      [],
       [m, n, o, p],
     ]);
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(7,7): #decompose() decomposes a translation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Killed] ArrayDeclaration
packages/alfa-affine/src/transformation.ts:26:7
       [a, b, c, d],
       [e, f, g, h],
       [i, j, k, l],
-      [m, n, o, p],
+      [],
     ]);
   }
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(7,7): #decompose() decomposes a translation transformation

Expected values to be strictly deep-equal:
+ actual - expected

  {
    perspective: [
+     NaN,

[Killed] EqualityOperator
packages/alfa-affine/src/transformation.ts:72:9
   public decompose(): Option<Transformation.Components> {
     const m = this._matrix;
 
-    if (m[3][3] === 0) {
+    if (m[3][3] !== 0) {
       return None;
     }
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): #decompose() decomposes a translation transformation
Error: Attempted to .getUnsafe() from None

[Survived] ConditionalExpression
packages/alfa-affine/src/transformation.ts:72:9
   public decompose(): Option<Transformation.Components> {
     const m = this._matrix;
 
-    if (m[3][3] === 0) {
+    if (false) {
       return None;
     }

[Killed] UpdateOperator
packages/alfa-affine/src/transformation.ts:76:28
       return None;
     }
 
-    for (let i = 0; i < 4; i++) {
+    for (let i = 0; i < 4; i--) {
       for (let j = 0; j < 4; j++) {
         m[i][j] /= m[3][3];
killedBy: All tests
statusReason: packages/alfa-affine/src/transformation.js(173,104): #decompose() decomposes a translation transformation
TypeError: Cannot read properties of undefined (reading '0')

[Killed] EqualityOperator
packages/alfa-affine/src/transformation.ts:76:21
       return None;
     }
 
-    for (let i = 0; i < 4; i++) {
+    for (let i = 0; i <= 4; i++) {
       for (let j = 0; j < 4; j++) {
         m[i][j] /= m[3][3];
killedBy: All tests
statusReason: packages/alfa-affine/src/transformation.js(173,104): #decompose() decomposes a translation transformation
TypeError: Cannot read properties of undefined (reading '0')

[Killed] EqualityOperator
packages/alfa-affine/src/transformation.ts:77:23
     }
 
     for (let i = 0; i < 4; i++) {
-      for (let j = 0; j < 4; j++) {
+      for (let j = 0; j <= 4; j++) {
         m[i][j] /= m[3][3];
       }
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(34,7): #decompose() decomposes a perspective transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
+     NaN,

[Timeout] UpdateOperator
packages/alfa-affine/src/transformation.ts:77:30
     }
 
     for (let i = 0; i < 4; i++) {
-      for (let j = 0; j < 4; j++) {
+      for (let j = 0; j < 4; j--) {
         m[i][j] /= m[3][3];
       }

[Survived] AssignmentOperator
packages/alfa-affine/src/transformation.ts:78:9
 
     for (let i = 0; i < 4; i++) {
       for (let j = 0; j < 4; j++) {
-        m[i][j] /= m[3][3];
+        m[i][j] *= m[3][3];
       }
     }

[Killed] BlockStatement
packages/alfa-affine/src/transformation.ts:85:33
     // Perspective
     let p: Matrix | Vector = Matrix.clone(m);
 
-    for (let i = 0; i < 3; i++) {
-      p[3][i] = 0;
-    }
+    for (let i = 0; i < 3; i++) {}
 
     p[3][3] = 1;
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(34,7): #decompose() decomposes a perspective transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
      0,

[Killed] EqualityOperator
packages/alfa-affine/src/transformation.ts:85:21
     // Perspective
     let p: Matrix | Vector = Matrix.clone(m);
 
-    for (let i = 0; i < 3; i++) {
+    for (let i = 0; i >= 3; i++) {
       p[3][i] = 0;
     }
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(34,7): #decompose() decomposes a perspective transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
      0,

[Killed] EqualityOperator
packages/alfa-affine/src/transformation.ts:91:9
 
     p[3][3] = 1;
 
-    if (determinant(p) === 0) {
+    if (determinant(p) !== 0) {
       return None;
     }
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): #decompose() decomposes a translation transformation
Error: Attempted to .getUnsafe() from None

[Survived] ConditionalExpression
packages/alfa-affine/src/transformation.ts:91:9
 
     p[3][3] = 1;
 
-    if (determinant(p) === 0) {
+    if (false) {
       return None;
     }

[Killed] LogicalOperator
packages/alfa-affine/src/transformation.ts:95:9
       return None;
     }
 
-    if (m[3][0] !== 0 || m[3][1] !== 0 || m[3][2] !== 0) {
+    if ((m[3][0] !== 0 || m[3][1] !== 0) && m[3][2] !== 0) {
       p = multiply(
         transpose(inverse(p)),
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(34,7): #decompose() decomposes a perspective transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
      0,

[Killed] EqualityOperator
packages/alfa-affine/src/transformation.ts:95:43
       return None;
     }
 
-    if (m[3][0] !== 0 || m[3][1] !== 0 || m[3][2] !== 0) {
+    if (m[3][0] !== 0 || m[3][1] !== 0 || m[3][2] === 0) {
       p = multiply(
         transpose(inverse(p)),
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(34,7): #decompose() decomposes a perspective transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
      0,

[Killed] ArrayDeclaration
packages/alfa-affine/src/transformation.ts:98:25
     if (m[3][0] !== 0 || m[3][1] !== 0 || m[3][2] !== 0) {
       p = multiply(
         transpose(inverse(p)),
-        m[3].map((v) => [v]),
+        m[3].map((v) => []),
       ).map(([v]) => v);
     } else {
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(34,7): #decompose() decomposes a perspective transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
+     undefined,

[Killed] ArrayDeclaration
packages/alfa-affine/src/transformation.ts:108:7
     const t = [m[0][3], m[1][3], m[2][3]];
 
     const u = [
-      [m[0][0], m[0][1], m[0][2]],
+      [],
       [m[1][0], m[1][1], m[1][2]],
       [m[2][0], m[2][1], m[2][2]],
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(7,7): #decompose() decomposes a translation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Killed] ArrayDeclaration
packages/alfa-affine/src/transformation.ts:109:7
 
     const u = [
       [m[0][0], m[0][1], m[0][2]],
-      [m[1][0], m[1][1], m[1][2]],
+      [],
       [m[2][0], m[2][1], m[2][2]],
     ];
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(7,7): #decompose() decomposes a translation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Survived] UnaryOperator
packages/alfa-affine/src/transformation.ts:121:35
     // Skew
     const z = [dot(u[0], u[1]), 0, 0];
 
-    u[1] = combine(u[1], u[0], 1, -z[0]);
+    u[1] = combine(u[1], u[0], 1, +z[0]);
 
     s[1] = norm(u[1]);

[Survived] AssignmentOperator
packages/alfa-affine/src/transformation.ts:125:5
 
     s[1] = norm(u[1]);
     u[1] = normalize(u[1]);
-    z[0] /= s[1];
+    z[0] *= s[1];
 
     z[1] = dot(u[0], u[2]);

[Survived] UnaryOperator
packages/alfa-affine/src/transformation.ts:128:37
     z[0] /= s[1];
 
     z[1] = dot(u[0], u[2]);
-    u[2] = combine(u[2], u[0], 1.0, -z[1]);
+    u[2] = combine(u[2], u[0], 1.0, +z[1]);
     z[2] = dot(u[1], u[2]);
     u[2] = combine(u[2], u[1], 1.0, -z[2]);

[Survived] UnaryOperator
packages/alfa-affine/src/transformation.ts:130:37
     z[1] = dot(u[0], u[2]);
     u[2] = combine(u[2], u[0], 1.0, -z[1]);
     z[2] = dot(u[1], u[2]);
-    u[2] = combine(u[2], u[1], 1.0, -z[2]);
+    u[2] = combine(u[2], u[1], 1.0, +z[2]);
 
     s[2] = norm(u[2]);

[Survived] AssignmentOperator
packages/alfa-affine/src/transformation.ts:134:5
 
     s[2] = norm(u[2]);
     u[2] = normalize(u[2]);
-    z[1] /= s[2];
+    z[1] *= s[2];
     z[2] /= s[2];
 

[Survived] AssignmentOperator
packages/alfa-affine/src/transformation.ts:135:5
     s[2] = norm(u[2]);
     u[2] = normalize(u[2]);
     z[1] /= s[2];
-    z[2] /= s[2];
+    z[2] *= s[2];
 
     if (dot(u[0], cross(u[1], u[2])) < 0) {

[Killed] ConditionalExpression
packages/alfa-affine/src/transformation.ts:137:9
     z[1] /= s[2];
     z[2] /= s[2];
 
-    if (dot(u[0], cross(u[1], u[2])) < 0) {
+    if (true) {
       for (let i = 0; i < 3; i++) {
         s[i] *= -1;
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(7,7): #decompose() decomposes a translation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Killed] EqualityOperator
packages/alfa-affine/src/transformation.ts:137:9
     z[1] /= s[2];
     z[2] /= s[2];
 
-    if (dot(u[0], cross(u[1], u[2])) < 0) {
+    if (dot(u[0], cross(u[1], u[2])) >= 0) {
       for (let i = 0; i < 3; i++) {
         s[i] *= -1;
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(7,7): #decompose() decomposes a translation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Survived] BlockStatement
packages/alfa-affine/src/transformation.ts:138:35
     z[2] /= s[2];
 
     if (dot(u[0], cross(u[1], u[2])) < 0) {
-      for (let i = 0; i < 3; i++) {
-        s[i] *= -1;
-        u[i][0] *= -1;
-        u[i][1] *= -1;
-        u[i][2] *= -1;
-      }
+      for (let i = 0; i < 3; i++) {}
     }
 

[Survived] UpdateOperator
packages/alfa-affine/src/transformation.ts:138:30
     z[2] /= s[2];
 
     if (dot(u[0], cross(u[1], u[2])) < 0) {
-      for (let i = 0; i < 3; i++) {
+      for (let i = 0; i < 3; i--) {
         s[i] *= -1;
         u[i][0] *= -1;

[Survived] UnaryOperator
packages/alfa-affine/src/transformation.ts:139:17
 
     if (dot(u[0], cross(u[1], u[2])) < 0) {
       for (let i = 0; i < 3; i++) {
-        s[i] *= -1;
+        s[i] *= +1;
         u[i][0] *= -1;
         u[i][1] *= -1;

[Survived] AssignmentOperator
packages/alfa-affine/src/transformation.ts:139:9
 
     if (dot(u[0], cross(u[1], u[2])) < 0) {
       for (let i = 0; i < 3; i++) {
-        s[i] *= -1;
+        s[i] /= -1;
         u[i][0] *= -1;
         u[i][1] *= -1;

[Survived] UnaryOperator
packages/alfa-affine/src/transformation.ts:140:20
     if (dot(u[0], cross(u[1], u[2])) < 0) {
       for (let i = 0; i < 3; i++) {
         s[i] *= -1;
-        u[i][0] *= -1;
+        u[i][0] *= +1;
         u[i][1] *= -1;
         u[i][2] *= -1;

[Survived] AssignmentOperator
packages/alfa-affine/src/transformation.ts:140:9
     if (dot(u[0], cross(u[1], u[2])) < 0) {
       for (let i = 0; i < 3; i++) {
         s[i] *= -1;
-        u[i][0] *= -1;
+        u[i][0] /= -1;
         u[i][1] *= -1;
         u[i][2] *= -1;

[Survived] UnaryOperator
packages/alfa-affine/src/transformation.ts:141:20
       for (let i = 0; i < 3; i++) {
         s[i] *= -1;
         u[i][0] *= -1;
-        u[i][1] *= -1;
+        u[i][1] *= +1;
         u[i][2] *= -1;
       }

[Survived] AssignmentOperator
packages/alfa-affine/src/transformation.ts:141:9
       for (let i = 0; i < 3; i++) {
         s[i] *= -1;
         u[i][0] *= -1;
-        u[i][1] *= -1;
+        u[i][1] /= -1;
         u[i][2] *= -1;
       }

[Survived] AssignmentOperator
packages/alfa-affine/src/transformation.ts:142:9
         s[i] *= -1;
         u[i][0] *= -1;
         u[i][1] *= -1;
-        u[i][2] *= -1;
+        u[i][2] /= -1;
       }
     }

[Survived] UnaryOperator
packages/alfa-affine/src/transformation.ts:142:20
         s[i] *= -1;
         u[i][0] *= -1;
         u[i][1] *= -1;
-        u[i][2] *= -1;
+        u[i][2] *= +1;
       }
     }

[Killed] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:148:22
 
     // Rotate
     const r = [
-      0.5 * sqrt(max(1 + u[0][0] - u[1][1] - u[2][2], 0)),
+      0.5 * sqrt(max(1 + u[0][0] + u[1][1] - u[2][2], 0)),
       0.5 * sqrt(max(1 - u[0][0] + u[1][1] - u[2][2], 0)),
       0.5 * sqrt(max(1 - u[0][0] - u[1][1] + u[2][2], 0)),
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(7,7): #decompose() decomposes a translation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Killed] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:148:22
 
     // Rotate
     const r = [
-      0.5 * sqrt(max(1 + u[0][0] - u[1][1] - u[2][2], 0)),
+      0.5 * sqrt(max(1 + u[0][0] - u[1][1] + u[2][2], 0)),
       0.5 * sqrt(max(1 - u[0][0] + u[1][1] - u[2][2], 0)),
       0.5 * sqrt(max(1 - u[0][0] - u[1][1] + u[2][2], 0)),
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(7,7): #decompose() decomposes a translation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Killed] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:149:22
     // Rotate
     const r = [
       0.5 * sqrt(max(1 + u[0][0] - u[1][1] - u[2][2], 0)),
-      0.5 * sqrt(max(1 - u[0][0] + u[1][1] - u[2][2], 0)),
+      0.5 * sqrt(max(1 - u[0][0] + u[1][1] + u[2][2], 0)),
       0.5 * sqrt(max(1 - u[0][0] - u[1][1] + u[2][2], 0)),
       0.5 * sqrt(max(1 + u[0][0] + u[1][1] + u[2][2], 0)),
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(7,7): #decompose() decomposes a translation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Killed] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:149:22
     // Rotate
     const r = [
       0.5 * sqrt(max(1 + u[0][0] - u[1][1] - u[2][2], 0)),
-      0.5 * sqrt(max(1 - u[0][0] + u[1][1] - u[2][2], 0)),
+      0.5 * sqrt(max(1 + u[0][0] + u[1][1] - u[2][2], 0)),
       0.5 * sqrt(max(1 - u[0][0] - u[1][1] + u[2][2], 0)),
       0.5 * sqrt(max(1 + u[0][0] + u[1][1] + u[2][2], 0)),
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(7,7): #decompose() decomposes a translation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Killed] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:150:22
     const r = [
       0.5 * sqrt(max(1 + u[0][0] - u[1][1] - u[2][2], 0)),
       0.5 * sqrt(max(1 - u[0][0] + u[1][1] - u[2][2], 0)),
-      0.5 * sqrt(max(1 - u[0][0] - u[1][1] + u[2][2], 0)),
+      0.5 * sqrt(max(1 - u[0][0] - u[1][1] - u[2][2], 0)),
       0.5 * sqrt(max(1 + u[0][0] + u[1][1] + u[2][2], 0)),
     ];
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(25,7): #decompose() decomposes a rotation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Killed] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:150:7
     const r = [
       0.5 * sqrt(max(1 + u[0][0] - u[1][1] - u[2][2], 0)),
       0.5 * sqrt(max(1 - u[0][0] + u[1][1] - u[2][2], 0)),
-      0.5 * sqrt(max(1 - u[0][0] - u[1][1] + u[2][2], 0)),
+      0.5 / sqrt(max(1 - u[0][0] - u[1][1] + u[2][2], 0)),
       0.5 * sqrt(max(1 + u[0][0] + u[1][1] + u[2][2], 0)),
     ];
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(7,7): #decompose() decomposes a translation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Killed] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:151:22
       0.5 * sqrt(max(1 + u[0][0] - u[1][1] - u[2][2], 0)),
       0.5 * sqrt(max(1 - u[0][0] + u[1][1] - u[2][2], 0)),
       0.5 * sqrt(max(1 - u[0][0] - u[1][1] + u[2][2], 0)),
-      0.5 * sqrt(max(1 + u[0][0] + u[1][1] + u[2][2], 0)),
+      0.5 * sqrt(max(1 - u[0][0] + u[1][1] + u[2][2], 0)),
     ];
 
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(7,7): #decompose() decomposes a translation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Killed] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:151:22
       0.5 * sqrt(max(1 + u[0][0] - u[1][1] - u[2][2], 0)),
       0.5 * sqrt(max(1 - u[0][0] + u[1][1] - u[2][2], 0)),
       0.5 * sqrt(max(1 - u[0][0] - u[1][1] + u[2][2], 0)),
-      0.5 * sqrt(max(1 + u[0][0] + u[1][1] + u[2][2], 0)),
+      0.5 * sqrt(max(1 + u[0][0] + u[1][1] - u[2][2], 0)),
     ];
 
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(7,7): #decompose() decomposes a translation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Killed] ConditionalExpression
packages/alfa-affine/src/transformation.ts:154:9
       0.5 * sqrt(max(1 + u[0][0] + u[1][1] + u[2][2], 0)),
     ];
 
-    if (u[2][1] > u[1][2]) {
+    if (true) {
       r[0] = -r[0];
     }
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(7,7): #decompose() decomposes a translation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Killed] EqualityOperator
packages/alfa-affine/src/transformation.ts:154:9
       0.5 * sqrt(max(1 + u[0][0] + u[1][1] + u[2][2], 0)),
     ];
 
-    if (u[2][1] > u[1][2]) {
+    if (u[2][1] >= u[1][2]) {
       r[0] = -r[0];
     }
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(7,7): #decompose() decomposes a translation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Survived] UnaryOperator
packages/alfa-affine/src/transformation.ts:155:14
     ];
 
     if (u[2][1] > u[1][2]) {
-      r[0] = -r[0];
+      r[0] = +r[0];
     }
 

[Killed] ConditionalExpression
packages/alfa-affine/src/transformation.ts:158:9
       r[0] = -r[0];
     }
 
-    if (u[0][2] > u[2][0]) {
+    if (true) {
       r[1] = -r[1];
     }
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(7,7): #decompose() decomposes a translation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Killed] EqualityOperator
packages/alfa-affine/src/transformation.ts:158:9
       r[0] = -r[0];
     }
 
-    if (u[0][2] > u[2][0]) {
+    if (u[0][2] >= u[2][0]) {
       r[1] = -r[1];
     }
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(7,7): #decompose() decomposes a translation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Survived] UnaryOperator
packages/alfa-affine/src/transformation.ts:159:14
     }
 
     if (u[0][2] > u[2][0]) {
-      r[1] = -r[1];
+      r[1] = +r[1];
     }
 

[Killed] ConditionalExpression
packages/alfa-affine/src/transformation.ts:162:9
       r[1] = -r[1];
     }
 
-    if (u[1][0] > u[0][1]) {
+    if (false) {
       r[2] = -r[2];
     }
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(25,7): #decompose() decomposes a rotation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Killed] EqualityOperator
packages/alfa-affine/src/transformation.ts:162:9
       r[1] = -r[1];
     }
 
-    if (u[1][0] > u[0][1]) {
+    if (u[1][0] <= u[0][1]) {
       r[2] = -r[2];
     }
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(7,7): #decompose() decomposes a translation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Killed] UnaryOperator
packages/alfa-affine/src/transformation.ts:163:14
     }
 
     if (u[1][0] > u[0][1]) {
-      r[2] = -r[2];
+      r[2] = +r[2];
     }
 
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(25,7): #decompose() decomposes a rotation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Survived] ConditionalExpression
packages/alfa-affine/src/transformation.ts:177:7
 
   public equals(value: unknown): value is this {
     return (
-      value instanceof Transformation &&
-      Matrix.equals(value._matrix, this._matrix)
+      false
     );
   }

[Survived] ConditionalExpression
packages/alfa-affine/src/transformation.ts:177:7
 
   public equals(value: unknown): value is this {
     return (
-      value instanceof Transformation &&
-      Matrix.equals(value._matrix, this._matrix)
+      true
     );
   }

[Killed] ArrayDeclaration
packages/alfa-affine/src/transformation.ts:232:7
     return Transformation.of([
       [1, 0, 0, tx],
       [0, 1, 0, ty],
-      [0, 0, 1, tz],
+      [],
       [0, 0, 0, 1],
     ]);
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(7,7): #decompose() decomposes a translation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Killed] ArrayDeclaration
packages/alfa-affine/src/transformation.ts:263:7
     const [x, y, z] = normalize(u);
 
     return Transformation.of([
-      [
-        cos(a) + x ** 2 * (1 - cos(a)),
-        x * y * (1 - cos(a)) - z * sin(a),
-        x * z * (1 - cos(a)) + y * sin(a),
-      ],
+      [],
       [
         y * x * (1 - cos(a)) + z * sin(a),
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(25,7): #decompose() decomposes a rotation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Survived] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:264:28
 
     return Transformation.of([
       [
-        cos(a) + x ** 2 * (1 - cos(a)),
+        cos(a) + x ** 2 * (1 + cos(a)),
         x * y * (1 - cos(a)) - z * sin(a),
         x * z * (1 - cos(a)) + y * sin(a),

[Survived] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:264:9
 
     return Transformation.of([
       [
-        cos(a) + x ** 2 * (1 - cos(a)),
+        cos(a) - x ** 2 * (1 - cos(a)),
         x * y * (1 - cos(a)) - z * sin(a),
         x * z * (1 - cos(a)) + y * sin(a),

[Killed] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:265:9
     return Transformation.of([
       [
         cos(a) + x ** 2 * (1 - cos(a)),
-        x * y * (1 - cos(a)) - z * sin(a),
+        x * y * (1 - cos(a)) + z * sin(a),
         x * z * (1 - cos(a)) + y * sin(a),
       ],
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(25,7): #decompose() decomposes a rotation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Killed] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:265:9
     return Transformation.of([
       [
         cos(a) + x ** 2 * (1 - cos(a)),
-        x * y * (1 - cos(a)) - z * sin(a),
+        x / y * (1 - cos(a)) - z * sin(a),
         x * z * (1 - cos(a)) + y * sin(a),
       ],
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(25,7): #decompose() decomposes a rotation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Survived] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:266:32
       [
         cos(a) + x ** 2 * (1 - cos(a)),
         x * y * (1 - cos(a)) - z * sin(a),
-        x * z * (1 - cos(a)) + y * sin(a),
+        x * z * (1 - cos(a)) + y / sin(a),
       ],
       [

[Survived] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:266:9
       [
         cos(a) + x ** 2 * (1 - cos(a)),
         x * y * (1 - cos(a)) - z * sin(a),
-        x * z * (1 - cos(a)) + y * sin(a),
+        x * z * (1 - cos(a)) - y * sin(a),
       ],
       [

[Killed] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:269:9
         x * z * (1 - cos(a)) + y * sin(a),
       ],
       [
-        y * x * (1 - cos(a)) + z * sin(a),
+        y * x * (1 - cos(a)) - z * sin(a),
         cos(a) + y ** 2 * (1 - cos(a)),
         y * z * (1 - cos(a)) - x * sin(a),
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(25,7): #decompose() decomposes a rotation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Killed] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:269:32
         x * z * (1 - cos(a)) + y * sin(a),
       ],
       [
-        y * x * (1 - cos(a)) + z * sin(a),
+        y * x * (1 - cos(a)) + z / sin(a),
         cos(a) + y ** 2 * (1 - cos(a)),
         y * z * (1 - cos(a)) - x * sin(a),
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(25,7): #decompose() decomposes a rotation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Survived] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:270:28
       ],
       [
         y * x * (1 - cos(a)) + z * sin(a),
-        cos(a) + y ** 2 * (1 - cos(a)),
+        cos(a) + y ** 2 * (1 + cos(a)),
         y * z * (1 - cos(a)) - x * sin(a),
       ],

[Survived] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:270:18
       ],
       [
         y * x * (1 - cos(a)) + z * sin(a),
-        cos(a) + y ** 2 * (1 - cos(a)),
+        cos(a) + y ** 2 / (1 - cos(a)),
         y * z * (1 - cos(a)) - x * sin(a),
       ],

[Survived] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:271:9
       [
         y * x * (1 - cos(a)) + z * sin(a),
         cos(a) + y ** 2 * (1 - cos(a)),
-        y * z * (1 - cos(a)) - x * sin(a),
+        y * z * (1 - cos(a)) + x * sin(a),
       ],
       [

[Survived] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:271:32
       [
         y * x * (1 - cos(a)) + z * sin(a),
         cos(a) + y ** 2 * (1 - cos(a)),
-        y * z * (1 - cos(a)) - x * sin(a),
+        y * z * (1 - cos(a)) - x / sin(a),
       ],
       [

[Killed] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:274:9
         y * z * (1 - cos(a)) - x * sin(a),
       ],
       [
-        z * x * (1 - cos(a)) - y * sin(a),
+        z / x * (1 - cos(a)) - y * sin(a),
         z * y * (1 - cos(a)) + x * sin(a),
         cos(a) + z ** 2 * (1 - cos(a)),
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(25,7): #decompose() decomposes a rotation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Survived] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:274:9
         y * z * (1 - cos(a)) - x * sin(a),
       ],
       [
-        z * x * (1 - cos(a)) - y * sin(a),
+        z * x * (1 - cos(a)) + y * sin(a),
         z * y * (1 - cos(a)) + x * sin(a),
         cos(a) + z ** 2 * (1 - cos(a)),

[Killed] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:275:9
       ],
       [
         z * x * (1 - cos(a)) - y * sin(a),
-        z * y * (1 - cos(a)) + x * sin(a),
+        z / y * (1 - cos(a)) + x * sin(a),
         cos(a) + z ** 2 * (1 - cos(a)),
       ],
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(25,7): #decompose() decomposes a rotation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Survived] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:275:9
       ],
       [
         z * x * (1 - cos(a)) - y * sin(a),
-        z * y * (1 - cos(a)) + x * sin(a),
+        z * y * (1 - cos(a)) - x * sin(a),
         cos(a) + z ** 2 * (1 - cos(a)),
       ],

[Killed] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:276:18
       [
         z * x * (1 - cos(a)) - y * sin(a),
         z * y * (1 - cos(a)) + x * sin(a),
-        cos(a) + z ** 2 * (1 - cos(a)),
+        cos(a) + z ** 2 / (1 - cos(a)),
       ],
     ]);
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(25,7): #decompose() decomposes a rotation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...
