[Killed] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:276:28
       [
         z * x * (1 - cos(a)) - y * sin(a),
         z * y * (1 - cos(a)) + x * sin(a),
-        cos(a) + z ** 2 * (1 - cos(a)),
+        cos(a) + z ** 2 * (1 + cos(a)),
       ],
     ]);
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(25,7): #decompose() decomposes a rotation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Survived] ArrayDeclaration
packages/alfa-affine/src/transformation.ts:283:7
 
   export function perspective(d: number): Transformation {
     return Transformation.of([
-      [1, 0, 0, 0],
+      [],
       [0, 1, 0, 0],
       [0, 0, 1, 0],

[Killed] UnaryOperator
packages/alfa-affine/src/transformation.ts:286:14
       [1, 0, 0, 0],
       [0, 1, 0, 0],
       [0, 0, 1, 0],
-      [0, 0, -1 / d, 1],
+      [0, 0, +1 / d, 1],
     ]);
   }
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(34,7): #decompose() decomposes a perspective transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
      0,

[Killed] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:286:14
       [1, 0, 0, 0],
       [0, 1, 0, 0],
       [0, 0, 1, 0],
-      [0, 0, -1 / d, 1],
+      [0, 0, -1 * d, 1],
     ]);
   }
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(34,7): #decompose() decomposes a perspective transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
      0,

[Killed] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:293:5
 
 function combine(a: Vector, b: Vector, ascl: number, bscl: number): Vector {
   return [
-    ascl * a[0] + bscl * b[0],
+    ascl / a[0] + bscl * b[0],
     ascl * a[1] + bscl * b[1],
     ascl * a[2] + bscl * b[2],
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(7,7): #decompose() decomposes a translation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Killed] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:293:19
 
 function combine(a: Vector, b: Vector, ascl: number, bscl: number): Vector {
   return [
-    ascl * a[0] + bscl * b[0],
+    ascl * a[0] + bscl / b[0],
     ascl * a[1] + bscl * b[1],
     ascl * a[2] + bscl * b[2],
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(7,7): #decompose() decomposes a translation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Killed] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:294:5
 function combine(a: Vector, b: Vector, ascl: number, bscl: number): Vector {
   return [
     ascl * a[0] + bscl * b[0],
-    ascl * a[1] + bscl * b[1],
+    ascl / a[1] + bscl * b[1],
     ascl * a[2] + bscl * b[2],
   ];
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(7,7): #decompose() decomposes a translation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Killed] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:294:19
 function combine(a: Vector, b: Vector, ascl: number, bscl: number): Vector {
   return [
     ascl * a[0] + bscl * b[0],
-    ascl * a[1] + bscl * b[1],
+    ascl * a[1] + bscl / b[1],
     ascl * a[2] + bscl * b[2],
   ];
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(7,7): #decompose() decomposes a translation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Killed] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:295:5
   return [
     ascl * a[0] + bscl * b[0],
     ascl * a[1] + bscl * b[1],
-    ascl * a[2] + bscl * b[2],
+    ascl / a[2] + bscl * b[2],
   ];
 }
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(7,7): #decompose() decomposes a translation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...

[Killed] ArithmeticOperator
packages/alfa-affine/src/transformation.ts:295:19
   return [
     ascl * a[0] + bscl * b[0],
     ascl * a[1] + bscl * b[1],
-    ascl * a[2] + bscl * b[2],
+    ascl * a[2] + bscl / b[2],
   ];
 }
killedBy: All tests
statusReason: packages/alfa-affine/test/transformation.spec.js(7,7): #decompose() decomposes a translation transformation

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    perspective: [
...
