[Survived] BlockStatement
packages/alfa-aria/src/attribute.ts:52:25
   public get default(): Option<Attribute.Default<N>> {
     const value = Attributes[this._name].default;
 
-    if (value === null) {
-      return None;
-    }
+    if (value === null) {}
 
     return Option.of(value as Attribute.Default<N>);

[Survived] ConditionalExpression
packages/alfa-aria/src/attribute.ts:52:9
   public get default(): Option<Attribute.Default<N>> {
     const value = Attributes[this._name].default;
 
-    if (value === null) {
+    if (false) {
       return None;
     }

[Killed] BlockStatement
packages/alfa-aria/src/attribute.ts:62:27
   public get options(): Sequence<Attribute.Option<N>> {
     const options = Attributes[this._name].options;
 
-    if (options === null) {
-      return Sequence.empty();
-    }
+    if (options === null) {}
 
     return Sequence.from(options as Iterable<Attribute.Option<N>>);
killedBy: All tests
statusReason: packages/alfa-sequence/src/sequence.js(56,37): evaluate() passes an aria-required attribute with a valid true value
TypeError: object null is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ConditionalExpression
packages/alfa-aria/src/attribute.ts:62:9
   public get options(): Sequence<Attribute.Option<N>> {
     const options = Attributes[this._name].options;
 
-    if (options === null) {
+    if (false) {
       return Sequence.empty();
     }
killedBy: All tests
statusReason: packages/alfa-sequence/src/sequence.js(56,37): evaluate() passes an aria-required attribute with a valid true value
TypeError: object null is not iterable (cannot read property Symbol(Symbol.iterator))

[Survived] ConditionalExpression
packages/alfa-aria/src/attribute.ts:78:7
 
   public equals(value: unknown): value is this {
     return (
-      value instanceof Attribute &&
-      value._name === this._name &&
-      value._value === this._value
+      false
     );
   }

[Survived] ConditionalExpression
packages/alfa-aria/src/attribute.ts:78:7
 
   public equals(value: unknown): value is this {
     return (
-      value instanceof Attribute &&
-      value._name === this._name &&
-      value._value === this._value
+      true
     );
   }

[Survived] EqualityOperator
packages/alfa-aria/src/attribute.ts:79:7
   public equals(value: unknown): value is this {
     return (
       value instanceof Attribute &&
-      value._name === this._name &&
+      value._name !== this._name &&
       value._value === this._value
     );

[Survived] ConditionalExpression
packages/alfa-aria/src/attribute.ts:79:7
   public equals(value: unknown): value is this {
     return (
       value instanceof Attribute &&
-      value._name === this._name &&
+      true &&
       value._value === this._value
     );

[Survived] ConditionalExpression
packages/alfa-aria/src/attribute.ts:80:7
     return (
       value instanceof Attribute &&
       value._name === this._name &&
-      value._value === this._value
+      true
     );
   }

[Survived] EqualityOperator
packages/alfa-aria/src/attribute.ts:80:7
     return (
       value instanceof Attribute &&
       value._name === this._name &&
-      value._value === this._value
+      value._value !== this._value
     );
   }
