[Killed] BooleanLiteral
src/dom/predicate/has-accessible-name.ts:32:53
 
 export function hasAccessibleName<T extends Element | Text>(
   device: Device,
-  nameOrPredicate: Predicate<Name> | string = () => true,
+  nameOrPredicate: Predicate<Name> | string = () => false,
   ...names: Array<string>
 ): Predicate<T> {
killedBy: All tests
statusReason: packages/alfa-aria/test/dom/predicate/has-incorrect-role-without-name.spec.js(24,7): hasIncorrectRoleWithoutName returns false for named `<section>`

Expected values to be strictly deep-equal:

true !== false
