[Killed] BooleanLiteral
src/dom/predicate/has-explicit-role.ts:24:56
 ): Predicate<Element>;
 
 export function hasExplicitRole(
-  nameOrPredicate: Predicate<Role> | Role.Name = () => true,
+  nameOrPredicate: Predicate<Role> | Role.Name = () => false,
   ...names: Array<Role.Name>
 ): Predicate<Element> {
killedBy: All tests
statusReason: packages/alfa-aria/test/dom/predicate/has-incorrect-role-without-name.spec.js(30,7): hasIncorrectRoleWithoutName returns false for `<section>` with explicit role

Expected values to be strictly deep-equal:

true !== false

[Killed] BlockStatement
src/dom/predicate/has-explicit-role.ts:29:46
 ): Predicate<Element> {
   let predicate: Predicate<Role>;
 
-  if (typeof nameOrPredicate === "function") {
-    predicate = nameOrPredicate;
-  } else {
+  if (typeof nameOrPredicate === "function") {} else {
     predicate = property("name", equals(nameOrPredicate, ...names));
   }
killedBy: All tests
statusReason: packages/alfa-predicate/src/predicate.js(11,16): hasIncorrectRoleWithoutName returns false for `<section>` with explicit role
TypeError: predicate is not a function

[Killed] BlockStatement
src/dom/predicate/has-explicit-role.ts:31:10
 
   if (typeof nameOrPredicate === "function") {
     predicate = nameOrPredicate;
-  } else {
-    predicate = property("name", equals(nameOrPredicate, ...names));
-  }
+  } else {}
 
   return (element) => Role.fromExplicit(element).some(predicate);
killedBy: All tests
statusReason: packages/alfa-predicate/src/predicate.js(11,16): evaluates() passes SVG with img role and a name
TypeError: predicate is not a function

[Killed] MethodExpression
src/dom/predicate/has-explicit-role.ts:35:23
     predicate = property("name", equals(nameOrPredicate, ...names));
   }
 
-  return (element) => Role.fromExplicit(element).some(predicate);
+  return (element) => Role.fromExplicit(element).every(predicate);
 }
 
killedBy: All tests
statusReason: packages/alfa-aria/test/dom/predicate/has-incorrect-role-without-name.spec.js(18,7): hasIncorrectRoleWithoutName returns true for nameless `<section>`

Expected values to be strictly deep-equal:

false !== true
