[Survived] BooleanLiteral
src/dom/predicate/has-heading-level.ts:12:41
  */
 export function hasHeadingLevel(
   device: Device,
-  predicate: Predicate<number> = (n) => !isNaN(n),
+  predicate: Predicate<number> = (n) => isNaN(n),
 ): Predicate<Element> {
   return (element) =>

[Survived] MethodExpression
src/dom/predicate/has-heading-level.ts:15:5
   predicate: Predicate<number> = (n) => !isNaN(n),
 ): Predicate<Element> {
   return (element) =>
-    Node.from(element, device)
-      .attribute("aria-level")
-      .map((level) => Number(level.value))
-      .some(predicate);
+    Node.from(element, device).attribute("aria-level").map(level => Number(level.value)).every(predicate);
 }
 
