[Survived] MethodExpression
src/dom/predicate/has-implicit-role.ts:35:23
     predicate = property("name", equals(nameOrPredicate, ...names));
   }
 
-  return (element) => Role.fromImplicit(element).some(predicate);
+  return (element) => Role.fromImplicit(element).every(predicate);
 }
 
