[Killed] StringLiteral
src/dom/predicate/has-incorrect-role-without-name.ts:33:11
  * aside elements are roleless when scoped to sectioning content.
  */
 const hasSuspiciousRole = or(
-  hasName("form", "section"),
+  hasName("", "section"),
   and(hasName("aside"), isScopedTo("article", "aside", "nav", "section")),
 );
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r56/rule.spec.js(57,7): evaluate() is inapplicable to form without accessible name and role

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     expectations: [
