[Killed] ConditionalExpression
src/dom/predicate/has-non-empty-accessible-name.ts:16:25
 ): Predicate<T> {
   return hasAccessibleName(
     device,
-    hasValue((value) => value.trim().length > 0),
+    hasValue((value) => true),
   );
 }
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r8/rule.spec.js(82,7): evaluate() fails a input element with empty aria-label

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] EqualityOperator
src/dom/predicate/has-non-empty-accessible-name.ts:16:25
 ): Predicate<T> {
   return hasAccessibleName(
     device,
-    hasValue((value) => value.trim().length > 0),
+    hasValue((value) => value.trim().length >= 0),
   );
 }
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r8/rule.spec.js(82,7): evaluate() fails a input element with empty aria-label

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...
