[Survived] BooleanLiteral
src/dom/predicate/has-role.ts:29:56
 
 export function hasRole(
   device: Device,
-  nameOrPredicate: Predicate<Role> | Role.Name = () => true,
+  nameOrPredicate: Predicate<Role> | Role.Name = () => false,
   ...names: Array<Role.Name>
 ): Predicate<Element> {

[Killed] BlockStatement
src/dom/predicate/has-role.ts:36:10
 
   if (typeof nameOrPredicate === "function") {
     predicate = nameOrPredicate;
-  } else {
-    predicate = hasName(nameOrPredicate, ...names);
-  }
+  } else {}
 
   return (element) => Node.from(element, device).role.some(predicate);
killedBy: All tests
statusReason: packages/alfa-predicate/src/predicate.js(11,16): hasIncorrectRoleWithoutName returns true for nameless `<section>`
TypeError: predicate is not a function

[Killed] MethodExpression
src/dom/predicate/has-role.ts:40:23
     predicate = hasName(nameOrPredicate, ...names);
   }
 
-  return (element) => Node.from(element, device).role.some(predicate);
+  return (element) => Node.from(element, device).role.every(predicate);
 }
 
killedBy: All tests
statusReason: packages/alfa-aria/test/dom/predicate/has-role.spec.js(17,7): hasRole() respects presentational children

Expected values to be strictly deep-equal:

true !== false
