[Killed] BooleanLiteral
src/dom/predicate/is-included-accessibility-tree.ts:19:20
 export function isIncludedInTheAccessibilityTree<T extends Node>(
   device: Device,
 ): Predicate<T> {
-  return (node) => !ariaNode.from(node, device).isIgnored();
+  return (node) => ariaNode.from(node, device).isIgnored();
 }
 
killedBy: All tests
statusReason: packages/alfa-rules/test/common/predicate/is-at-the-start.spec.js(33,7): isAtTheStart() returns false on perceivable predecessors of an element

Expected values to be strictly deep-equal:

true !== false
