[Killed] ConditionalExpression
src/dom/predicate/is-marked-decorative.ts:21:7
       .first(),
   );
 
-  if (role.some((role) => role.isPresentational())) {
+  if (false) {
     return true;
   }
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r13/rule.spec.js(61,7): evaluates() is inapplicable to an <iframe> that is marked as decorative

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     expectations: [

[Killed] MethodExpression
src/dom/predicate/is-marked-decorative.ts:21:7
       .first(),
   );
 
-  if (role.some((role) => role.isPresentational())) {
+  if (role.every(role => role.isPresentational())) {
     return true;
   }
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r13/rule.spec.js(14,7): evaluates() passes an <iframe> element with an accessible name given by the title attribute

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     mode: 'automatic',

[Killed] BooleanLiteral
src/dom/predicate/is-marked-decorative.ts:22:12
   );
 
   if (role.some((role) => role.isPresentational())) {
-    return true;
+    return false;
   }
 
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r13/rule.spec.js(61,7): evaluates() is inapplicable to an <iframe> that is marked as decorative

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     expectations: [

[Killed] ConditionalExpression
src/dom/predicate/is-marked-decorative.ts:26:5
   }
 
   switch (element.name) {
-    case "img":
-      return (
-        role.isNone() &&
-        element.attribute("alt").some((attribute) => attribute.value === "")
-      );
+    case "img":
 
     default:
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r67/rule.spec.js(15,7): evaluate() passes an <img> element that is marked as decorative and not included in the accessibility tree

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     mode: 'automatic',

[Killed] StringLiteral
src/dom/predicate/is-marked-decorative.ts:26:10
   }
 
   switch (element.name) {
-    case "img":
+    case "":
       return (
         role.isNone() &&
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r67/rule.spec.js(15,7): evaluate() passes an <img> element that is marked as decorative and not included in the accessibility tree

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     mode: 'automatic',

[Killed] ConditionalExpression
src/dom/predicate/is-marked-decorative.ts:28:9
   switch (element.name) {
     case "img":
       return (
-        role.isNone() &&
-        element.attribute("alt").some((attribute) => attribute.value === "")
+        false
       );
 
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r67/rule.spec.js(15,7): evaluate() passes an <img> element that is marked as decorative and not included in the accessibility tree

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     mode: 'automatic',

[Killed] LogicalOperator
src/dom/predicate/is-marked-decorative.ts:28:9
   switch (element.name) {
     case "img":
       return (
-        role.isNone() &&
-        element.attribute("alt").some((attribute) => attribute.value === "")
+        role.isNone() || element.attribute("alt").some(attribute => attribute.value === "")
       );
 
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r67/rule.spec.js(53,7): evaluate() is inapplicabale to an <img> that is not marked as decorative

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     expectations: [

[Killed] ConditionalExpression
src/dom/predicate/is-marked-decorative.ts:29:54
     case "img":
       return (
         role.isNone() &&
-        element.attribute("alt").some((attribute) => attribute.value === "")
+        element.attribute("alt").some((attribute) => false)
       );
 
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r67/rule.spec.js(15,7): evaluate() passes an <img> element that is marked as decorative and not included in the accessibility tree

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     mode: 'automatic',

[Killed] MethodExpression
src/dom/predicate/is-marked-decorative.ts:29:9
     case "img":
       return (
         role.isNone() &&
-        element.attribute("alt").some((attribute) => attribute.value === "")
+        element.attribute("alt").every(attribute => attribute.value === "")
       );
 
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r67/rule.spec.js(53,7): evaluate() is inapplicabale to an <img> that is not marked as decorative

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     expectations: [
