[Killed] MethodExpression
src/dom/predicate/is-perceivable.ts:24:5
   device: Device,
 ): Predicate<T> {
   return and(isVisible(device), (node) =>
-    node.inclusiveDescendants().some(isIncludedInTheAccessibilityTree(device)),
+    node.inclusiveDescendants().every(isIncludedInTheAccessibilityTree(device)),
   );
 }
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r24/rule.spec.js(19,7): evaluate() passes when non-streaming video elements have all audio and visual information available in a transcript

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...
