[Killed] ConditionalExpression
src/dom/predicate/is-programmatically-hidden.ts:29:23
   return or(
     hasComputedStyle(
       "visibility",
-      (visibility) => visibility.value !== "visible",
+      (visibility) => true,
       device,
       context,
killedBy: All tests
statusReason: packages/alfa-aria/test/dom/predicate/has-accessible-name.spec.js(14,7): hasAccessibleName() checks presence of an accessible name

Expected values to be strictly deep-equal:

false !== true

[Killed] EqualityOperator
src/dom/predicate/is-programmatically-hidden.ts:29:23
   return or(
     hasComputedStyle(
       "visibility",
-      (visibility) => visibility.value !== "visible",
+      (visibility) => visibility.value === "visible",
       device,
       context,
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of a <button> element with child text content
Error: Attempted to .getUnsafe() from None

[Killed] EqualityOperator
src/dom/predicate/is-programmatically-hidden.ts:56:46
               or(
                 hasComputedStyle(
                   "display",
-                  ({ values: [outside] }) => outside.value === "none",
+                  ({ values: [outside] }) => outside.value !== "none",
                   device,
                   context,
killedBy: All tests
statusReason: packages/alfa-aria/test/dom/predicate/has-accessible-name.spec.js(14,7): hasAccessibleName() checks presence of an accessible name

Expected values to be strictly deep-equal:

false !== true

[Killed] ConditionalExpression
src/dom/predicate/is-programmatically-hidden.ts:56:46
               or(
                 hasComputedStyle(
                   "display",
-                  ({ values: [outside] }) => outside.value === "none",
+                  ({ values: [outside] }) => true,
                   device,
                   context,
killedBy: All tests
statusReason: packages/alfa-aria/test/name-testable-statements.spec.js(34,7): Name test case 539

Expected values to be strictly equal:

'' !== 'Rich'

[Killed] MethodExpression
src/dom/predicate/is-programmatically-hidden.ts:65:15
             ),
             // Or its parent is programmatically hidden
             (node: Node) =>
-              node
-                .parent(Node.fullTree)
-                .some(hasHiddenAncestors(device, context)),
+              node.parent(Node.fullTree).every(hasHiddenAncestors(device, context)),
           ),
           node,
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(11,7): .from() constructs an accessible node from an element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    attributes: [],
...
