[Survived] ConditionalExpression
packages/alfa-aria/src/feature.ts:90:9
   export function from(namespace: Namespace, name: string): Option<Feature> {
     return Option.from(Features[namespace]?.[name]).orElse(() => {
       switch (namespace) {
-        case Namespace.HTML:
-          return Option.of(html());
+        case Namespace.HTML:
 
         case Namespace.SVG:

[Survived] ConditionalExpression
packages/alfa-aria/src/feature.ts:93:9
         case Namespace.HTML:
           return Option.of(html());
 
-        case Namespace.SVG:
-          return Option.of(svg());
+        case Namespace.SVG:
       }
 

[Killed] BlockStatement
packages/alfa-aria/src/feature.ts:132:34
 }
 
 const nameFromAttribute = (element: Element, ...attributes: Array<string>) => {
-  for (const name of attributes) {
-    for (const attribute of element.attribute(name)) {
-      // The attribute value is used as long as it's not completely empty.
-      if (attribute.value.length > 0) {
-        return Name.fromLabel(attribute);
-      }
-    }
-  }
+  for (const name of attributes) {}
 
   return None;
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of a <button> element with a title attribute and no other non-whitespace child text content
Error: Attempted to .getUnsafe() from None

[Killed] BlockStatement
packages/alfa-aria/src/feature.ts:133:54
 
 const nameFromAttribute = (element: Element, ...attributes: Array<string>) => {
   for (const name of attributes) {
-    for (const attribute of element.attribute(name)) {
-      // The attribute value is used as long as it's not completely empty.
-      if (attribute.value.length > 0) {
-        return Name.fromLabel(attribute);
-      }
-    }
+    for (const attribute of element.attribute(name)) {}
   }
 
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of a <button> element with a title attribute and no other non-whitespace child text content
Error: Attempted to .getUnsafe() from None

[Killed] ConditionalExpression
packages/alfa-aria/src/feature.ts:135:11
   for (const name of attributes) {
     for (const attribute of element.attribute(name)) {
       // The attribute value is used as long as it's not completely empty.
-      if (attribute.value.length > 0) {
+      if (false) {
         return Name.fromLabel(attribute);
       }
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of a <button> element with a title attribute and no other non-whitespace child text content
Error: Attempted to .getUnsafe() from None

[Killed] EqualityOperator
packages/alfa-aria/src/feature.ts:135:11
   for (const name of attributes) {
     for (const attribute of element.attribute(name)) {
       // The attribute value is used as long as it's not completely empty.
-      if (attribute.value.length > 0) {
+      if (attribute.value.length <= 0) {
         return Name.fromLabel(attribute);
       }
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of a <button> element with a title attribute and no other non-whitespace child text content
Error: Attempted to .getUnsafe() from None

[Killed] ArrayDeclaration
packages/alfa-aria/src/feature.ts:153:31
       .find(predicate)
       .flatMap((child) =>
         Name.fromDescendants(child, device, state.visit(child)).map((name) =>
-          Name.of(name.value, [Name.Source.descendant(element, name)]),
+          Name.of(name.value, []),
         ),
       );
killedBy: All tests
statusReason: packages/alfa-aria/test/name.spec.js(525,7): .from() determines the name of a <fieldset> element with a <legend> child element with child text content

Expected values to be strictly deep-equal:
+ actual - expected

  {
+   sources: [],
-   sources: [

[Survived] MethodExpression
packages/alfa-aria/src/feature.ts:166:28
 
   const elements = getElementDescendants(root);
 
-  const isFirstReference = element.id.some((id) =>
-    ids
-      .get(root, () =>
-        Map.from(
-          elements
-            .collect((element) =>
-              element.id.map((id) => [id, element] as const),
-            )
-            .reverse(),
-        ),
-      )
-      .get(id)
-      .includes(element),
-  );
+  const isFirstReference = element.id.every(id => ids.get(root, () => Map.from(elements.collect(element => element.id.map(id => ([id, element] as const))).reverse())).get(id).includes(element));
 
   const references = labels

[Killed] MethodExpression
packages/alfa-aria/src/feature.ts:170:11
     ids
       .get(root, () =>
         Map.from(
-          elements
-            .collect((element) =>
-              element.id.map((id) => [id, element] as const),
-            )
-            .reverse(),
+          elements.collect(element => element.id.map(id => ([id, element] as const))),
         ),
       )
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() only associates <label> elements with for attributes with the first matching element
Error: Attempted to .getUnsafe() from None

[Killed] MethodExpression
packages/alfa-aria/src/feature.ts:181:22
       .includes(element),
   );
 
-  const references = labels
-    .get(root, () => elements.filter(hasName("label")))
-    .filter(
-      or(
-        (label) =>
-          label.attribute("for").isNone() &&
-          label.descendants().includes(element),
-        (label) =>
-          isFirstReference &&
-          label
-            .attribute("for")
-            .some((attribute) => element.id.includes(attribute.value)),
-      ),
-    );
+  const references = labels.get(root, () => elements.filter(hasName("label")));
 
   const names = references.collect((element) =>
killedBy: All tests
statusReason: packages/alfa-aria/test/name.spec.js(1244,7): .from() does not use implicit <label> elements for naming <input> elements if the <label> element has a non-matching for attribute

Expected values to be strictly deep-equal:
+ actual - expected

  {
+   type: 'some',
+   value: {

[Killed] MethodExpression
packages/alfa-aria/src/feature.ts:182:22
   );
 
   const references = labels
-    .get(root, () => elements.filter(hasName("label")))
+    .get(root, () => elements)
     .filter(
       or(
killedBy: All tests
statusReason: packages/alfa-aria/test/name-testable-statements.spec.js(88,7): Name test case 546

Expected values to be strictly equal:
+ actual - expected

+ 'States: States:'
- 'States:'
          ^

[Killed] StringLiteral
packages/alfa-aria/src/feature.ts:182:46
   );
 
   const references = labels
-    .get(root, () => elements.filter(hasName("label")))
+    .get(root, () => elements.filter(hasName("")))
     .filter(
       or(
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of an <input> element with a <label> parent element with child text content
Error: Attempted to .getUnsafe() from None

[Killed] ConditionalExpression
packages/alfa-aria/src/feature.ts:186:11
     .filter(
       or(
         (label) =>
-          label.attribute("for").isNone() &&
-          label.descendants().includes(element),
+          true,
         (label) =>
           isFirstReference &&
killedBy: All tests
statusReason: packages/alfa-aria/test/name.spec.js(1244,7): .from() does not use implicit <label> elements for naming <input> elements if the <label> element has a non-matching for attribute

Expected values to be strictly deep-equal:
+ actual - expected

  {
+   type: 'some',
+   value: {

[Killed] ConditionalExpression
packages/alfa-aria/src/feature.ts:186:11
     .filter(
       or(
         (label) =>
-          label.attribute("for").isNone() &&
-          label.descendants().includes(element),
+          false,
         (label) =>
           isFirstReference &&
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(432,7): .from() behaves when encountering an element with global properties where the element should not be named by its subtree

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    attributes: [
...

[Killed] ConditionalExpression
packages/alfa-aria/src/feature.ts:189:11
           label.attribute("for").isNone() &&
           label.descendants().includes(element),
         (label) =>
-          isFirstReference &&
-          label
-            .attribute("for")
-            .some((attribute) => element.id.includes(attribute.value)),
+          true,
       ),
     );
killedBy: All tests
statusReason: packages/alfa-aria/test/name.spec.js(1244,7): .from() does not use implicit <label> elements for naming <input> elements if the <label> element has a non-matching for attribute

Expected values to be strictly deep-equal:
+ actual - expected

  {
+   type: 'some',
+   value: {

[Killed] LogicalOperator
packages/alfa-aria/src/feature.ts:189:11
           label.attribute("for").isNone() &&
           label.descendants().includes(element),
         (label) =>
-          isFirstReference &&
-          label
-            .attribute("for")
-            .some((attribute) => element.id.includes(attribute.value)),
+          isFirstReference || label.attribute("for").some(attribute => element.id.includes(attribute.value)),
       ),
     );
killedBy: All tests
statusReason: packages/alfa-aria/test/name.spec.js(1251,7): .from() correctly assigns names to <input> elements with implicit <label> elements even if IDs are duplicated

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    sources: [
...

[Killed] MethodExpression
packages/alfa-aria/src/feature.ts:190:11
           label.descendants().includes(element),
         (label) =>
           isFirstReference &&
-          label
-            .attribute("for")
-            .some((attribute) => element.id.includes(attribute.value)),
+          label.attribute("for").every(attribute => element.id.includes(attribute.value)),
       ),
     );
killedBy: All tests
statusReason: packages/alfa-aria/test/name.spec.js(1251,7): .from() correctly assigns names to <input> elements with implicit <label> elements even if IDs are duplicated

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    sources: [
...

[Killed] StringLiteral
packages/alfa-aria/src/feature.ts:191:24
         (label) =>
           isFirstReference &&
           label
-            .attribute("for")
+            .attribute("")
             .some((attribute) => element.id.includes(attribute.value)),
       ),
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of an <input> element with a <label> element whose for attribute points to the <input> element
Error: Attempted to .getUnsafe() from None

[Survived] BooleanLiteral
packages/alfa-aria/src/feature.ts:200:49
     Name.fromNode(
       element,
       device,
-      state.reference(element, element).recurse(true).descend(false),
+      state.reference(element, element).recurse(false).descend(false),
     ).map((name) => [name, element] as const),
   );

[Survived] BooleanLiteral
packages/alfa-aria/src/feature.ts:200:63
     Name.fromNode(
       element,
       device,
-      state.reference(element, element).recurse(true).descend(false),
+      state.reference(element, element).recurse(true).descend(true),
     ).map((name) => [name, element] as const),
   );

[Survived] MethodExpression
packages/alfa-aria/src/feature.ts:204:16
     ).map((name) => [name, element] as const),
   );
 
-  const name = names
-    .map(([name]) => name.value)
-    .join(" ")
-    .trim();
+  const name = names.map(([name]) => name.value).join(" ");
 
   if (name === "") {

[Killed] ArrowFunction
packages/alfa-aria/src/feature.ts:205:10
   );
 
   const name = names
-    .map(([name]) => name.value)
+    .map(() => undefined)
     .join(" ")
     .trim();
killedBy: All tests
statusReason: packages/alfa-aria/test/name-testable-statements.spec.js(88,7): Name test case 546

Expected values to be strictly equal:
+ actual - expected

+ 'undefined'
- 'States:'

[Killed] EqualityOperator
packages/alfa-aria/src/feature.ts:209:7
     .join(" ")
     .trim();
 
-  if (name === "") {
+  if (name !== "") {
     return None;
   }
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(30,7): .from() gives precedence to aria-owns references

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    attributes: [
...

[Killed] ConditionalExpression
packages/alfa-aria/src/feature.ts:209:7
     .join(" ")
     .trim();
 
-  if (name === "") {
+  if (true) {
     return None;
   }
killedBy: All tests
statusReason: packages/alfa-aria/test/name-testable-statements.spec.js(88,7): Name test case 546

Expected values to be strictly equal:

'' !== 'States:'

[Killed] BlockStatement
packages/alfa-aria/src/feature.ts:217:59
     Name.of(
       name,
       names.map(([name, element]) => {
-        for (const attribute of element.attribute("for")) {
-          return Name.Source.reference(attribute, name);
-        }
+        for (const attribute of element.attribute("for")) {}
 
         return Name.Source.ancestor(element, name);
killedBy: All tests
statusReason: packages/alfa-aria/test/name.spec.js(639,7): .from() determines the name of an <input> element with a <label> element whose for attribute points to the <input> element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    sources: [
      {

[Killed] StringLiteral
packages/alfa-aria/src/feature.ts:254:22
 const Features: Features = {
   [Namespace.HTML]: {
     a: html(
-      ifHasAttribute("href", "link", "generic"),
+      ifHasAttribute("", "link", "generic"),
       () => [],
       (element, device, state) =>
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of an <a> element with a <img> child element with an alt attribute
Error: Attempted to .getUnsafe() from None

[Killed] StringLiteral
packages/alfa-aria/src/feature.ts:261:22
     ),
 
     area: html(
-      ifHasAttribute("href", "link", "generic"),
+      ifHasAttribute("", "link", "generic"),
       () => [],
       (element) => nameFromAttribute(element, "alt"),
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of an <area> element with an alt attribute
Error: Attempted to .getUnsafe() from None

[Survived] BlockStatement
packages/alfa-aria/src/feature.ts:273:48
     // see https://github.com/Siteimprove/alfa/issues/298
     aside: html("complementary"),
 
-    button: html("button", function* (element) {
-      // https://w3c.github.io/html-aam/#att-disabled
-      for (const _ of element.attribute("disabled")) {
-        yield Attribute.of("aria-disabled", "true");
-      }
-    }),
+    button: html("button", function* (element) {}),
 
     // https://w3c.github.io/html-aam/#el-datalist

[Survived] BlockStatement
packages/alfa-aria/src/feature.ts:275:54
 
     button: html("button", function* (element) {
       // https://w3c.github.io/html-aam/#att-disabled
-      for (const _ of element.attribute("disabled")) {
-        yield Attribute.of("aria-disabled", "true");
-      }
+      for (const _ of element.attribute("disabled")) {}
     }),
 

[Survived] StringLiteral
packages/alfa-aria/src/feature.ts:275:41
 
     button: html("button", function* (element) {
       // https://w3c.github.io/html-aam/#att-disabled
-      for (const _ of element.attribute("disabled")) {
+      for (const _ of element.attribute("")) {
         yield Attribute.of("aria-disabled", "true");
       }

[Survived] StringLiteral
packages/alfa-aria/src/feature.ts:276:45
     button: html("button", function* (element) {
       // https://w3c.github.io/html-aam/#att-disabled
       for (const _ of element.attribute("disabled")) {
-        yield Attribute.of("aria-disabled", "true");
+        yield Attribute.of("aria-disabled", "");
       }
     }),

[Survived] BlockStatement
packages/alfa-aria/src/feature.ts:290:48
 
     dfn: html("term"),
 
-    dialog: html("dialog", function* (element) {
-      // https://w3c.github.io/html-aam/#att-open-dialog
-      yield Attribute.of(
-        "aria-expanded",
-        element.attribute("open").isSome() ? "true" : "false",
-      );
-    }),
+    dialog: html("dialog", function* (element) {}),
 
     details: html(

[Survived] StringLiteral
packages/alfa-aria/src/feature.ts:294:27
       // https://w3c.github.io/html-aam/#att-open-dialog
       yield Attribute.of(
         "aria-expanded",
-        element.attribute("open").isSome() ? "true" : "false",
+        element.attribute("").isSome() ? "true" : "false",
       );
     }),

[Survived] BlockStatement
packages/alfa-aria/src/feature.ts:300:27
 
     details: html(
       () => None,
-      function* (element) {
-        // https://w3c.github.io/html-aam/#att-open-details
-        yield Attribute.of(
-          "aria-expanded",
-          element.attribute("open").isSome() ? "true" : "false",
-        );
-      },
+      function* (element) {},
     ),
 

[Survived] StringLiteral
packages/alfa-aria/src/feature.ts:304:57
         // https://w3c.github.io/html-aam/#att-open-details
         yield Attribute.of(
           "aria-expanded",
-          element.attribute("open").isSome() ? "true" : "false",
+          element.attribute("open").isSome() ? "true" : "",
         );
       },

[Survived] BlockStatement
packages/alfa-aria/src/feature.ts:313:27
 
     fieldset: html(
       "group",
-      function* (element) {
-        // https://w3c.github.io/html-aam/#att-disabled
-        for (const _ of element.attribute("disabled")) {
-          yield Attribute.of("aria-disabled", "true");
-        }
-      },
+      function* (element) {},
       nameFromChild(hasName("legend")),
     ),

[Survived] StringLiteral
packages/alfa-aria/src/feature.ts:326:45
 
     footer: html(
       ifScopedTo(
-        ["article", "aside", "main", "nav", "section"],
+        ["article", "aside", "main", "nav", ""],
         "generic",
         "contentinfo",

[Killed] StringLiteral
packages/alfa-aria/src/feature.ts:337:59
     // see https://github.com/Siteimprove/alfa/issues/298
     form: html("form"),
 
-    h1: html("heading", () => [Attribute.of("aria-level", "1")]),
+    h1: html("heading", () => [Attribute.of("aria-level", "")]),
 
     h2: html("heading", () => [Attribute.of("aria-level", "2")]),
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r53/rule.spec.js(17,7): evaluate() passes when the document headings are structured

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] StringLiteral
packages/alfa-aria/src/feature.ts:341:59
 
     h2: html("heading", () => [Attribute.of("aria-level", "2")]),
 
-    h3: html("heading", () => [Attribute.of("aria-level", "3")]),
+    h3: html("heading", () => [Attribute.of("aria-level", "")]),
 
     h4: html("heading", () => [Attribute.of("aria-level", "4")]),
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r53/rule.spec.js(17,7): evaluate() passes when the document headings are structured

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] ArrayDeclaration
packages/alfa-aria/src/feature.ts:341:31
 
     h2: html("heading", () => [Attribute.of("aria-level", "2")]),
 
-    h3: html("heading", () => [Attribute.of("aria-level", "3")]),
+    h3: html("heading", () => []),
 
     h4: html("heading", () => [Attribute.of("aria-level", "4")]),
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r53/rule.spec.js(17,7): evaluate() passes when the document headings are structured

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] ArrayDeclaration
packages/alfa-aria/src/feature.ts:343:31
 
     h3: html("heading", () => [Attribute.of("aria-level", "3")]),
 
-    h4: html("heading", () => [Attribute.of("aria-level", "4")]),
+    h4: html("heading", () => []),
 
     h5: html("heading", () => [Attribute.of("aria-level", "5")]),
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r61/rule.spec.js(31,7): evaluate() fails when the document starts with a level 4 heading

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] StringLiteral
packages/alfa-aria/src/feature.ts:343:59
 
     h3: html("heading", () => [Attribute.of("aria-level", "3")]),
 
-    h4: html("heading", () => [Attribute.of("aria-level", "4")]),
+    h4: html("heading", () => [Attribute.of("aria-level", "")]),
 
     h5: html("heading", () => [Attribute.of("aria-level", "5")]),
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r61/rule.spec.js(31,7): evaluate() fails when the document starts with a level 4 heading

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Survived] StringLiteral
packages/alfa-aria/src/feature.ts:351:38
 
     header: html(
       ifScopedTo(
-        ["article", "aside", "main", "nav", "section"],
+        ["article", "aside", "main", "", "section"],
         "generic",
         "banner",

[Killed] BlockStatement
packages/alfa-aria/src/feature.ts:365:27
       // We need to yield all roles, not just return one, in order for the
       // presentational role conflict resolution to discard `presentation`
       // and correctly default to `img`.
-      function* (element) {
-        // If there is an alt attribute and it is totally empty
-        if (element.attribute("alt").some((alt) => alt.value === "")) {
-          yield Role.of("presentation");
-        }
-
-        // if there is no src attribute, or it is empty
-        if (element.attribute("src").every((src) => src.value.trim() === "")) {
-          yield Role.of("presentation");
-        }
-
-        yield Role.of("img");
-      },
+      function* (element) {},
       () => [],
       (element) => nameFromAttribute(element, "alt"),
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r2/rule.spec.js(13,7): evaluate() passes an <img> element with an accessible name

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     mode: 'automatic',

[Killed] ConditionalExpression
packages/alfa-aria/src/feature.ts:367:52
       // and correctly default to `img`.
       function* (element) {
         // If there is an alt attribute and it is totally empty
-        if (element.attribute("alt").some((alt) => alt.value === "")) {
+        if (element.attribute("alt").some((alt) => false)) {
           yield Role.of("presentation");
         }
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r67/rule.spec.js(15,7): evaluate() passes an <img> element that is marked as decorative and not included in the accessibility tree

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] ConditionalExpression
packages/alfa-aria/src/feature.ts:367:52
       // and correctly default to `img`.
       function* (element) {
         // If there is an alt attribute and it is totally empty
-        if (element.attribute("alt").some((alt) => alt.value === "")) {
+        if (element.attribute("alt").some((alt) => true)) {
           yield Role.of("presentation");
         }
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of an <img> element with an alt attribute
Error: Attempted to .getUnsafe() from None

[Killed] BlockStatement
packages/alfa-aria/src/feature.ts:372:79
         }
 
         // if there is no src attribute, or it is empty
-        if (element.attribute("src").every((src) => src.value.trim() === "")) {
-          yield Role.of("presentation");
-        }
+        if (element.attribute("src").every((src) => src.value.trim() === "")) {}
 
         yield Role.of("img");
killedBy: All tests
statusReason: packages/alfa-aria/test/role.spec.js(131,11): .from() maps `<img>` with no source to presentational role

Expected values to be strictly deep-equal:
+ actual - expected

  {
+   attributes: [],
+   children: [],

[Killed] ConditionalExpression
packages/alfa-aria/src/feature.ts:372:13
         }
 
         // if there is no src attribute, or it is empty
-        if (element.attribute("src").every((src) => src.value.trim() === "")) {
+        if (false) {
           yield Role.of("presentation");
         }
killedBy: All tests
statusReason: packages/alfa-aria/test/role.spec.js(131,11): .from() maps `<img>` with no source to presentational role

Expected values to be strictly deep-equal:
+ actual - expected

  {
+   attributes: [],
+   children: [],

[Killed] ConditionalExpression
packages/alfa-aria/src/feature.ts:388:11
           case "button":
           case "image":
           case "reset":
-          case "submit":
-            return "button";
+          case "submit":
           case "checkbox":
             return "checkbox";
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r12/rule.spec.js(23,7): evaluates() passes a submit button element with an accessible name given by the value attribute

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     mode: 'automatic',

[Killed] ConditionalExpression
packages/alfa-aria/src/feature.ts:390:11
           case "reset":
           case "submit":
             return "button";
-          case "checkbox":
-            return "checkbox";
+          case "checkbox":
           case "number":
             return "spinbutton";
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r16/rule.spec.js(92,7): evaluate() is inapplicable to elements with same explicit and implicit role

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     expectations: [

[Survived] ConditionalExpression
packages/alfa-aria/src/feature.ts:392:11
             return "button";
           case "checkbox":
             return "checkbox";
-          case "number":
-            return "spinbutton";
+          case "number":
           case "radio":
             return "radio";

[Survived] ConditionalExpression
packages/alfa-aria/src/feature.ts:394:11
             return "checkbox";
           case "number":
             return "spinbutton";
-          case "radio":
-            return "radio";
+          case "radio":
           case "range":
             return "slider";

[Survived] ConditionalExpression
packages/alfa-aria/src/feature.ts:396:11
             return "spinbutton";
           case "radio":
             return "radio";
-          case "range":
-            return "slider";
+          case "range":
           case "search":
             return element.attribute("list").isSome()

[Survived] ConditionalExpression
packages/alfa-aria/src/feature.ts:398:11
             return "radio";
           case "range":
             return "slider";
-          case "search":
-            return element.attribute("list").isSome()
-              ? "combobox"
-              : "searchbox";
+          case "search":
+// Note: The specification for email has changed, it now has role textbox. We should look into this if it becomes an issue.
           // Note: The specification for email has changed, it now has role textbox. We should look into this if it becomes an issue.
           case "email":

[Survived] StringLiteral
packages/alfa-aria/src/feature.ts:399:38
           case "range":
             return "slider";
           case "search":
-            return element.attribute("list").isSome()
+            return element.attribute("").isSome()
               ? "combobox"
               : "searchbox";

[Killed] ConditionalExpression
packages/alfa-aria/src/feature.ts:406:11
           case "email":
           case "tel":
           case "text":
-          case "url":
-            return element.attribute("list").isSome() ? "combobox" : "textbox";
+          case "url":
         }
 
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(30,7): .from() gives precedence to aria-owns references

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    attributes: [
...

[Survived] StringLiteral
packages/alfa-aria/src/feature.ts:421:51
         // https://w3c.github.io/html-aam/#att-checked
         yield Attribute.of(
           "aria-checked",
-          element.attribute("checked").isSome() ? "true" : "false",
+          element.attribute("checked").isSome() ? "" : "false",
         );
 

[Survived] BlockStatement
packages/alfa-aria/src/feature.ts:425:60
         );
 
         // https://w3c.github.io/html-aam/#att-list
-        for (const { value } of element.attribute("list")) {
-          yield Attribute.of("aria-controls", value);
-        }
+        for (const { value } of element.attribute("list")) {}
 
         // https://w3c.github.io/html-aam/#att-disabled

[Survived] StringLiteral
packages/alfa-aria/src/feature.ts:425:51
         );
 
         // https://w3c.github.io/html-aam/#att-list
-        for (const { value } of element.attribute("list")) {
+        for (const { value } of element.attribute("")) {
           yield Attribute.of("aria-controls", value);
         }

[Survived] BlockStatement
packages/alfa-aria/src/feature.ts:435:67
         }
 
         // https://w3c.github.io/html-aam/#att-placeholder
-        for (const { value } of element.attribute("placeholder")) {
-          yield Attribute.of("aria-placeholder", value);
-        }
+        for (const { value } of element.attribute("placeholder")) {}
 
         // https://w3c.github.io/html-aam/#att-readonly
