[Survived] StringLiteral
packages/alfa-aria/src/feature.ts:435:51
         }
 
         // https://w3c.github.io/html-aam/#att-placeholder
-        for (const { value } of element.attribute("placeholder")) {
+        for (const { value } of element.attribute("")) {
           yield Attribute.of("aria-placeholder", value);
         }

[Survived] BlockStatement
packages/alfa-aria/src/feature.ts:440:56
         }
 
         // https://w3c.github.io/html-aam/#att-readonly
-        for (const _ of element.attribute("readonly")) {
-          yield Attribute.of("aria-readonly", "true");
-        }
+        for (const _ of element.attribute("readonly")) {}
 
         // https://w3c.github.io/html-aam/#att-required

[Survived] StringLiteral
packages/alfa-aria/src/feature.ts:440:43
         }
 
         // https://w3c.github.io/html-aam/#att-readonly
-        for (const _ of element.attribute("readonly")) {
+        for (const _ of element.attribute("")) {
           yield Attribute.of("aria-readonly", "true");
         }

[Survived] StringLiteral
packages/alfa-aria/src/feature.ts:441:47
 
         // https://w3c.github.io/html-aam/#att-readonly
         for (const _ of element.attribute("readonly")) {
-          yield Attribute.of("aria-readonly", "true");
+          yield Attribute.of("aria-readonly", "");
         }
 

[Survived] BlockStatement
packages/alfa-aria/src/feature.ts:445:56
         }
 
         // https://w3c.github.io/html-aam/#att-required
-        for (const _ of element.attribute("required")) {
-          yield Attribute.of("aria-required", "true");
-        }
+        for (const _ of element.attribute("required")) {}
 
         // https://w3c.github.io/html-aam/#att-max-input

[Survived] BlockStatement
packages/alfa-aria/src/feature.ts:450:59
         }
 
         // https://w3c.github.io/html-aam/#att-max-input
-        for (const { value } of element.attribute("max")) {
-          yield Attribute.of("aria-valuemax", value);
-        }
+        for (const { value } of element.attribute("max")) {}
 
         // https://w3c.github.io/html-aam/#att-min-input

[Survived] StringLiteral
packages/alfa-aria/src/feature.ts:450:51
         }
 
         // https://w3c.github.io/html-aam/#att-max-input
-        for (const { value } of element.attribute("max")) {
+        for (const { value } of element.attribute("")) {
           yield Attribute.of("aria-valuemax", value);
         }

[Survived] BlockStatement
packages/alfa-aria/src/feature.ts:455:59
         }
 
         // https://w3c.github.io/html-aam/#att-min-input
-        for (const { value } of element.attribute("min")) {
-          yield Attribute.of("aria-valuemin", value);
-        }
+        for (const { value } of element.attribute("min")) {}
 
         // https://w3c.github.io/html-aam/#att-value-input

[Survived] StringLiteral
packages/alfa-aria/src/feature.ts:455:51
         }
 
         // https://w3c.github.io/html-aam/#att-min-input
-        for (const { value } of element.attribute("min")) {
+        for (const { value } of element.attribute("")) {
           yield Attribute.of("aria-valuemin", value);
         }

[Survived] BlockStatement
packages/alfa-aria/src/feature.ts:461:61
 
         // https://w3c.github.io/html-aam/#att-value-input
         // but https://github.com/w3c/html-aam/issues/314
-        for (const { value } of element.attribute("value")) {
-          yield Attribute.of("aria-valuenow", value);
-        }
+        for (const { value } of element.attribute("value")) {}
       },
       (element, device, state) => {

[Killed] ConditionalExpression
packages/alfa-aria/src/feature.ts:467:11
       },
       (element, device, state) => {
         if (
-          test(
-            hasInputType("text", "password", "search", "tel", "email", "url"),
-            element,
-          )
+          false
         ) {
           /**
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of an <input> element with a placeholder attribute
Error: Attempted to .getUnsafe() from None

[Killed] ConditionalExpression
packages/alfa-aria/src/feature.ts:467:11
       },
       (element, device, state) => {
         if (
-          test(
-            hasInputType("text", "password", "search", "tel", "email", "url"),
-            element,
-          )
+          true
         ) {
           /**
killedBy: All tests
statusReason: packages/alfa-aria/test/name-testable-statements.spec.js(61,7): Name test case 543

Expected values to be strictly equal:

'' !== 'Reset'

[Killed] BlockStatement
packages/alfa-aria/src/feature.ts:471:11
             hasInputType("text", "password", "search", "tel", "email", "url"),
             element,
           )
-        ) {
-          /**
-           * {@link https://www.w3.org/TR/html-aam-1.0/#input-type-text-input-type-password-input-type-search-input-type-tel-input-type-url-and-textarea-element}
-           */
-          return Name.fromSteps(
-            () => nameFromLabel(element, device, state),
-            // The title attribute has poor and varying support, but
-            // the specs give it precedence over placeholder.
-            // This could be a browser-branched value.
-            () => nameFromAttribute(element, "title", "placeholder"),
-          );
-        }
+        ) {}
 
         if (test(hasInputType("button"), element)) {
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of an <input> element with a placeholder attribute
Error: Attempted to .getUnsafe() from None

[Killed] StringLiteral
packages/alfa-aria/src/feature.ts:480:55
             // The title attribute has poor and varying support, but
             // the specs give it precedence over placeholder.
             // This could be a browser-branched value.
-            () => nameFromAttribute(element, "title", "placeholder"),
+            () => nameFromAttribute(element, "title", ""),
           );
         }
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of an <input> element with a placeholder attribute
Error: Attempted to .getUnsafe() from None

[Killed] ConditionalExpression
packages/alfa-aria/src/feature.ts:484:13
           );
         }
 
-        if (test(hasInputType("button"), element)) {
+        if (true) {
           /**
            * {@link https://www.w3.org/TR/html-aam-1.0/#input-type-button-input-type-submit-and-input-type-reset}
killedBy: All tests
statusReason: packages/alfa-aria/test/name-testable-statements.spec.js(61,7): Name test case 543

Expected values to be strictly equal:

'' !== 'Reset'

[Killed] BlockStatement
packages/alfa-aria/src/feature.ts:484:52
           );
         }
 
-        if (test(hasInputType("button"), element)) {
-          /**
-           * {@link https://www.w3.org/TR/html-aam-1.0/#input-type-button-input-type-submit-and-input-type-reset}
-           */
-          return Name.fromSteps(
-            // {@link https://github.com/w3c/html-aam/pull/423}
-            () => nameFromLabel(element, device, state),
-            () => nameFromAttribute(element, "value"),
-          );
-        }
+        if (test(hasInputType("button"), element)) {}
 
         if (test(hasInputType("submit"), element)) {
killedBy: All tests
statusReason: packages/alfa-aria/test/name-testable-statements.spec.js(70,7): Name test case 544

Expected values to be strictly equal:

'' !== 'foo'

[Killed] StringLiteral
packages/alfa-aria/src/feature.ts:491:46
           return Name.fromSteps(
             // {@link https://github.com/w3c/html-aam/pull/423}
             () => nameFromLabel(element, device, state),
-            () => nameFromAttribute(element, "value"),
+            () => nameFromAttribute(element, ""),
           );
         }
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of an <input type="button"> element with a value attribute
Error: Attempted to .getUnsafe() from None

[Killed] ConditionalExpression
packages/alfa-aria/src/feature.ts:495:13
           );
         }
 
-        if (test(hasInputType("submit"), element)) {
+        if (false) {
           /**
            * {@link https://www.w3.org/TR/html-aam-1.0/#input-type-button-input-type-submit-and-input-type-reset}
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of an <input type="submit"> element
Error: Attempted to .getUnsafe() from None

[Killed] ConditionalExpression
packages/alfa-aria/src/feature.ts:495:13
           );
         }
 
-        if (test(hasInputType("submit"), element)) {
+        if (true) {
           /**
            * {@link https://www.w3.org/TR/html-aam-1.0/#input-type-button-input-type-submit-and-input-type-reset}
killedBy: All tests
statusReason: packages/alfa-aria/test/name-testable-statements.spec.js(61,7): Name test case 543

Expected values to be strictly equal:
+ actual - expected

+ 'Submit'
- 'Reset'

[Killed] ConditionalExpression
packages/alfa-aria/src/feature.ts:507:13
           );
         }
 
-        if (test(hasInputType("reset"), element)) {
+        if (false) {
           /**
            * {@link https://www.w3.org/TR/html-aam-1.0/#input-type-button-input-type-submit-and-input-type-reset}
killedBy: All tests
statusReason: packages/alfa-aria/test/name-testable-statements.spec.js(61,7): Name test case 543

Expected values to be strictly equal:

'' !== 'Reset'

[Killed] ConditionalExpression
packages/alfa-aria/src/feature.ts:507:13
           );
         }
 
-        if (test(hasInputType("reset"), element)) {
+        if (true) {
           /**
            * {@link https://www.w3.org/TR/html-aam-1.0/#input-type-button-input-type-submit-and-input-type-reset}
killedBy: All tests
statusReason: packages/alfa-aria/test/name-testable-statements.spec.js(79,7): Name test case 545

Expected values to be strictly equal:

'Reset' !== 'foo'

[Killed] StringLiteral
packages/alfa-aria/src/feature.ts:515:37
             // {@link https://github.com/w3c/html-aam/pull/423}
             () => nameFromLabel(element, device, state),
             () => nameFromAttribute(element, "value"),
-            () => Option.of(Name.of("Reset")),
+            () => Option.of(Name.of("")),
           );
         }
killedBy: All tests
statusReason: packages/alfa-aria/test/name.spec.js(788,7): .from() determines the name of an <input type="reset"> element

Expected values to be strictly deep-equal:
+ actual - expected

  {
    sources: [],
+   value: ''

[Killed] ConditionalExpression
packages/alfa-aria/src/feature.ts:519:13
           );
         }
 
-        if (test(hasInputType("image"), element)) {
+        if (false) {
           /**
            * {@link https://www.w3.org/TR/html-aam-1.0/#input-type-image}
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of an <input type="image"> element
Error: Attempted to .getUnsafe() from None

[Killed] BlockStatement
packages/alfa-aria/src/feature.ts:519:51
           );
         }
 
-        if (test(hasInputType("image"), element)) {
-          /**
-           * {@link https://www.w3.org/TR/html-aam-1.0/#input-type-image}
-           */
-          return Name.fromSteps(
-            // {@link https://github.com/w3c/html-aam/pull/423}
-            () => nameFromLabel(element, device, state),
-            // The title attribute has poor and varying support, but the specs
-            // use it.
-            // This could be a browser-branched value.
-            () => nameFromAttribute(element, "alt", "title"),
-            () => Option.of(Name.of("Submit Query")),
-          );
-        }
+        if (test(hasInputType("image"), element)) {}
 
         return nameFromLabel(element, device, state);
killedBy: All tests
statusReason: packages/alfa-aria/test/name-testable-statements.spec.js(79,7): Name test case 545

Expected values to be strictly equal:

'' !== 'foo'

[Killed] StringLiteral
packages/alfa-aria/src/feature.ts:529:53
             // The title attribute has poor and varying support, but the specs
             // use it.
             // This could be a browser-branched value.
-            () => nameFromAttribute(element, "alt", "title"),
+            () => nameFromAttribute(element, "alt", ""),
             () => Option.of(Name.of("Submit Query")),
           );
killedBy: All tests
statusReason: packages/alfa-aria/test/name.spec.js(761,7): .from() determines the name of an `<input type="image">` with a title attribute.

Expected values to be strictly deep-equal:
+ actual - expected

  {
+   sources: [],
+   value: 'Submit Query'

[Killed] StringLiteral
packages/alfa-aria/src/feature.ts:529:46
             // The title attribute has poor and varying support, but the specs
             // use it.
             // This could be a browser-branched value.
-            () => nameFromAttribute(element, "alt", "title"),
+            () => nameFromAttribute(element, "", "title"),
             () => Option.of(Name.of("Submit Query")),
           );
killedBy: All tests
statusReason: packages/alfa-aria/test/name-testable-statements.spec.js(79,7): Name test case 545

Expected values to be strictly equal:
+ actual - expected

+ 'Submit Query'
- 'foo'

[Survived] MethodExpression
packages/alfa-aria/src/feature.ts:540:9
 
     li: html(
       (element) =>
-        element
-          .parent()
-          .some(and(Element.isElement, hasName("ol", "ul", "menu")))
+        element.parent().every(and(Element.isElement, hasName("ol", "ul", "menu")))
           ? "listitem"
           : "generic",

[Killed] StringLiteral
packages/alfa-aria/src/feature.ts:542:54
       (element) =>
         element
           .parent()
-          .some(and(Element.isElement, hasName("ol", "ul", "menu")))
+          .some(and(Element.isElement, hasName("ol", "", "menu")))
           ? "listitem"
           : "generic",
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r42/rule.spec.js(13,7): evaluates() passes an implicit listitem inside a list

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     mode: 'automatic',

[Survived] MethodExpression
packages/alfa-aria/src/feature.ts:547:26
           : "generic",
       (element) => {
         // https://w3c.github.io/html-aam/#el-li
-        const siblings = element
-          .inclusiveSiblings()
-          .filter(and(Element.isElement, Element.hasName("li")));
+        const siblings = element.inclusiveSiblings();
 
         return [

[Killed] ArithmeticOperator
packages/alfa-aria/src/feature.ts:556:15
           Attribute.of(
             "aria-posinset",
             `${
-              siblings.takeUntil((sibling) => sibling.equals(element)).size + 1
+              siblings.takeUntil(sibling => sibling.equals(element)).size - 1
             }`,
           ),
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(426,11): .from() correctly sets `aria-setsize` and `aria-posinset`

Expected values to be strictly equal:

'-1' !== '1'

[Survived] BlockStatement
packages/alfa-aria/src/feature.ts:571:27
 
     meter: html(
       () => None,
-      function* (element) {
-        // https://w3c.github.io/html-aam/#att-max
-        for (const { value } of element.attribute("max")) {
-          yield Attribute.of("aria-valuemax", value);
-        }
-
-        // https://w3c.github.io/html-aam/#att-min
-        for (const { value } of element.attribute("min")) {
-          yield Attribute.of("aria-valuemin", value);
-        }
-
-        // https://w3c.github.io/html-aam/#att-value-meter
-        for (const { value } of element.attribute("value")) {
-          yield Attribute.of("aria-valuenow", value);
-        }
-      },
+      function* (element) {},
     ),
 

[Survived] BlockStatement
packages/alfa-aria/src/feature.ts:573:59
       () => None,
       function* (element) {
         // https://w3c.github.io/html-aam/#att-max
-        for (const { value } of element.attribute("max")) {
-          yield Attribute.of("aria-valuemax", value);
-        }
+        for (const { value } of element.attribute("max")) {}
 
         // https://w3c.github.io/html-aam/#att-min

[Survived] BlockStatement
packages/alfa-aria/src/feature.ts:578:59
         }
 
         // https://w3c.github.io/html-aam/#att-min
-        for (const { value } of element.attribute("min")) {
-          yield Attribute.of("aria-valuemin", value);
-        }
+        for (const { value } of element.attribute("min")) {}
 
         // https://w3c.github.io/html-aam/#att-value-meter

[Survived] StringLiteral
packages/alfa-aria/src/feature.ts:578:51
         }
 
         // https://w3c.github.io/html-aam/#att-min
-        for (const { value } of element.attribute("min")) {
+        for (const { value } of element.attribute("")) {
           yield Attribute.of("aria-valuemin", value);
         }

[Survived] BlockStatement
packages/alfa-aria/src/feature.ts:583:61
         }
 
         // https://w3c.github.io/html-aam/#att-value-meter
-        for (const { value } of element.attribute("value")) {
-          yield Attribute.of("aria-valuenow", value);
-        }
+        for (const { value } of element.attribute("value")) {}
       },
     ),

[Survived] BlockStatement
packages/alfa-aria/src/feature.ts:593:49
 
     ol: html("list"),
 
-    optgroup: html("group", function* (element) {
-      // https://w3c.github.io/html-aam/#att-disabled
-      for (const _ of element.attribute("disabled")) {
-        yield Attribute.of("aria-disabled", "true");
-      }
-    }),
+    optgroup: html("group", function* (element) {}),
 
     option: html(

[Killed] StringLiteral
packages/alfa-aria/src/feature.ts:602:10
 
     option: html(
       ifScopedTo<Role.Name | None>(
-        ["select", "optgroup", "datalist"],
+        ["", "optgroup", "datalist"],
         "option",
         None,
killedBy: All tests
statusReason: packages/alfa-aria/test/role.spec.js(98,7): .from() maps `<select>` to listboxes

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    attributes: [
...

[Survived] StringLiteral
packages/alfa-aria/src/feature.ts:602:32
 
     option: html(
       ifScopedTo<Role.Name | None>(
-        ["select", "optgroup", "datalist"],
+        ["select", "optgroup", ""],
         "option",
         None,

[Survived] BlockStatement
packages/alfa-aria/src/feature.ts:606:27
         "option",
         None,
       ),
-      function* (element) {
-        // https://w3c.github.io/html-aam/#att-disabled
-        for (const _ of element.attribute("disabled")) {
-          yield Attribute.of("aria-disabled", "true");
-        }
-
-        // https://w3c.github.io/html-aam/#att-selected
-        yield Attribute.of(
-          "aria-selected",
-          element.attribute("selected").isSome() ? "true" : "false",
-        );
-      },
+      function* (element) {},
     ),
 

[Survived] StringLiteral
packages/alfa-aria/src/feature.ts:615:52
         // https://w3c.github.io/html-aam/#att-selected
         yield Attribute.of(
           "aria-selected",
-          element.attribute("selected").isSome() ? "true" : "false",
+          element.attribute("selected").isSome() ? "" : "false",
         );
       },

[Survived] BlockStatement
packages/alfa-aria/src/feature.ts:624:55
 
     p: html("paragraph"),
 
-    progress: html("progressbar", function* (element) {
-      // https://w3c.github.io/html-aam/#att-max
-      for (const { value } of element.attribute("max")) {
-        yield Attribute.of("aria-valuemax", value);
-      }
-
-      // https://w3c.github.io/html-aam/#att-value-meter
-      for (const { value } of element.attribute("value")) {
-        yield Attribute.of("aria-valuenow", value);
-      }
-    }),
+    progress: html("progressbar", function* (element) {}),
 
     // We currently cannot detect at this point if the element has an accessible

[Survived] StringLiteral
packages/alfa-aria/src/feature.ts:626:49
 
     progress: html("progressbar", function* (element) {
       // https://w3c.github.io/html-aam/#att-max
-      for (const { value } of element.attribute("max")) {
+      for (const { value } of element.attribute("")) {
         yield Attribute.of("aria-valuemax", value);
       }

[Survived] BlockStatement
packages/alfa-aria/src/feature.ts:649:27
       // (element) =>
       //   test(Element.hasDisplaySize((size) => size > 1), element)
       //   ? "listbox" : combobox
-      function* (element) {
-        // https://w3c.github.io/html-aam/#att-disabled
-        for (const _ of element.attribute("disabled")) {
-          yield Attribute.of("aria-disabled", "true");
-        }
-
-        // https://w3c.github.io/html-aam/#att-required
-        for (const _ of element.attribute("required")) {
-          yield Attribute.of("aria-required", "true");
-        }
-
-        // https://w3c.github.io/html-aam/#att-multiple-select
-        for (const _ of element.attribute("multiple")) {
-          yield Attribute.of("aria-multiselectable", "true");
-        }
-      },
+      function* (element) {},
       nameFromLabel,
     ),

[Survived] StringLiteral
packages/alfa-aria/src/feature.ts:657:47
 
         // https://w3c.github.io/html-aam/#att-required
         for (const _ of element.attribute("required")) {
-          yield Attribute.of("aria-required", "true");
+          yield Attribute.of("aria-required", "");
         }
 

[Survived] BlockStatement
packages/alfa-aria/src/feature.ts:661:56
         }
 
         // https://w3c.github.io/html-aam/#att-multiple-select
-        for (const _ of element.attribute("multiple")) {
-          yield Attribute.of("aria-multiselectable", "true");
-        }
+        for (const _ of element.attribute("multiple")) {}
       },
       nameFromLabel,

[Killed] BlockStatement
packages/alfa-aria/src/feature.ts:679:50
           .filter(isElement)
           .find(hasName("table"))
           .flatMap<Role>((table) => {
-            for (const role of Role.from(table)) {
-              if (role.is("table")) {
-                return Option.of(Role.of("cell"));
-              }
-
-              if (role.is("grid")) {
-                return Option.of(Role.of("gridcell"));
-              }
-            }
+            for (const role of Role.from(table)) {}
 
             return None;
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r42/rule.spec.js(76,7): evaluates() passes a `row` inside a `rowgroup` inside a `table`

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] BlockStatement
packages/alfa-aria/src/feature.ts:680:37
           .find(hasName("table"))
           .flatMap<Role>((table) => {
             for (const role of Role.from(table)) {
-              if (role.is("table")) {
-                return Option.of(Role.of("cell"));
-              }
+              if (role.is("table")) {}
 
               if (role.is("grid")) {
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r42/rule.spec.js(76,7): evaluates() passes a `row` inside a `rowgroup` inside a `table`

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] ConditionalExpression
packages/alfa-aria/src/feature.ts:680:19
           .find(hasName("table"))
           .flatMap<Role>((table) => {
             for (const role of Role.from(table)) {
-              if (role.is("table")) {
+              if (false) {
                 return Option.of(Role.of("cell"));
               }
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r42/rule.spec.js(76,7): evaluates() passes a `row` inside a `rowgroup` inside a `table`

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Survived] ConditionalExpression
packages/alfa-aria/src/feature.ts:684:19
                 return Option.of(Role.of("cell"));
               }
 
-              if (role.is("grid")) {
+              if (false) {
                 return Option.of(Role.of("gridcell"));
               }

[Survived] ConditionalExpression
packages/alfa-aria/src/feature.ts:684:19
                 return Option.of(Role.of("cell"));
               }
 
-              if (role.is("grid")) {
+              if (true) {
                 return Option.of(Role.of("gridcell"));
               }

[Survived] BlockStatement
packages/alfa-aria/src/feature.ts:691:27
 
             return None;
           }),
-      function* (element) {
-        // https://w3c.github.io/html-aam/#att-colspan
-        for (const { value } of element.attribute("colspan")) {
-          yield Attribute.of("aria-colspan", value);
-        }
-
-        // https://w3c.github.io/html-aam/#att-rowspan
-        for (const { value } of element.attribute("rowspan")) {
-          yield Attribute.of("aria-rowspan", value);
-        }
-      },
+      function* (element) {},
     ),
 

[Survived] BlockStatement
packages/alfa-aria/src/feature.ts:693:63
           }),
       function* (element) {
         // https://w3c.github.io/html-aam/#att-colspan
-        for (const { value } of element.attribute("colspan")) {
-          yield Attribute.of("aria-colspan", value);
-        }
+        for (const { value } of element.attribute("colspan")) {}
 
         // https://w3c.github.io/html-aam/#att-rowspan

[Survived] StringLiteral
packages/alfa-aria/src/feature.ts:693:51
           }),
       function* (element) {
         // https://w3c.github.io/html-aam/#att-colspan
-        for (const { value } of element.attribute("colspan")) {
+        for (const { value } of element.attribute("")) {
           yield Attribute.of("aria-colspan", value);
         }

[Survived] BlockStatement
packages/alfa-aria/src/feature.ts:698:63
         }
 
         // https://w3c.github.io/html-aam/#att-rowspan
-        for (const { value } of element.attribute("rowspan")) {
-          yield Attribute.of("aria-rowspan", value);
-        }
+        for (const { value } of element.attribute("rowspan")) {}
       },
     ),

[Survived] StringLiteral
packages/alfa-aria/src/feature.ts:698:51
         }
 
         // https://w3c.github.io/html-aam/#att-rowspan
-        for (const { value } of element.attribute("rowspan")) {
+        for (const { value } of element.attribute("")) {
           yield Attribute.of("aria-rowspan", value);
         }

[Survived] BlockStatement
packages/alfa-aria/src/feature.ts:706:27
 
     textarea: html(
       "textbox",
-      function* (element) {
-        // https://w3c.github.io/html-aam/#el-textarea
-        yield Attribute.of("aria-multiline", "true");
-
-        // https://w3c.github.io/html-aam/#att-disabled
-        for (const _ of element.attribute("disabled")) {
-          yield Attribute.of("aria-disabled", "true");
-        }
-
-        // https://w3c.github.io/html-aam/#att-readonly
-        for (const _ of element.attribute("readonly")) {
-          yield Attribute.of("aria-readonly", "true");
-        }
-
-        // https://w3c.github.io/html-aam/#att-required
-        for (const _ of element.attribute("required")) {
-          yield Attribute.of("aria-required", "true");
-        }
-
-        // https://w3c.github.io/html-aam/#att-placeholder
-        for (const { value } of element.attribute("placeholder")) {
-          yield Attribute.of("aria-placeholder", value);
-        }
-      },
+      function* (element) {},
       (element, device, state) => {
         return Name.fromSteps(

[Survived] StringLiteral
packages/alfa-aria/src/feature.ts:708:46
       "textbox",
       function* (element) {
         // https://w3c.github.io/html-aam/#el-textarea
-        yield Attribute.of("aria-multiline", "true");
+        yield Attribute.of("aria-multiline", "");
 
         // https://w3c.github.io/html-aam/#att-disabled

[Survived] StringLiteral
packages/alfa-aria/src/feature.ts:721:43
         }
 
         // https://w3c.github.io/html-aam/#att-required
-        for (const _ of element.attribute("required")) {
+        for (const _ of element.attribute("")) {
           yield Attribute.of("aria-required", "true");
         }

[Killed] ConditionalExpression
packages/alfa-aria/src/feature.ts:758:15
           .flatMap<Role>(({ table, cell }) => {
             switch (cell.scope) {
               case "column":
-              case "column-group":
-                return Option.of(Role.of("columnheader"));
+              case "column-group":
 
               case "row":
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r76/rule.spec.js(33,7): evaluate() passes explicit headers

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] ConditionalExpression
packages/alfa-aria/src/feature.ts:762:15
                 return Option.of(Role.of("columnheader"));
 
               case "row":
-              case "row-group":
-                return Option.of(Role.of("rowheader"));
+              case "row-group":
 
               default:
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r46/rule.spec.js(70,7): evaluate() passes headers assigned only to other headers

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...
