[Killed] BlockStatement
packages/alfa-aria/src/feature.ts:766:62
                 return Option.of(Role.of("rowheader"));
 
               default:
-                for (const role of Role.from(table.element)) {
-                  if (role.is("table")) {
-                    return Option.of(Role.of("cell"));
-                  }
-
-                  if (role.is("grid")) {
-                    return Option.of(Role.of("gridcell"));
-                  }
-                }
+                for (const role of Role.from(table.element)) {}
 
                 return None;
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r76/rule.spec.js(56,7): evaluate() fails headers with neither scope nor role

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] ConditionalExpression
packages/alfa-aria/src/feature.ts:767:23
 
               default:
                 for (const role of Role.from(table.element)) {
-                  if (role.is("table")) {
+                  if (false) {
                     return Option.of(Role.of("cell"));
                   }
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r76/rule.spec.js(56,7): evaluate() fails headers with neither scope nor role

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] BlockStatement
packages/alfa-aria/src/feature.ts:767:41
 
               default:
                 for (const role of Role.from(table.element)) {
-                  if (role.is("table")) {
-                    return Option.of(Role.of("cell"));
-                  }
+                  if (role.is("table")) {}
 
                   if (role.is("grid")) {
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r76/rule.spec.js(56,7): evaluate() fails headers with neither scope nor role

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Survived] BlockStatement
packages/alfa-aria/src/feature.ts:771:40
                     return Option.of(Role.of("cell"));
                   }
 
-                  if (role.is("grid")) {
-                    return Option.of(Role.of("gridcell"));
-                  }
+                  if (role.is("grid")) {}
                 }
 
