[Killed] BlockStatement
src/name/predicate/has-value.ts:26:47
 ): Predicate<Name> {
   let predicate: Predicate<string>;
 
-  if (typeof valueOrPredicate === "function") {
-    predicate = valueOrPredicate;
-  } else {
+  if (typeof valueOrPredicate === "function") {} else {
     predicate = equals(valueOrPredicate, ...values);
   }
killedBy: All tests
statusReason: packages/alfa-aria/src/name/predicate/has-value.js(78,93): evaluate() passes a link with a name given by content
TypeError: predicate is not a function

[Survived] BlockStatement
src/name/predicate/has-value.ts:28:10
 
   if (typeof valueOrPredicate === "function") {
     predicate = valueOrPredicate;
-  } else {
-    predicate = equals(valueOrPredicate, ...values);
-  }
+  } else {}
 
   return (name) => predicate(name.value);
