[Killed] BlockStatement
packages/alfa-aria/src/name.ts:55:41
     return this._sources;
   }
 
-  public *sourceNodes(): Iterable<Node> {
-    for (const source of this._sources) {
-      yield* source;
-    }
-  }
+  public *sourceNodes(): Iterable<Node> {}
 
   public isEmpty(): boolean {
killedBy: All tests
statusReason: message(NaN,NaN): evaluate() is inapplicable to elements that are used in name of disabled widgets

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     expectations: [

[Killed] BlockStatement
packages/alfa-aria/src/name.ts:56:41
   }
 
   public *sourceNodes(): Iterable<Node> {
-    for (const source of this._sources) {
-      yield* source;
-    }
+    for (const source of this._sources) {}
   }
 
killedBy: All tests
statusReason: message(NaN,NaN): evaluate() is inapplicable to elements that are used in name of disabled widgets

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     expectations: [

[Survived] ConditionalExpression
packages/alfa-aria/src/name.ts:62:12
   }
 
   public isEmpty(): boolean {
-    return this._value.length === 0;
+    return true;
   }
 

[Survived] EqualityOperator
packages/alfa-aria/src/name.ts:62:12
   }
 
   public isEmpty(): boolean {
-    return this._value.length === 0;
+    return this._value.length !== 0;
   }
 

[Survived] ConditionalExpression
packages/alfa-aria/src/name.ts:67:7
 
   public equals(value: unknown): value is this {
     return (
-      value instanceof Name &&
-      value._value === this._value &&
-      value._sources.length === this._sources.length &&
-      value._sources.every((source, i) => source.equals(this._sources[i]))
+      true
     );
   }

[Survived] ConditionalExpression
packages/alfa-aria/src/name.ts:67:7
 
   public equals(value: unknown): value is this {
     return (
-      value instanceof Name &&
-      value._value === this._value &&
-      value._sources.length === this._sources.length &&
-      value._sources.every((source, i) => source.equals(this._sources[i]))
+      false
     );
   }

[Survived] EqualityOperator
packages/alfa-aria/src/name.ts:68:7
   public equals(value: unknown): value is this {
     return (
       value instanceof Name &&
-      value._value === this._value &&
+      value._value !== this._value &&
       value._sources.length === this._sources.length &&
       value._sources.every((source, i) => source.equals(this._sources[i]))

[Survived] ConditionalExpression
packages/alfa-aria/src/name.ts:68:7
   public equals(value: unknown): value is this {
     return (
       value instanceof Name &&
-      value._value === this._value &&
+      true &&
       value._sources.length === this._sources.length &&
       value._sources.every((source, i) => source.equals(this._sources[i]))

[Survived] EqualityOperator
packages/alfa-aria/src/name.ts:69:7
     return (
       value instanceof Name &&
       value._value === this._value &&
-      value._sources.length === this._sources.length &&
+      value._sources.length !== this._sources.length &&
       value._sources.every((source, i) => source.equals(this._sources[i]))
     );

[Survived] ConditionalExpression
packages/alfa-aria/src/name.ts:69:7
     return (
       value instanceof Name &&
       value._value === this._value &&
-      value._sources.length === this._sources.length &&
+      true &&
       value._sources.every((source, i) => source.equals(this._sources[i]))
     );

[Survived] ArrowFunction
packages/alfa-aria/src/name.ts:70:28
       value instanceof Name &&
       value._value === this._value &&
       value._sources.length === this._sources.length &&
-      value._sources.every((source, i) => source.equals(this._sources[i]))
+      value._sources.every(() => undefined)
     );
   }

[Survived] MethodExpression
packages/alfa-aria/src/name.ts:70:7
       value instanceof Name &&
       value._value === this._value &&
       value._sources.length === this._sources.length &&
-      value._sources.every((source, i) => source.equals(this._sources[i]))
+      value._sources.some((source, i) => source.equals(this._sources[i]))
     );
   }

[Survived] ConditionalExpression
packages/alfa-aria/src/name.ts:131:16
       }
 
       public equals(value: unknown): value is this {
-        return value instanceof Data && value._text.equals(this._text);
+        return false;
       }
 

[Survived] ConditionalExpression
packages/alfa-aria/src/name.ts:131:16
       }
 
       public equals(value: unknown): value is this {
-        return value instanceof Data && value._text.equals(this._text);
+        return true;
       }
 

[Killed] BlockStatement
packages/alfa-aria/src/name.ts:134:51
         return value instanceof Data && value._text.equals(this._text);
       }
 
-      public *[Symbol.iterator](): Iterator<Node> {
-        yield this._text;
-      }
+      public *[Symbol.iterator](): Iterator<Node> {}
 
       public toJSON(): Data.JSON {
killedBy: All tests
statusReason: message(NaN,NaN): evaluate() is inapplicable to elements that are used in name of disabled widgets

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     expectations: [

[Survived] ConditionalExpression
packages/alfa-aria/src/name.ts:187:11
 
       public equals(value: unknown): value is this {
         return (
-          value instanceof Descendant &&
-          value._element.equals(this._element) &&
-          value._name.equals(this._name)
+          true
         );
       }

[Survived] ConditionalExpression
packages/alfa-aria/src/name.ts:187:11
 
       public equals(value: unknown): value is this {
         return (
-          value instanceof Descendant &&
-          value._element.equals(this._element) &&
-          value._name.equals(this._name)
+          false
         );
       }

[Killed] BlockStatement
packages/alfa-aria/src/name.ts:193:51
         );
       }
 
-      public *[Symbol.iterator](): Iterator<Node> {
-        yield this._element;
-        yield* this._name.sourceNodes();
-      }
+      public *[Symbol.iterator](): Iterator<Node> {}
 
       public toJSON(): Descendant.JSON {
killedBy: All tests
statusReason: message(NaN,NaN): evaluate() is inapplicable to elements that are used in name of disabled widgets

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     expectations: [

[Survived] ConditionalExpression
packages/alfa-aria/src/name.ts:247:11
 
       public equals(value: unknown): value is this {
         return (
-          value instanceof Ancestor &&
-          value._element.equals(this._element) &&
-          value._name.equals(this._name)
+          false
         );
       }

[Survived] ConditionalExpression
packages/alfa-aria/src/name.ts:247:11
 
       public equals(value: unknown): value is this {
         return (
-          value instanceof Ancestor &&
-          value._element.equals(this._element) &&
-          value._name.equals(this._name)
+          true
         );
       }

[Survived] ConditionalExpression
packages/alfa-aria/src/name.ts:301:11
 
       public equals(value: unknown): value is this {
         return (
-          value instanceof Label && value._attribute.equals(this._attribute)
+          false
         );
       }

[Survived] ConditionalExpression
packages/alfa-aria/src/name.ts:301:11
 
       public equals(value: unknown): value is this {
         return (
-          value instanceof Label && value._attribute.equals(this._attribute)
+          true
         );
       }

[Survived] BlockStatement
packages/alfa-aria/src/name.ts:305:51
         );
       }
 
-      public *[Symbol.iterator](): Iterator<Node> {
-        yield this._attribute;
-      }
+      public *[Symbol.iterator](): Iterator<Node> {}
 
       public toJSON(): Label.JSON {

[Survived] ConditionalExpression
packages/alfa-aria/src/name.ts:356:11
 
       public equals(value: unknown): value is this {
         return (
-          value instanceof Reference && value._attribute.equals(this._attribute)
+          false
         );
       }

[Survived] ConditionalExpression
packages/alfa-aria/src/name.ts:356:11
 
       public equals(value: unknown): value is this {
         return (
-          value instanceof Reference && value._attribute.equals(this._attribute)
+          true
         );
       }

[Killed] BlockStatement
packages/alfa-aria/src/name.ts:360:51
         );
       }
 
-      public *[Symbol.iterator](): Iterator<Node> {
-        yield this._attribute;
-        yield* this._name.sourceNodes();
-      }
+      public *[Symbol.iterator](): Iterator<Node> {}
 
       public toJSON(): Reference.JSON {
killedBy: All tests
statusReason: message(NaN,NaN): evaluate() is inapplicable to elements that are used in name of disabled widgets

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     expectations: [

[Killed] BooleanLiteral
packages/alfa-aria/src/name.ts:392:62
    * @internal
    */
   export class State implements Equatable, Serializable<State.JSON> {
-    private static _empty = new State([], None, None, false, false);
+    private static _empty = new State([], None, None, false, true);
 
     public static empty(): State {
killedBy: All tests
statusReason: packages/alfa-aria/test/dom/predicate/has-incorrect-role-without-name.spec.js(18,7): hasIncorrectRoleWithoutName returns true for nameless `<section>`

Expected values to be strictly deep-equal:

false !== true

[Survived] BooleanLiteral
packages/alfa-aria/src/name.ts:392:55
    * @internal
    */
   export class State implements Equatable, Serializable<State.JSON> {
-    private static _empty = new State([], None, None, false, false);
+    private static _empty = new State([], None, None, true, false);
 
     public static empty(): State {

[Killed] ConditionalExpression
packages/alfa-aria/src/name.ts:472:11
     }
 
     public visit(element: Element): State {
-      if (this._visited.includes(element)) {
+      if (true) {
         return this;
       }
killedBy: All tests
statusReason: packages/alfa-option/src/index.js(6,47): .from() determines the name of an <input> element with a <label> parent element with child text content
RangeError: Maximum call stack size exceeded

[Survived] ConditionalExpression
packages/alfa-aria/src/name.ts:472:11
     }
 
     public visit(element: Element): State {
-      if (this._visited.includes(element)) {
+      if (false) {
         return this;
       }

[Survived] ConditionalExpression
packages/alfa-aria/src/name.ts:486:11
     }
 
     public recurse(isRecursing: boolean): State {
-      if (this._isRecursing === isRecursing) {
+      if (true) {
         return this;
       }

[Survived] ConditionalExpression
packages/alfa-aria/src/name.ts:486:11
     }
 
     public recurse(isRecursing: boolean): State {
-      if (this._isRecursing === isRecursing) {
+      if (false) {
         return this;
       }

[Killed] ConditionalExpression
packages/alfa-aria/src/name.ts:510:9
      */
     public reference(referrer: Element, referred: Element): State {
       if (
-        this._referrer.includes(referrer) &&
-        this._referred.includes(referred)
+        true
       ) {
         return this;
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of a <button> element with an aria-labelledby attribute that points to a <p> element with child text content
Error: Attempted to .getUnsafe() from None

[Survived] LogicalOperator
packages/alfa-aria/src/name.ts:510:9
      */
     public reference(referrer: Element, referred: Element): State {
       if (
-        this._referrer.includes(referrer) &&
-        this._referred.includes(referred)
+        this._referrer.includes(referrer) || this._referred.includes(referred)
       ) {
         return this;

[Survived] BlockStatement
packages/alfa-aria/src/name.ts:512:9
       if (
         this._referrer.includes(referrer) &&
         this._referred.includes(referred)
-      ) {
-        return this;
-      }
+      ) {}
 
       return new State(

[Killed] EqualityOperator
packages/alfa-aria/src/name.ts:526:11
     }
 
     public descend(isDescending: boolean): State {
-      if (this._isDescending === isDescending) {
+      if (this._isDescending !== isDescending) {
         return this;
       }
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of a <button> element with a <span> child element with child text content
Error: Attempted to .getUnsafe() from None

[Killed] ConditionalExpression
packages/alfa-aria/src/name.ts:526:11
     }
 
     public descend(isDescending: boolean): State {
-      if (this._isDescending === isDescending) {
+      if (true) {
         return this;
       }
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of a <button> element with a <span> child element with child text content
Error: Attempted to .getUnsafe() from None

[Survived] ConditionalExpression
packages/alfa-aria/src/name.ts:545:9
 
     public equals(value: unknown): boolean {
       return (
-        value instanceof State &&
-        Array.equals(value._visited, this._visited) &&
-        value._referrer.equals(this._referrer) &&
-        value._referred.equals(this._referred) &&
-        value._isRecursing === this._isRecursing &&
-        value._isDescending === this._isDescending
+        true
       );
     }

[Survived] ConditionalExpression
packages/alfa-aria/src/name.ts:545:9
 
     public equals(value: unknown): boolean {
       return (
-        value instanceof State &&
-        Array.equals(value._visited, this._visited) &&
-        value._referrer.equals(this._referrer) &&
-        value._referred.equals(this._referred) &&
-        value._isRecursing === this._isRecursing &&
-        value._isDescending === this._isDescending
+        false
       );
     }

[Survived] EqualityOperator
packages/alfa-aria/src/name.ts:549:9
         Array.equals(value._visited, this._visited) &&
         value._referrer.equals(this._referrer) &&
         value._referred.equals(this._referred) &&
-        value._isRecursing === this._isRecursing &&
+        value._isRecursing !== this._isRecursing &&
         value._isDescending === this._isDescending
       );

[Survived] ConditionalExpression
packages/alfa-aria/src/name.ts:549:9
         Array.equals(value._visited, this._visited) &&
         value._referrer.equals(this._referrer) &&
         value._referred.equals(this._referred) &&
-        value._isRecursing === this._isRecursing &&
+        true &&
         value._isDescending === this._isDescending
       );

[Survived] EqualityOperator
packages/alfa-aria/src/name.ts:550:9
         value._referrer.equals(this._referrer) &&
         value._referred.equals(this._referred) &&
         value._isRecursing === this._isRecursing &&
-        value._isDescending === this._isDescending
+        value._isDescending !== this._isDescending
       );
     }

[Survived] ConditionalExpression
packages/alfa-aria/src/name.ts:550:9
         value._referrer.equals(this._referrer) &&
         value._referred.equals(this._referred) &&
         value._isRecursing === this._isRecursing &&
-        value._isDescending === this._isDescending
+        true
       );
     }

[Killed] ConditionalExpression
packages/alfa-aria/src/name.ts:596:9
     const name = () =>
       isElement(node) ? fromElement(node, device, state) : fromText(node);
 
-    if (isElement(node)) {
+    if (false) {
       // As chained references are not allowed, we cannot make use of the cache
       // when computing a referenced name. If, for example, <foo> references
killedBy: All tests
statusReason: packages/alfa-aria/test/name.spec.js(988,7): .from() correctly handles circular aria-labelledby references

Expected values to be strictly deep-equal:
+ actual - expected

  {
    sources: [
      {

[Survived] ConditionalExpression
packages/alfa-aria/src/name.ts:596:9
     const name = () =>
       isElement(node) ? fromElement(node, device, state) : fromText(node);
 
-    if (isElement(node)) {
+    if (true) {
       // As chained references are not allowed, we cannot make use of the cache
       // when computing a referenced name. If, for example, <foo> references

[Killed] ConditionalExpression
packages/alfa-aria/src/name.ts:615:11
       //   <foo> null -> <bar> null
       //
       // We therefore cannot make use of whatever is in the cache for <bar>.
-      if (state.isReferencing) {
+      if (false) {
         return name();
       }
killedBy: All tests
statusReason: packages/alfa-aria/test/name.spec.js(988,7): .from() correctly handles circular aria-labelledby references

Expected values to be strictly deep-equal:
+ actual - expected

  {
    sources: [
      {

[Killed] BlockStatement
packages/alfa-aria/src/name.ts:615:32
       //   <foo> null -> <bar> null
       //
       // We therefore cannot make use of whatever is in the cache for <bar>.
-      if (state.isReferencing) {
-        return name();
-      }
+      if (state.isReferencing) {}
 
       // If we're descending then the name already in the cache may not be
killedBy: All tests
statusReason: packages/alfa-aria/test/name.spec.js(988,7): .from() correctly handles circular aria-labelledby references

Expected values to be strictly deep-equal:
+ actual - expected

  {
    sources: [
      {

[Killed] ConditionalExpression
packages/alfa-aria/src/name.ts:643:11
       //       <baz> "Hello world"
       //
       // We therefore cannot make use of whatever is in the cache for <bar>.
-      if (state.isDescending) {
+      if (false) {
         return name();
       }
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() behaves correctly when encountering a descendant that doesn't itself have a name, but should have one when required by an ancestor
Error: Attempted to .getUnsafe() from None

[Killed] BlockStatement
packages/alfa-aria/src/name.ts:643:31
       //       <baz> "Hello world"
       //
       // We therefore cannot make use of whatever is in the cache for <bar>.
-      if (state.isDescending) {
-        return name();
-      }
+      if (state.isDescending) {}
     }
 
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() behaves correctly when encountering a descendant that doesn't itself have a name, but should have one when required by an ancestor
Error: Attempted to .getUnsafe() from None

[Killed] ConditionalExpression
packages/alfa-aria/src/name.ts:659:9
     device: Device,
     state: State,
   ): Option<Name> {
-    if (state.hasVisited(element)) {
+    if (false) {
       // While self-references are allowed, any other forms of circular
       // references are not. If the referrer therefore isn't the element itself,
killedBy: All tests
statusReason: packages/alfa-option/src/index.js(6,47): .from() determines the name of an <input> element with a <label> parent element with child text content
RangeError: Maximum call stack size exceeded

[Killed] ConditionalExpression
packages/alfa-aria/src/name.ts:659:9
     device: Device,
     state: State,
   ): Option<Name> {
-    if (state.hasVisited(element)) {
+    if (true) {
       // While self-references are allowed, any other forms of circular
       // references are not. If the referrer therefore isn't the element itself,
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(11,7): .from() constructs an accessible node from an element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    attributes: [],
...

[Killed] ConditionalExpression
packages/alfa-aria/src/name.ts:663:11
       // While self-references are allowed, any other forms of circular
       // references are not. If the referrer therefore isn't the element itself,
       // the result will be an empty name.
-      if (!state.referrer.includes(element)) {
+      if (true) {
         return None;
       }
killedBy: All tests
statusReason: packages/alfa-aria/test/name.spec.js(190,7): .from() order tokens in aria-labelledby order, not DOM order

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    sources: [
...

[Killed] BlockStatement
packages/alfa-aria/src/name.ts:663:46
       // While self-references are allowed, any other forms of circular
       // references are not. If the referrer therefore isn't the element itself,
       // the result will be an empty name.
-      if (!state.referrer.includes(element)) {
-        return None;
-      }
+      if (!state.referrer.includes(element)) {}
     } else {
       state = state.visit(element);
killedBy: All tests
statusReason: packages/alfa-map/src/map.js(227,14): .from() behaves when encountering an element with global properties where the element should not be named by its subtree
RangeError: Maximum call stack size exceeded

[Killed] BlockStatement
packages/alfa-aria/src/name.ts:666:12
       if (!state.referrer.includes(element)) {
         return None;
       }
-    } else {
-      state = state.visit(element);
-    }
+    } else {}
 
     // The following code handles the _generic_ steps of the accessible name
killedBy: All tests
statusReason: packages/alfa-option/src/index.js(6,47): .from() determines the name of an <input> element with a <label> parent element with child text content
RangeError: Maximum call stack size exceeded

[Killed] LogicalOperator
packages/alfa-aria/src/name.ts:683:7
     // Step 1 is skipped when descending due to step 2F.iii.b
     // https://w3c.github.io/accname/#step2B.iii.b
     if (
-      !state.isReferencing &&
-      !state.isDescending &&
-      role.some((role) => role.isNameProhibited())
+      !state.isReferencing && !state.isDescending || role.some(role => role.isNameProhibited())
     ) {
       return None;
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of a <button> element with child text content
Error: Attempted to .getUnsafe() from None

[Killed] BooleanLiteral
packages/alfa-aria/src/name.ts:683:7
     // Step 1 is skipped when descending due to step 2F.iii.b
     // https://w3c.github.io/accname/#step2B.iii.b
     if (
-      !state.isReferencing &&
+      state.isReferencing &&
       !state.isDescending &&
       role.some((role) => role.isNameProhibited())
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of a <button> element with an aria-labelledby attribute that points to a <p> element with child text content
Error: Attempted to .getUnsafe() from None

[Killed] BooleanLiteral
packages/alfa-aria/src/name.ts:684:7
     // https://w3c.github.io/accname/#step2B.iii.b
     if (
       !state.isReferencing &&
-      !state.isDescending &&
+      state.isDescending &&
       role.some((role) => role.isNameProhibited())
     ) {
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of a <button> element with a <span> child element with child text content
Error: Attempted to .getUnsafe() from None

[Killed] MethodExpression
packages/alfa-aria/src/name.ts:685:7
     if (
       !state.isReferencing &&
       !state.isDescending &&
-      role.some((role) => role.isNameProhibited())
+      role.every(role => role.isNameProhibited())
     ) {
       return None;
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() correctly handles aria-labelledby references to hidden elements with child elements with child text content
Error: Attempted to .getUnsafe() from None

[Killed] BlockStatement
packages/alfa-aria/src/name.ts:686:7
       !state.isReferencing &&
       !state.isDescending &&
       role.some((role) => role.isNameProhibited())
-    ) {
-      return None;
-    }
+    ) {}
 
     // Step 2A: Is the element hidden and not part of a reference traversal
killedBy: All tests
statusReason: packages/alfa-aria/test/name-testable-statements.spec.js(305,7): Name test case 596

Expected "actual" to be strictly unequal to: 'bar'



file:///home/rcj/repos/alfa/.stryker-tmp/sandbox2218818/node_modules/execa/lib/error.js:60
		error = new Error(message);

[Killed] ConditionalExpression
packages/alfa-aria/src/name.ts:697:7
       // The element is hidden
       // https://www.w3.org/TR/wai-aria-1.2/#dfn-hidden
       // https://w3c.github.io/accname/#step2A (first comment)
-      test(isProgrammaticallyHidden(device), element)
+      false
     ) {
       // The element is not part of a traversal
killedBy: All tests
statusReason: packages/alfa-aria/test/name.spec.js(57,7): .from() determines the name of a <button> element with partially hidden children

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    sources: [
...

[Killed] ConditionalExpression
packages/alfa-aria/src/name.ts:697:7
       // The element is hidden
       // https://www.w3.org/TR/wai-aria-1.2/#dfn-hidden
       // https://w3c.github.io/accname/#step2A (first comment)
-      test(isProgrammaticallyHidden(device), element)
+      true
     ) {
       // The element is not part of a traversal
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of a <button> element with child text content
Error: Attempted to .getUnsafe() from None

[Killed] BlockStatement
packages/alfa-aria/src/name.ts:698:7
       // https://www.w3.org/TR/wai-aria-1.2/#dfn-hidden
       // https://w3c.github.io/accname/#step2A (first comment)
       test(isProgrammaticallyHidden(device), element)
-    ) {
-      // The element is not part of a traversal
-      if (!state.isReferencing) {
-        return None;
-      }
-
-      // The element is part of a native host language traversal;
-      // this is detected by having the referrer and the referred being the
-      // same.
-      // This is theoretically not needed, see
-      // https://github.com/Siteimprove/alfa/issues/1266
-      if (state.referrer.equals(state.referred)) {
-        return None;
-      }
-
-      // The element is part of an `aria-labelledby` traversal whose root was
-      // not hidden.
-      if (state.referred.none(isProgrammaticallyHidden(device))) {
-        return None;
-      }
-
-      // The element is part of an `aria-labelledby` traversal whose root
-      // was hidden, keep going.
-    }
+    ) {}
 
     return fromSteps(
killedBy: All tests
statusReason: packages/alfa-aria/test/name.spec.js(57,7): .from() determines the name of a <button> element with partially hidden children

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    sources: [
...

[Killed] ConditionalExpression
packages/alfa-aria/src/name.ts:700:11
       test(isProgrammaticallyHidden(device), element)
     ) {
       // The element is not part of a traversal
-      if (!state.isReferencing) {
+      if (true) {
         return None;
       }
killedBy: All tests
statusReason: packages/alfa-aria/test/name-testable-statements.spec.js(1528,7): Name from content of labelledby elements one of which is hidden

Expected values to be strictly equal:
+ actual - expected

+ ''
- 'Important stuff'

[Killed] BooleanLiteral
packages/alfa-aria/src/name.ts:700:11
       test(isProgrammaticallyHidden(device), element)
     ) {
       // The element is not part of a traversal
-      if (!state.isReferencing) {
+      if (state.isReferencing) {
         return None;
       }
killedBy: All tests
statusReason: packages/alfa-aria/test/name-testable-statements.spec.js(1528,7): Name from content of labelledby elements one of which is hidden

Expected values to be strictly equal:
+ actual - expected

+ ''
- 'Important stuff'

[Killed] BlockStatement
packages/alfa-aria/src/name.ts:709:50
       // same.
       // This is theoretically not needed, see
       // https://github.com/Siteimprove/alfa/issues/1266
-      if (state.referrer.equals(state.referred)) {
-        return None;
-      }
+      if (state.referrer.equals(state.referred)) {}
 
       // The element is part of an `aria-labelledby` traversal whose root was
killedBy: All tests
statusReason: packages/alfa-aria/test/name.spec.js(890,7): .from() ignores hidden `<label>` elements

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

+ Some {
+   _value: Name {
+     _sources: [

[Killed] ConditionalExpression
packages/alfa-aria/src/name.ts:709:11
       // same.
       // This is theoretically not needed, see
       // https://github.com/Siteimprove/alfa/issues/1266
-      if (state.referrer.equals(state.referred)) {
+      if (true) {
         return None;
       }
killedBy: All tests
statusReason: packages/alfa-aria/test/name-testable-statements.spec.js(1528,7): Name from content of labelledby elements one of which is hidden

Expected values to be strictly equal:
+ actual - expected

+ ''
- 'Important stuff'

[Killed] ConditionalExpression
packages/alfa-aria/src/name.ts:715:11
 
       // The element is part of an `aria-labelledby` traversal whose root was
       // not hidden.
-      if (state.referred.none(isProgrammaticallyHidden(device))) {
+      if (false) {
         return None;
       }
killedBy: All tests
statusReason: packages/alfa-aria/test/name.spec.js(937,7): .from() correctly handles aria-labelledby references to elements with hidden children elements with child text content

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    sources: [
...
