[Killed] ConditionalExpression
packages/alfa-aria/src/name.ts:715:11
 
       // The element is part of an `aria-labelledby` traversal whose root was
       // not hidden.
-      if (state.referred.none(isProgrammaticallyHidden(device))) {
+      if (true) {
         return None;
       }
killedBy: All tests
statusReason: packages/alfa-aria/test/name-testable-statements.spec.js(1528,7): Name from content of labelledby elements one of which is hidden

Expected values to be strictly equal:
+ actual - expected

+ ''
- 'Important stuff'

[Killed] BlockStatement
packages/alfa-aria/src/name.ts:730:34
         // Chained `aria-labelledby` references, such `foo` -> `bar` -> `baz`,
         // are not allowed. If the element is therefore being referenced
         // already then this step produces an empty name.
-        if (state.isReferencing) {
-          return None;
-        }
+        if (state.isReferencing) {}
 
         return element
killedBy: All tests
statusReason: packages/alfa-map/src/map.js(126,8): .from() order tokens in aria-labelledby order, not DOM order
RangeError: Maximum call stack size exceeded

[Killed] ConditionalExpression
packages/alfa-aria/src/name.ts:730:13
         // Chained `aria-labelledby` references, such `foo` -> `bar` -> `baz`,
         // are not allowed. If the element is therefore being referenced
         // already then this step produces an empty name.
-        if (state.isReferencing) {
+        if (true) {
           return None;
         }
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of a <button> element with an aria-labelledby attribute that points to a <p> element with child text content
Error: Attempted to .getUnsafe() from None

[Killed] StringLiteral
packages/alfa-aria/src/name.ts:735:22
         }
 
         return element
-          .attribute("aria-labelledby")
+          .attribute("")
           .flatMap((attribute) =>
             fromReferences(attribute, element, device, state),
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of a <button> element with an aria-labelledby attribute that points to a <p> element with child text content
Error: Attempted to .getUnsafe() from None

[Killed] StringLiteral
packages/alfa-aria/src/name.ts:748:22
       // https://w3c.github.io/accname/#step2D
       () => {
         return element
-          .attribute("aria-label")
+          .attribute("")
           .flatMap((attribute) => fromLabel(attribute));
       },
killedBy: All tests
statusReason: packages/alfa-aria/test/dom/predicate/has-incorrect-role-without-name.spec.js(24,7): hasIncorrectRoleWithoutName returns false for named `<section>`

Expected values to be strictly deep-equal:

true !== false

[Killed] MethodExpression
packages/alfa-aria/src/name.ts:761:11
         // element therefore is presentational or the element has no namespace
         // then this step produces an empty name.
         if (
-          role.some((role) => role.isPresentational()) ||
+          role.every(role => role.isPresentational()) ||
           !element.namespace.isSome()
         ) {
killedBy: All tests
statusReason: packages/alfa-aria/test/name-testable-statements.spec.js(458,7): Name test case 612

Expected values to be strictly equal:

'' !== 'foo'

[Killed] ConditionalExpression
packages/alfa-aria/src/name.ts:781:11
         // referenced and is not allowed to be named by its content then this
         // step produces an empty name.
         if (
-          !state.isReferencing &&
-          !role.some((role) => role.isNamedBy("contents"))
+          true
         ) {
           return None;
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of a <button> element with child text content
Error: Attempted to .getUnsafe() from None

[Killed] MethodExpression
packages/alfa-aria/src/name.ts:782:12
         // step produces an empty name.
         if (
           !state.isReferencing &&
-          !role.some((role) => role.isNamedBy("contents"))
+          !role.every(role => role.isNamedBy("contents"))
         ) {
           return None;
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(401,7): .from() does not expose fallback DOM nodes for legacy browsers

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    attributes: [],
...

[Killed] BooleanLiteral
packages/alfa-aria/src/name.ts:782:11
         // step produces an empty name.
         if (
           !state.isReferencing &&
-          !role.some((role) => role.isNamedBy("contents"))
+          role.some(role => role.isNamedBy("contents"))
         ) {
           return None;
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(11,7): .from() constructs an accessible node from an element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    attributes: [],
...

[Killed] BlockStatement
packages/alfa-aria/src/name.ts:783:11
         if (
           !state.isReferencing &&
           !role.some((role) => role.isNamedBy("contents"))
-        ) {
-          return None;
-        }
+        ) {}
 
         return fromDescendants(element, device, state);
killedBy: All tests
statusReason: packages/alfa-aria/test/role.spec.js(98,7): .from() maps `<select>` to listboxes

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    attributes: [
...

[Killed] BlockStatement
packages/alfa-aria/src/name.ts:795:34
       () => {
         // Unless we're already descending then this step produces an empty
         // name.
-        if (!state.isDescending) {
-          return None;
-        }
+        if (!state.isDescending) {}
 
         return fromDescendants(element, device, state);
killedBy: All tests
statusReason: packages/alfa-aria/test/dom/predicate/has-incorrect-role-without-name.spec.js(18,7): hasIncorrectRoleWithoutName returns true for nameless `<section>`

Expected values to be strictly deep-equal:

false !== true

[Killed] ConditionalExpression
packages/alfa-aria/src/name.ts:795:13
       () => {
         // Unless we're already descending then this step produces an empty
         // name.
-        if (!state.isDescending) {
+        if (false) {
           return None;
         }
killedBy: All tests
statusReason: packages/alfa-aria/test/dom/predicate/has-incorrect-role-without-name.spec.js(18,7): hasIncorrectRoleWithoutName returns true for nameless `<section>`

Expected values to be strictly deep-equal:

false !== true

[Killed] BooleanLiteral
packages/alfa-aria/src/name.ts:829:63
       .children(Node.flatTree)
       .filter(or(isText, isElement))
       .collect((element) =>
-        fromNode(element, device, state.recurse(true).descend(true)).map(
+        fromNode(element, device, state.recurse(true).descend(false)).map(
           (name) => {
             if (
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of a <button> element with a <span> child element with child text content
Error: Attempted to .getUnsafe() from None

[Survived] BooleanLiteral
packages/alfa-aria/src/name.ts:829:49
       .children(Node.flatTree)
       .filter(or(isText, isElement))
       .collect((element) =>
-        fromNode(element, device, state.recurse(true).descend(true)).map(
+        fromNode(element, device, state.recurse(false).descend(true)).map(
           (name) => {
             if (

[Killed] ConditionalExpression
packages/alfa-aria/src/name.ts:832:15
         fromNode(element, device, state.recurse(true).descend(true)).map(
           (name) => {
             if (
-              test(
-                hasComputedStyle(
-                  "display",
-                  ({ values: [outside] }) => outside.value === "block",
-                  device,
-                ),
-                element,
-              )
+              false
             ) {
               return [` ${name.value} `, name];
killedBy: All tests
statusReason: packages/alfa-aria/test/name.spec.js(471,7): .from() joins block descendant names with a space

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    sources: [
...

[Killed] ConditionalExpression
packages/alfa-aria/src/name.ts:832:15
         fromNode(element, device, state.recurse(true).descend(true)).map(
           (name) => {
             if (
-              test(
-                hasComputedStyle(
-                  "display",
-                  ({ values: [outside] }) => outside.value === "block",
-                  device,
-                ),
-                element,
-              )
+              true
             ) {
               return [` ${name.value} `, name];
killedBy: All tests
statusReason: packages/alfa-aria/test/name.spec.js(428,7): .from() joins descendant names without a space

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    sources: [
...

[Killed] ConditionalExpression
packages/alfa-aria/src/name.ts:835:46
               test(
                 hasComputedStyle(
                   "display",
-                  ({ values: [outside] }) => outside.value === "block",
+                  ({ values: [outside] }) => false,
                   device,
                 ),
killedBy: All tests
statusReason: packages/alfa-aria/test/name.spec.js(471,7): .from() joins block descendant names with a space

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    sources: [
...

[Killed] EqualityOperator
packages/alfa-aria/src/name.ts:835:46
               test(
                 hasComputedStyle(
                   "display",
-                  ({ values: [outside] }) => outside.value === "block",
+                  ({ values: [outside] }) => outside.value !== "block",
                   device,
                 ),
killedBy: All tests
statusReason: packages/alfa-aria/test/name.spec.js(428,7): .from() joins descendant names without a space

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    sources: [
...

[Killed] BlockStatement
packages/alfa-aria/src/name.ts:840:15
                 ),
                 element,
               )
-            ) {
-              return [` ${name.value} `, name];
-            }
+            ) {}
             return [name.value, name];
           },
killedBy: All tests
statusReason: packages/alfa-aria/test/name.spec.js(471,7): .from() joins block descendant names with a space

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    sources: [
...

[Killed] ArrowFunction
packages/alfa-aria/src/name.ts:848:36
         ),
       );
 
-    const name = flatten(names.map(([value]) => value).join("")).trim();
+    const name = flatten(names.map(() => undefined).join("")).trim();
 
     if (name === "") {
killedBy: All tests
statusReason: packages/alfa-aria/test/role.spec.js(98,7): .from() maps `<select>` to listboxes

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    attributes: [
...

[Killed] MethodExpression
packages/alfa-aria/src/name.ts:848:18
         ),
       );
 
-    const name = flatten(names.map(([value]) => value).join("")).trim();
+    const name = flatten(names.map(([value]) => value).join(""));
 
     if (name === "") {
killedBy: All tests
statusReason: packages/alfa-aria/test/name-testable-statements.spec.js(43,7): Name test case 540

Expected values to be strictly equal:
+ actual - expected

+ " Rich's button "
- "Rich's button"

[Killed] BlockStatement
packages/alfa-aria/src/name.ts:850:22
 
     const name = flatten(names.map(([value]) => value).join("")).trim();
 
-    if (name === "") {
-      return None;
-    }
+    if (name === "") {}
 
     return Option.of(
killedBy: All tests
statusReason: packages/alfa-aria/test/role.spec.js(51,7): .from() doesn't inherit presentational roles into children of implicitly required children of a presentational element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    children: [
...

[Killed] ConditionalExpression
packages/alfa-aria/src/name.ts:868:9
   export function fromLabel(attribute: Attribute): Option<Name> {
     const name = flatten(attribute.value);
 
-    if (name === "") {
+    if (false) {
       return None;
     }
killedBy: All tests
statusReason: packages/alfa-aria/test/name.spec.js(110,7): .from() determines the name of a <button> element with an empty aria-label attribute and child text content

Expected values to be strictly deep-equal:
+ actual - expected

  {
    sources: [
      {

[Killed] ArrayDeclaration
packages/alfa-aria/src/name.ts:872:36
       return None;
     }
 
-    return Option.of(Name.of(name, [Source.label(attribute)]));
+    return Option.of(Name.of(name, []));
   }
 
killedBy: All tests
statusReason: packages/alfa-aria/test/name.spec.js(102,7): .from() determines the name of a <button> element with an aria-label attribute

Expected values to be strictly deep-equal:
+ actual - expected

  {
+   sources: [],
-   sources: [

[Survived] BooleanLiteral
packages/alfa-aria/src/name.ts:895:54
         fromNode(
           element,
           device,
-          state.reference(referrer, element).recurse(true).descend(false),
+          state.reference(referrer, element).recurse(false).descend(false),
         ),
       );

[Survived] BooleanLiteral
packages/alfa-aria/src/name.ts:895:68
         fromNode(
           element,
           device,
-          state.reference(referrer, element).recurse(true).descend(false),
+          state.reference(referrer, element).recurse(true).descend(true),
         ),
       );

[Killed] ArrowFunction
packages/alfa-aria/src/name.ts:899:36
         ),
       );
 
-    const name = flatten(names.map((name) => name.value).join(" "));
+    const name = flatten(names.map(() => undefined).join(" "));
 
     if (name === "") {
killedBy: All tests
statusReason: packages/alfa-aria/test/name.spec.js(128,7): .from() determines the name of a <button> element with an aria-labelledby attribute that points to a <p> element with child text content

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    sources: [
...

[Killed] ArrayDeclaration
packages/alfa-aria/src/name.ts:906:21
     }
 
     return Option.of(
-      Name.of(name, [
-        Source.reference(
-          attribute,
-          Name.of(
-            name,
-            names.flatMap((name) => Sequence.from(name.source)),
-          ),
-        ),
-      ]),
+      Name.of(name, []),
     );
   }
killedBy: All tests
statusReason: packages/alfa-aria/test/name.spec.js(128,7): .from() determines the name of a <button> element with an aria-labelledby attribute that points to a <p> element with child text content

Expected values to be strictly deep-equal:
+ actual - expected

  {
+   sources: [],
-   sources: [

[Killed] Regex
packages/alfa-aria/src/name.ts:944:25
 }
 
 function flatten(string: string): string {
-  return string.replace(/\s+/g, " ");
+  return string.replace(/\S+/g, " ");
 }
 
killedBy: All tests
statusReason: packages/alfa-aria/test/role.spec.js(98,7): .from() maps `<select>` to listboxes

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    attributes: [
...
