[Killed] BooleanLiteral
alfa-aria/src/node/container.ts:52:12
   }
 
   public isIgnored(): boolean {
-    return true;
+    return false;
   }
 
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r42/rule.spec.js(42,7): evaluates() skips through container nodes

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Survived] ArrayDeclaration
alfa-aria/src/node/container.ts:63:12
   }
 
   public toString(): string {
-    return [
-      "container",
-      ...this._children.map((child) => indent(child.toString())),
-    ].join("\n");
+    return [].join("\n");
   }
 }

[Survived] ArrowFunction
alfa-aria/src/node/container.ts:65:29
   public toString(): string {
     return [
       "container",
-      ...this._children.map((child) => indent(child.toString())),
+      ...this._children.map(() => undefined),
     ].join("\n");
   }

[Survived] StringLiteral
alfa-aria/src/node/container.ts:80:31
 }
 
 function indent(input: string): string {
-  return input.replace(/^/gm, "  ");
+  return input.replace(/^/gm, "");
 }
 
