[Killed] ConditionalExpression
alfa-aria/src/node/element.ts:79:26
     return Iterable.find(
       this._attributes,
       typeof predicate === "string"
-        ? (attribute) => attribute.name === predicate
+        ? (attribute) => false
         : predicate,
     );
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() correctly sets `aria-setsize` and `aria-posinset`
Error: Attempted to .getUnsafe() from None

[Killed] ConditionalExpression
alfa-aria/src/node/element.ts:79:26
     return Iterable.find(
       this._attributes,
       typeof predicate === "string"
-        ? (attribute) => attribute.name === predicate
+        ? (attribute) => true
         : predicate,
     );
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(426,11): .from() correctly sets `aria-setsize` and `aria-posinset`

Expected values to be strictly equal:

'4' !== '1'

[Killed] BooleanLiteral
alfa-aria/src/node/element.ts:95:12
   }
 
   public isIgnored(): boolean {
-    return false;
+    return true;
   }
 
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-dr18/rule.spec.js(13,7): evaluate() passes input with type password field and aria-required state

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     mode: 'automatic',

[Survived] ArrowFunction
alfa-aria/src/node/element.ts:110:24
   public toString(): string {
     return [
       [
-        this._role.map((role) => role.name).getOr("element"),
+        this._role.map(() => undefined).getOr("element"),
         ...this._name.map((name) => `"${name}"`),
       ].join(" "),

[Survived] ArrowFunction
alfa-aria/src/node/element.ts:111:27
     return [
       [
         this._role.map((role) => role.name).getOr("element"),
-        ...this._name.map((name) => `"${name}"`),
+        ...this._name.map(() => undefined),
       ].join(" "),
       ...this._children.map((child) => indent(child.toString())),

[Survived] StringLiteral
alfa-aria/src/node/element.ts:111:37
     return [
       [
         this._role.map((role) => role.name).getOr("element"),
-        ...this._name.map((name) => `"${name}"`),
+        ...this._name.map((name) => ``),
       ].join(" "),
       ...this._children.map((child) => indent(child.toString())),

[Survived] StringLiteral
alfa-aria/src/node/element.ts:112:14
       [
         this._role.map((role) => role.name).getOr("element"),
         ...this._name.map((name) => `"${name}"`),
-      ].join(" "),
+      ].join(""),
       ...this._children.map((child) => indent(child.toString())),
     ].join("\n");

[Survived] ArrowFunction
alfa-aria/src/node/element.ts:113:29
         this._role.map((role) => role.name).getOr("element"),
         ...this._name.map((name) => `"${name}"`),
       ].join(" "),
-      ...this._children.map((child) => indent(child.toString())),
+      ...this._children.map(() => undefined),
     ].join("\n");
   }
