[Survived] BooleanLiteral
src/node/predicate/has-attribute.ts:23:36
 
 export function hasAttribute(
   nameOrPredicate: Attribute.Name | Predicate<Attribute>,
-  value: Predicate<string> = () => true,
+  value: Predicate<string> = () => false,
 ): Predicate<Node> {
   if (typeof nameOrPredicate === "function") {

[Killed] EqualityOperator
src/node/predicate/has-attribute.ts:25:7
   nameOrPredicate: Attribute.Name | Predicate<Attribute>,
   value: Predicate<string> = () => true,
 ): Predicate<Node> {
-  if (typeof nameOrPredicate === "function") {
+  if (typeof nameOrPredicate !== "function") {
     return (node) => node.attribute(nameOrPredicate).isSome();
   }
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r16/rule.spec.js(53,7): evaluate() fails a <div> element with a role of combobox, aria-expanded value of true and missing aria-controls attribute

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Survived] MethodExpression
src/node/predicate/has-attribute.ts:32:20
   const name = nameOrPredicate;
   const predicate = property<Attribute, "value">("value", value);
 
-  return (node) => node.attribute(name).some(predicate);
+  return (node) => node.attribute(name).every(predicate);
 }
 
