[Survived] BooleanLiteral
src/node/predicate/has-name.ts:17:53
 export function hasName(name: string, ...rest: Array<string>): Predicate<Node>;
 
 export function hasName(
-  nameOrPredicate: Predicate<Name> | string = () => true,
+  nameOrPredicate: Predicate<Name> | string = () => false,
   ...names: Array<string>
 ): Predicate<Node> {

[Killed] MethodExpression
src/node/predicate/has-name.ts:25:20
       ? nameOrPredicate
       : Name.hasValue(nameOrPredicate, ...names);
 
-  return (node) => node.name.some(predicate);
+  return (node) => node.name.every(predicate);
 }
 
killedBy: All tests
statusReason: packages/alfa-aria/test/dom/predicate/has-incorrect-role-without-name.spec.js(18,7): hasIncorrectRoleWithoutName returns true for nameless `<section>`

Expected values to be strictly deep-equal:

false !== true
