[Survived] BooleanLiteral
src/node/predicate/has-role.ts:22:56
 ): Predicate<Node>;
 
 export function hasRole(
-  nameOrPredicate: Predicate<Role> | Role.Name = () => true,
+  nameOrPredicate: Predicate<Role> | Role.Name = () => false,
   ...names: Array<Role.Name>
 ): Predicate<Node> {

[Survived] MethodExpression
src/node/predicate/has-role.ts:33:20
     predicate = hasName(nameOrPredicate, ...names);
   }
 
-  return (node) => node.role.some(predicate);
+  return (node) => node.role.every(predicate);
 }
 
