[Survived] ArrowFunction
alfa-aria/src/node/text.ts:47:36
   }
 
   public toString(): string {
-    return `text "${this._name.map((name) => `${name}`).getOr("")}"`;
+    return `text "${this._name.map(() => undefined).getOr("")}"`;
   }
 }
