[Killed] ConditionalExpression
packages/alfa-aria/src/node.ts:78:9
   public parent(options: Node.Traversal = Node.Traversal.empty): Option<Node> {
     const parent = this._parent as Option<Node>;
 
-    if (options.has(Node.Traversal.ignored)) {
+    if (true) {
       return parent;
     }
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r42/rule.spec.js(42,7): evaluates() skips through container nodes

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Survived] BlockStatement
packages/alfa-aria/src/node.ts:78:46
   public parent(options: Node.Traversal = Node.Traversal.empty): Option<Node> {
     const parent = this._parent as Option<Node>;
 
-    if (options.has(Node.Traversal.ignored)) {
-      return parent;
-    }
+    if (options.has(Node.Traversal.ignored)) {}
 
     return parent.flatMap((parent) =>

[Survived] BlockStatement
packages/alfa-aria/src/node.ts:95:46
   ): Sequence<Node> {
     const children = Sequence.from(this._children) as Sequence<Node>;
 
-    if (options.has(Node.Traversal.ignored)) {
-      return children;
-    }
+    if (options.has(Node.Traversal.ignored)) {}
 
     return children.flatMap((child) =>

[Survived] ConditionalExpression
packages/alfa-aria/src/node.ts:95:9
   ): Sequence<Node> {
     const children = Sequence.from(this._children) as Sequence<Node>;
 
-    if (options.has(Node.Traversal.ignored)) {
+    if (false) {
       return children;
     }

[Survived] ConditionalExpression
packages/alfa-aria/src/node.ts:191:9
 
     // If the cache already holds an entry for the specified node, then the tree
     // that the node participates in has already been built.
-    if (_cache.has(node)) {
+    if (false) {
       // The previous test just ensures that there is something.
       return _cache.get(node).getUnsafe();

[Survived] BlockStatement
packages/alfa-aria/src/node.ts:191:27
 
     // If the cache already holds an entry for the specified node, then the tree
     // that the node participates in has already been built.
-    if (_cache.has(node)) {
-      // The previous test just ensures that there is something.
-      return _cache.get(node).getUnsafe();
-    }
+    if (_cache.has(node)) {}
 
     const root = node.root(dom.Node.flatTree);

[Survived] ConditionalExpression
packages/alfa-aria/src/node.ts:201:9
     // If the cache already holds an entry for the root of the specified node,
     // then the tree that the node participates in has already been built, but
     // the node itself is not included within the resulting accessibility tree.
-    if (_cache.has(root)) {
+    if (false) {
       return _cache.get(node, () => Inert.of(node));
     }

[Survived] BlockStatement
packages/alfa-aria/src/node.ts:201:27
     // If the cache already holds an entry for the root of the specified node,
     // then the tree that the node participates in has already been built, but
     // the node itself is not included within the resulting accessibility tree.
-    if (_cache.has(root)) {
-      return _cache.get(node, () => Inert.of(node));
-    }
+    if (_cache.has(root)) {}
 
     // Before we start constructing the accessibility tree, we need to resolve

[Killed] LogicalOperator
packages/alfa-aria/src/node.ts:252:13
         // deny anything but the first claim to a given ID.
         references = references.reject(
           (reference) =>
-            claimed.has(reference) || graph.hasPath(reference, element),
+            claimed.has(reference) && graph.hasPath(reference, element),
         );
 
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(186,7): .from() correctly handles circular aria-owns references between siblings

Expected values to be strictly deep-equal:
+ actual - expected

  {
+   node: '/div[1]/div[1]',
+   type: 'inert'

[Killed] ConditionalExpression
packages/alfa-aria/src/node.ts:252:13
         // deny anything but the first claim to a given ID.
         references = references.reject(
           (reference) =>
-            claimed.has(reference) || graph.hasPath(reference, element),
+            true,
         );
 
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(30,7): .from() gives precedence to aria-owns references

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    attributes: [
...

[Killed] ConditionalExpression
packages/alfa-aria/src/node.ts:257:13
 
         // If there are no references left, this element has no explicit
         // ownership.
-        if (references.isEmpty()) {
+        if (true) {
           return [claimed, owned, graph];
         }
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(30,7): .from() gives precedence to aria-owns references

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    attributes: [
...

[Survived] ConditionalExpression
packages/alfa-aria/src/node.ts:257:13
 
         // If there are no references left, this element has no explicit
         // ownership.
-        if (references.isEmpty()) {
+        if (false) {
           return [claimed, owned, graph];
         }

[Killed] BooleanLiteral
packages/alfa-aria/src/node.ts:293:46
   }
 
   class State {
-    private static _empty = new State(false, true);
+    private static _empty = new State(false, false);
 
     public static empty(): State {
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r78/rule.spec.js(31,7): evaluates() passes headings with content

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] BooleanLiteral
packages/alfa-aria/src/node.ts:293:39
   }
 
   class State {
-    private static _empty = new State(false, true);
+    private static _empty = new State(true, true);
 
     public static empty(): State {
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(11,7): .from() constructs an accessible node from an element

Expected values to be strictly deep-equal:
+ actual - expected

  {
+   children: [
+     {

[Killed] ConditionalExpression
packages/alfa-aria/src/node.ts:316:11
     }
 
     public presentational(isPresentational: boolean): State {
-      if (this._isPresentational === isPresentational) {
+      if (true) {
         return this;
       }
killedBy: All tests
statusReason: packages/alfa-aria/test/dom/predicate/has-role.spec.js(17,7): hasRole() respects presentational children

Expected values to be strictly deep-equal:

true !== false

[Killed] EqualityOperator
packages/alfa-aria/src/node.ts:316:11
     }
 
     public presentational(isPresentational: boolean): State {
-      if (this._isPresentational === isPresentational) {
+      if (this._isPresentational !== isPresentational) {
         return this;
       }
killedBy: All tests
statusReason: packages/alfa-aria/test/role.spec.js(12,7): .from() exposes implicitly required children of a presentational element with an inherited presentational role

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    children: [
      {

[Killed] EqualityOperator
packages/alfa-aria/src/node.ts:324:11
     }
 
     public visible(isVisible: boolean): State {
-      if (this._isVisible === isVisible) {
+      if (this._isVisible !== isVisible) {
         return this;
       }
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(387,7): .from() does not expose text nodes of a parent element with `visibility: hidden`

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    children: [
      {

[Killed] ConditionalExpression
packages/alfa-aria/src/node.ts:324:11
     }
 
     public visible(isVisible: boolean): State {
-      if (this._isVisible === isVisible) {
+      if (true) {
         return this;
       }
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(387,7): .from() does not expose text nodes of a parent element with `visibility: hidden`

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    children: [
      {

[Killed] MethodExpression
packages/alfa-aria/src/node.ts:355:11
         //
         // https://github.com/Siteimprove/alfa/issues/184#issuecomment-593878009
         if (
-          node
-            .attribute("aria-hidden")
-            .some((attribute) =>
-              attribute.enumerate("true", "false").some(equals("true")),
-            )
+          node.attribute("aria-hidden").every(attribute => attribute.enumerate("true", "false").some(equals("true")))
         ) {
           return Inert.of(node);
killedBy: All tests
statusReason: packages/alfa-aria/test/dom/predicate/has-accessible-name.spec.js(14,7): hasAccessibleName() checks presence of an accessible name

Expected values to be strictly deep-equal:

false !== true


packages/alfa-aria/test/node.spec.js(11,7): .from() constructs an accessible node from an element

[Killed] ConditionalExpression
packages/alfa-aria/src/node.ts:355:11
         //
         // https://github.com/Siteimprove/alfa/issues/184#issuecomment-593878009
         if (
-          node
-            .attribute("aria-hidden")
-            .some((attribute) =>
-              attribute.enumerate("true", "false").some(equals("true")),
-            )
+          false
         ) {
           return Inert.of(node);
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r14/rule.spec.js(67,7): evaluate() ignores non-perceivable text content

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Survived] MethodExpression
packages/alfa-aria/src/node.ts:358:15
           node
             .attribute("aria-hidden")
             .some((attribute) =>
-              attribute.enumerate("true", "false").some(equals("true")),
+              attribute.enumerate("true", "false").every(equals("true")),
             )
         ) {

[Killed] BlockStatement
packages/alfa-aria/src/node.ts:360:11
             .some((attribute) =>
               attribute.enumerate("true", "false").some(equals("true")),
             )
-        ) {
-          return Inert.of(node);
-        }
+        ) {}
 
         const style = Style.from(node, device);
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-er87/rule.spec.js(128,7): evaluate() fails a document whose first tabbable link is not included in the accessibility tree

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] BlockStatement
packages/alfa-aria/src/node.ts:377:50
         //
         // Since `isRendered` is cached, and evaluating it is needed for almost
         // all nodes in the DOM, this is inexpensive.
-        if (test(not(isRendered(device)), node)) {
-          return Inert.of(node);
-        }
+        if (test(not(isRendered(device)), node)) {}
 
         let children: (state: State) => Iterable<Node>;
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(270,7): .from() does not expose elements that are not rendered due to a DOM ancestor, but referred to by aria-owns

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    attributes: [
...

[Killed] ConditionalExpression
packages/alfa-aria/src/node.ts:377:13
         //
         // Since `isRendered` is cached, and evaluating it is needed for almost
         // all nodes in the DOM, this is inexpensive.
-        if (test(not(isRendered(device)), node)) {
+        if (false) {
           return Inert.of(node);
         }
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(270,7): .from() does not expose elements that are not rendered due to a DOM ancestor, but referred to by aria-owns

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    attributes: [
...

[Killed] ConditionalExpression
packages/alfa-aria/src/node.ts:394:30
         // explicitly owned by the element.
         const implicit = node
           .children(dom.Node.flatTree)
-          .reject((child) => claimed.has(child) || explicit.includes(child));
+          .reject((child) => false);
 
         // The children implicitly owned by the element come first, then the
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(130,7): .from() correctly handles reordered aria-owns references

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    attributes: [
...

[Killed] ConditionalExpression
packages/alfa-aria/src/node.ts:394:30
         // explicitly owned by the element.
         const implicit = node
           .children(dom.Node.flatTree)
-          .reject((child) => claimed.has(child) || explicit.includes(child));
+          .reject((child) => true);
 
         // The children implicitly owned by the element come first, then the
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(11,7): .from() constructs an accessible node from an element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    attributes: [],
+   children: [],

[Killed] BlockStatement
packages/alfa-aria/src/node.ts:409:69
         //
         // Since `visibility` is inherited, this correctly affects DOM descendants
         // even if `aria-owns` is used to rewrite the tree.
-        if (style.computed("visibility").value.value !== "visible") {
-          return Container.of(node, children(state.visible(false)));
-        }
+        if (style.computed("visibility").value.value !== "visible") {}
 
         state = state.visible(true);
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(387,7): .from() does not expose text nodes of a parent element with `visibility: hidden`

Expected values to be strictly deep-equal:
+ actual - expected

  {
    children: [
      {

[Killed] ConditionalExpression
packages/alfa-aria/src/node.ts:409:13
         //
         // Since `visibility` is inherited, this correctly affects DOM descendants
         // even if `aria-owns` is used to rewrite the tree.
-        if (style.computed("visibility").value.value !== "visible") {
+        if (false) {
           return Container.of(node, children(state.visible(false)));
         }
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(387,7): .from() does not expose text nodes of a parent element with `visibility: hidden`

Expected values to be strictly deep-equal:
+ actual - expected

  {
    children: [
      {

[Killed] BooleanLiteral
packages/alfa-aria/src/node.ts:410:60
         // Since `visibility` is inherited, this correctly affects DOM descendants
         // even if `aria-owns` is used to rewrite the tree.
         if (style.computed("visibility").value.value !== "visible") {
-          return Container.of(node, children(state.visible(false)));
+          return Container.of(node, children(state.visible(true)));
         }
 
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(387,7): .from() does not expose text nodes of a parent element with `visibility: hidden`

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    children: [
      {

[Killed] BooleanLiteral
packages/alfa-aria/src/node.ts:413:31
           return Container.of(node, children(state.visible(false)));
         }
 
-        state = state.visible(true);
+        state = state.visible(false);
 
         const role = Role.fromExplicit(node).orElse(() =>
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(11,7): .from() constructs an accessible node from an element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    attributes: [],
    children: [

[Killed] BlockStatement
packages/alfa-aria/src/node.ts:424:59
             : Role.fromImplicit(node),
         );
 
-        if (role.some((role) => role.isPresentational())) {
-          return Container.of(
-            node,
-            children(
-              state.presentational(
-                // If the implicit role of the presentational element has
-                // required children then any owned children must also be
-                // presentational.
-                Role.fromImplicit(node).some((role) =>
-                  role.hasRequiredChildren(),
-                ),
-              ),
-            ),
-          );
-        }
+        if (role.some((role) => role.isPresentational())) {}
 
         let attributes = Map.empty<Attribute.Name, Attribute>();
killedBy: All tests
statusReason: packages/alfa-aria/test/role.spec.js(12,7): .from() exposes implicitly required children of a presentational element with an inherited presentational role

Expected values to be strictly deep-equal:
+ actual - expected

  {
+   attributes: [],
+   children: [

[Survived] MethodExpression
packages/alfa-aria/src/node.ts:432:17
                 // If the implicit role of the presentational element has
                 // required children then any owned children must also be
                 // presentational.
-                Role.fromImplicit(node).some((role) =>
-                  role.hasRequiredChildren(),
-                ),
+                Role.fromImplicit(node).every(role => role.hasRequiredChildren()),
               ),
             ),

[Killed] BlockStatement
packages/alfa-aria/src/node.ts:443:28
         let attributes = Map.empty<Attribute.Name, Attribute>();
 
         // First pass: Look up implicit attributes on the role.
-        if (role.isSome()) {
-          for (const attribute of role.get().supportedAttributes) {
-            for (const value of role.get().implicitAttributeValue(attribute)) {
-              attributes = attributes.set(
-                attribute,
-                Attribute.of(attribute, value),
-              );
-            }
-          }
-        }
+        if (role.isSome()) {}
 
         // Second pass: Look up implicit attributes on the feature mapping.
killedBy: All tests
statusReason: packages/alfa-aria/test/role.spec.js(98,7): .from() maps `<select>` to listboxes

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
+   attributes: [],
-   attributes: [

[Killed] BlockStatement
packages/alfa-aria/src/node.ts:444:67
 
         // First pass: Look up implicit attributes on the role.
         if (role.isSome()) {
-          for (const attribute of role.get().supportedAttributes) {
-            for (const value of role.get().implicitAttributeValue(attribute)) {
-              attributes = attributes.set(
-                attribute,
-                Attribute.of(attribute, value),
-              );
-            }
-          }
+          for (const attribute of role.get().supportedAttributes) {}
         }
 
killedBy: All tests
statusReason: packages/alfa-aria/test/role.spec.js(98,7): .from() maps `<select>` to listboxes

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
+   attributes: [],
-   attributes: [

[Killed] BlockStatement
packages/alfa-aria/src/node.ts:445:79
         // First pass: Look up implicit attributes on the role.
         if (role.isSome()) {
           for (const attribute of role.get().supportedAttributes) {
-            for (const value of role.get().implicitAttributeValue(attribute)) {
-              attributes = attributes.set(
-                attribute,
-                Attribute.of(attribute, value),
-              );
-            }
+            for (const value of role.get().implicitAttributeValue(attribute)) {}
           }
         }
killedBy: All tests
statusReason: packages/alfa-aria/test/role.spec.js(98,7): .from() maps `<select>` to listboxes

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
+   attributes: [],
-   attributes: [

[Killed] BlockStatement
packages/alfa-aria/src/node.ts:455:49
         }
 
         // Second pass: Look up implicit attributes on the feature mapping.
-        for (const namespace of node.namespace) {
-          for (const feature of Feature.from(namespace, node.name)) {
-            for (const attribute of feature.attributes(node)) {
-              attributes = attributes.set(attribute.name, attribute);
-            }
-          }
-        }
+        for (const namespace of node.namespace) {}
 
         // Third pass: Look up explicit `aria-*` attributes and set the ones
killedBy: All tests
statusReason: packages/alfa-aria/test/role.spec.js(29,7): .from() doesn't inherit presentational roles into explicitly required children of a presentational element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    children: [
      {

[Killed] BlockStatement
packages/alfa-aria/src/node.ts:456:69
 
         // Second pass: Look up implicit attributes on the feature mapping.
         for (const namespace of node.namespace) {
-          for (const feature of Feature.from(namespace, node.name)) {
-            for (const attribute of feature.attributes(node)) {
-              attributes = attributes.set(attribute.name, attribute);
-            }
-          }
+          for (const feature of Feature.from(namespace, node.name)) {}
         }
 
killedBy: All tests
statusReason: packages/alfa-aria/test/role.spec.js(29,7): .from() doesn't inherit presentational roles into explicitly required children of a presentational element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    children: [
      {

[Killed] BlockStatement
packages/alfa-aria/src/node.ts:457:63
         // Second pass: Look up implicit attributes on the feature mapping.
         for (const namespace of node.namespace) {
           for (const feature of Feature.from(namespace, node.name)) {
-            for (const attribute of feature.attributes(node)) {
-              attributes = attributes.set(attribute.name, attribute);
-            }
+            for (const attribute of feature.attributes(node)) {}
           }
         }
killedBy: All tests
statusReason: packages/alfa-aria/test/role.spec.js(29,7): .from() doesn't inherit presentational roles into explicitly required children of a presentational element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    children: [
      {

[Killed] BlockStatement
packages/alfa-aria/src/node.ts:465:56
 
         // Third pass: Look up explicit `aria-*` attributes and set the ones
         // that are either global or supported by the role.
-        for (const { name, value } of node.attributes) {
-          if (Attribute.isName(name)) {
-            const attribute = Attribute.of(name, value);
-
-            if (
-              attribute.isGlobal() ||
-              role.some((role) => role.isAttributeSupported(attribute.name))
-            ) {
-              attributes = attributes.set(name, attribute);
-            }
-          }
-        }
+        for (const { name, value } of node.attributes) {}
 
         // If the element has neither attributes, a role (other than generic),
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(30,7): .from() gives precedence to aria-owns references

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
+   attributes: [],
-   attributes: [

[Killed] BlockStatement
packages/alfa-aria/src/node.ts:466:39
         // Third pass: Look up explicit `aria-*` attributes and set the ones
         // that are either global or supported by the role.
         for (const { name, value } of node.attributes) {
-          if (Attribute.isName(name)) {
-            const attribute = Attribute.of(name, value);
-
-            if (
-              attribute.isGlobal() ||
-              role.some((role) => role.isAttributeSupported(attribute.name))
-            ) {
-              attributes = attributes.set(name, attribute);
-            }
-          }
+          if (Attribute.isName(name)) {}
         }
 
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(30,7): .from() gives precedence to aria-owns references

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
+   attributes: [],
-   attributes: [

[Killed] LogicalOperator
packages/alfa-aria/src/node.ts:470:15
             const attribute = Attribute.of(name, value);
 
             if (
-              attribute.isGlobal() ||
-              role.some((role) => role.isAttributeSupported(attribute.name))
+              attribute.isGlobal() && role.some(role => role.isAttributeSupported(attribute.name))
             ) {
               attributes = attributes.set(name, attribute);
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r10/rule.spec.js(143,7): evaluates() is inapplicable on aria-disabled elements

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     expectations: [

[Survived] ConditionalExpression
packages/alfa-aria/src/node.ts:470:15
             const attribute = Attribute.of(name, value);
 
             if (
-              attribute.isGlobal() ||
-              role.some((role) => role.isAttributeSupported(attribute.name))
+              true
             ) {
               attributes = attributes.set(name, attribute);

[Survived] MethodExpression
packages/alfa-aria/src/node.ts:471:15
 
             if (
               attribute.isGlobal() ||
-              role.some((role) => role.isAttributeSupported(attribute.name))
+              role.every(role => role.isAttributeSupported(attribute.name))
             ) {
               attributes = attributes.set(name, attribute);

[Killed] BlockStatement
packages/alfa-aria/src/node.ts:472:15
             if (
               attribute.isGlobal() ||
               role.some((role) => role.isAttributeSupported(attribute.name))
-            ) {
-              attributes = attributes.set(name, attribute);
-            }
+            ) {}
           }
         }
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(30,7): .from() gives precedence to aria-owns references

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
+   attributes: [],
-   attributes: [

[Killed] ConditionalExpression
packages/alfa-aria/src/node.ts:483:11
         // purposes. It is therefore exposed as a container.
         // Some elements (mostly embedded content) are always exposed.
         if (
-          attributes.isEmpty() &&
-          role.every(Role.hasName("generic")) &&
-          node.tabIndex().isNone() &&
+          true &&
           !test(alwaysExpose, node)
         ) {
killedBy: All tests
statusReason: packages/alfa-aria/test/dom/predicate/has-accessible-name.spec.js(14,7): hasAccessibleName() checks presence of an accessible name

Expected values to be strictly deep-equal:

false !== true

[Killed] ConditionalExpression
packages/alfa-aria/src/node.ts:483:11
         // purposes. It is therefore exposed as a container.
         // Some elements (mostly embedded content) are always exposed.
         if (
-          attributes.isEmpty() &&
-          role.every(Role.hasName("generic")) &&
+          true &&
           node.tabIndex().isNone() &&
           !test(alwaysExpose, node)
killedBy: All tests
statusReason: packages/alfa-aria/test/role.spec.js(29,7): .from() doesn't inherit presentational roles into explicitly required children of a presentational element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    children: [
      {

[Killed] MethodExpression
packages/alfa-aria/src/node.ts:484:11
         // Some elements (mostly embedded content) are always exposed.
         if (
           attributes.isEmpty() &&
-          role.every(Role.hasName("generic")) &&
+          role.some(Role.hasName("generic")) &&
           node.tabIndex().isNone() &&
           !test(alwaysExpose, node)
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(432,7): .from() behaves when encountering an element with global properties where the element should not be named by its subtree

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    attributes: [
...

[Killed] BooleanLiteral
packages/alfa-aria/src/node.ts:486:11
           attributes.isEmpty() &&
           role.every(Role.hasName("generic")) &&
           node.tabIndex().isNone() &&
-          !test(alwaysExpose, node)
+          test(alwaysExpose, node)
         ) {
           return Container.of(node, children(state), role);
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(244,7): .from() correctly handles circular aria-owns references between ancestors and descendants

Expected values to be strictly deep-equal:
+ actual - expected

  {
+   attributes: [],
+   children: [

[Killed] BlockStatement
packages/alfa-aria/src/node.ts:487:11
           role.every(Role.hasName("generic")) &&
           node.tabIndex().isNone() &&
           !test(alwaysExpose, node)
-        ) {
-          return Container.of(node, children(state), role);
-        }
+        ) {}
 
         // If the element has a role that designates its children as
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(244,7): .from() correctly handles circular aria-owns references between ancestors and descendants

Expected values to be strictly deep-equal:
+ actual - expected

  {
+   attributes: [],
+   children: [
