[Killed] BlockStatement
packages/alfa-aria/src/node.ts:493:68
 
         // If the element has a role that designates its children as
         // presentational then set the state as presentational.
-        if (role.some((role) => role.hasPresentationalChildren())) {
-          state = state.presentational(true);
-        }
+        if (role.some((role) => role.hasPresentationalChildren())) {}
 
         return Element.of(
killedBy: All tests
statusReason: packages/alfa-aria/test/dom/predicate/has-role.spec.js(17,7): hasRole() respects presentational children

Expected values to be strictly deep-equal:

true !== false

[Killed] ConditionalExpression
packages/alfa-aria/src/node.ts:493:13
 
         // If the element has a role that designates its children as
         // presentational then set the state as presentational.
-        if (role.some((role) => role.hasPresentationalChildren())) {
+        if (true) {
           state = state.presentational(true);
         }
killedBy: All tests
statusReason: packages/alfa-aria/test/dom/predicate/has-incorrect-role-without-name.spec.js(36,7): hasIncorrectRoleWithoutName returns true for nameless `<aside>` scoped to sectioning element

Expected values to be strictly deep-equal:

false !== true

[Killed] BooleanLiteral
packages/alfa-aria/src/node.ts:494:40
         // If the element has a role that designates its children as
         // presentational then set the state as presentational.
         if (role.some((role) => role.hasPresentationalChildren())) {
-          state = state.presentational(true);
+          state = state.presentational(false);
         }
 
killedBy: All tests
statusReason: packages/alfa-aria/test/role.spec.js(77,7): .from() doesn't expose children of elements with roles that designate their children as presentational

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    attributes: [],
    children: [

[Killed] BlockStatement
packages/alfa-aria/src/node.ts:506:34
         );
       }
 
-      if (dom.Text.isText(node)) {
-        // As elements with `visibility: hidden` are exposed as containers for
-        // other elements that _might_ be visible, we need to check the
-        // visibility of the parent element before deciding to expose the text
-        // node. If the parent element isn't visible, the text node instead
-        // becomes inert.
-        if (!state.isVisible) {
-          return Inert.of(node);
-        }
-
-        return Text.of(node, Name.from(node, device));
-      }
+      if (dom.Text.isText(node)) {}
 
       return Container.of(
killedBy: All tests
statusReason: packages/alfa-aria/test/role.spec.js(98,7): .from() maps `<select>` to listboxes

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    attributes: [
...

[Killed] BlockStatement
packages/alfa-aria/src/node.ts:512:31
         // visibility of the parent element before deciding to expose the text
         // node. If the parent element isn't visible, the text node instead
         // becomes inert.
-        if (!state.isVisible) {
-          return Inert.of(node);
-        }
+        if (!state.isVisible) {}
 
         return Text.of(node, Name.from(node, device));
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(387,7): .from() does not expose text nodes of a parent element with `visibility: hidden`

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    children: [
      {

[Killed] ConditionalExpression
packages/alfa-aria/src/node.ts:512:13
         // visibility of the parent element before deciding to expose the text
         // node. If the parent element isn't visible, the text node instead
         // becomes inert.
-        if (!state.isVisible) {
+        if (false) {
           return Inert.of(node);
         }
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(387,7): .from() does not expose text nodes of a parent element with `visibility: hidden`

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    children: [
      {

[Killed] EqualityOperator
packages/alfa-aria/src/node.ts:539:46
 // <object> with a non-empty data attribute
 const alwaysExpose = and(
   dom.Element.hasName("object"),
-  dom.Element.hasAttribute("data", (data) => data.trim() !== ""),
+  dom.Element.hasAttribute("data", (data) => data.trim() === ""),
 );
 
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r63/rule.spec.js(22,7): evaluate() passes an object with a non-empty name (title)

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     mode: 'automatic',

[Killed] ConditionalExpression
packages/alfa-aria/src/node.ts:539:46
 // <object> with a non-empty data attribute
 const alwaysExpose = and(
   dom.Element.hasName("object"),
-  dom.Element.hasAttribute("data", (data) => data.trim() !== ""),
+  dom.Element.hasAttribute("data", (data) => false),
 );
 
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r63/rule.spec.js(22,7): evaluate() passes an object with a non-empty name (title)

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     mode: 'automatic',
