[Killed] BlockStatement
src/role/predicate/has-name.ts:36:10
 
   if (typeof nameOrPredicate === "function") {
     predicate = nameOrPredicate;
-  } else {
-    predicate = equals(nameOrPredicate, ...names);
-  }
+  } else {}
 
   return (role) => predicate(role.name);
killedBy: All tests
statusReason: packages/alfa-aria/src/role/predicate/has-name.js(78,93): hasIncorrectRoleWithoutName returns true for nameless `<section>`
TypeError: predicate is not a function
