[Killed] ConditionalExpression
packages/alfa-aria/src/role.ts:139:12
    * Check if this role has the specified name.
    */
   public hasName<N extends Role.Name>(name: N): this is Role<N> {
-    return this._name === (name as Role.Name);
+    return true;
   }
 
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of a <button> element with child text content
Error: Attempted to .getUnsafe() from None

[Killed] ConditionalExpression
packages/alfa-aria/src/role.ts:139:12
    * Check if this role has the specified name.
    */
   public hasName<N extends Role.Name>(name: N): this is Role<N> {
-    return this._name === (name as Role.Name);
+    return false;
   }
 
killedBy: All tests
statusReason: packages/alfa-aria/test/role.spec.js(12,7): .from() exposes implicitly required children of a presentational element with an inherited presentational role

Expected values to be strictly deep-equal:
+ actual - expected

  {
+   attributes: [],
+   children: [

[Killed] BlockStatement
packages/alfa-aria/src/role.ts:150:37
   ): this is Role<Role.SuperclassOf<N>> {
     const { inherited } = Roles[name];
 
-    for (const parent of inherited) {
-      if (parent === this._name || this.isSuperclassOf(parent)) {
-        return true;
-      }
-    }
+    for (const parent of inherited) {}
 
     return false;
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-dr66/rule.spec.js(165,7): evaluate() is inapplicable to text nodes in disabled widgets

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     diagnostic: {

[Killed] ConditionalExpression
packages/alfa-aria/src/role.ts:151:11
     const { inherited } = Roles[name];
 
     for (const parent of inherited) {
-      if (parent === this._name || this.isSuperclassOf(parent)) {
+      if (true) {
         return true;
       }
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-er87/rule.spec.js(106,7): evaluate() fails a document whose first tabbable element is not a link

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     diagnostic: {

[Killed] BlockStatement
packages/alfa-aria/src/role.ts:151:65
     const { inherited } = Roles[name];
 
     for (const parent of inherited) {
-      if (parent === this._name || this.isSuperclassOf(parent)) {
-        return true;
-      }
+      if (parent === this._name || this.isSuperclassOf(parent)) {}
     }
 
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r11/rule.spec.js(34,7): evaluate() fails a "doc-biblioref" with no accessible name

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     mode: 'automatic',

[Killed] BooleanLiteral
packages/alfa-aria/src/role.ts:152:16
 
     for (const parent of inherited) {
       if (parent === this._name || this.isSuperclassOf(parent)) {
-        return true;
+        return false;
       }
     }
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-dr69/rule.spec.js(194,7): evaluate() is inapplicable to text nodes in disabled widgets

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     diagnostic: {

[Killed] LogicalOperator
packages/alfa-aria/src/role.ts:175:12
   public is<N extends Role.Name>(
     name: N,
   ): this is Role<N | Role.SubclassOf<N>> {
-    return this.hasName(name) || this.isSubclassOf(name);
+    return this.hasName(name) && this.isSubclassOf(name);
   }
 
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r11/rule.spec.js(13,7): evaluate() passes a link with a name given by content

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     mode: 'automatic',

[Killed] ConditionalExpression
packages/alfa-aria/src/role.ts:175:12
   public is<N extends Role.Name>(
     name: N,
   ): this is Role<N | Role.SubclassOf<N>> {
-    return this.hasName(name) || this.isSubclassOf(name);
+    return false;
   }
 
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-er87/rule.spec.js(18,7): evaluate() passes a document whose first tabbable link references an element with a role of main

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] BooleanLiteral
packages/alfa-aria/src/role.ts:189:12
    * Check if this role is non-abstract.
    */
   public isConcrete(): this is Role<Role.Concrete> {
-    return !this.isAbstract();
+    return this.isAbstract();
   }
 
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r110/rule.spec.js(13,7): evaluates() passes an element with a single valid role

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] ConditionalExpression
packages/alfa-aria/src/role.ts:196:12
    * Check if this role is presentational.
    */
   public isPresentational(): this is Role<Role.Presentational> {
-    return this.hasName("presentation") || this.hasName("none");
+    return true;
   }
 
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of a <button> element with child text content
Error: Attempted to .getUnsafe() from None

[Killed] ConditionalExpression
packages/alfa-aria/src/role.ts:196:12
    * Check if this role is presentational.
    */
   public isPresentational(): this is Role<Role.Presentational> {
-    return this.hasName("presentation") || this.hasName("none");
+    return false;
   }
 
killedBy: All tests
statusReason: packages/alfa-aria/test/role.spec.js(12,7): .from() exposes implicitly required children of a presentational element with an inherited presentational role

Expected values to be strictly deep-equal:
+ actual - expected

  {
+   attributes: [],
+   children: [

[Killed] BlockStatement
packages/alfa-aria/src/role.ts:217:54
    * Check if this role supports naming by the specified method.
    */
   public isNamedBy(method: Role.NamedBy): boolean {
-    for (const found of Roles[this._name].name.from) {
-      if (found === method) {
-        return true;
-      }
-    }
+    for (const found of Roles[this._name].name.from) {}
 
     return false;
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of a <button> element with child text content
Error: Attempted to .getUnsafe() from None

[Killed] EqualityOperator
packages/alfa-aria/src/role.ts:218:11
    */
   public isNamedBy(method: Role.NamedBy): boolean {
     for (const found of Roles[this._name].name.from) {
-      if (found === method) {
+      if (found !== method) {
         return true;
       }
killedBy: All tests
statusReason: packages/alfa-aria/test/role.spec.js(98,7): .from() maps `<select>` to listboxes

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    attributes: [
...

[Killed] BlockStatement
packages/alfa-aria/src/role.ts:218:29
    */
   public isNamedBy(method: Role.NamedBy): boolean {
     for (const found of Roles[this._name].name.from) {
-      if (found === method) {
-        return true;
-      }
+      if (found === method) {}
     }
 
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(11,7): .from() constructs an accessible node from an element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    attributes: [],
...

[Killed] BooleanLiteral
packages/alfa-aria/src/role.ts:219:16
   public isNamedBy(method: Role.NamedBy): boolean {
     for (const found of Roles[this._name].name.from) {
       if (found === method) {
-        return true;
+        return false;
       }
     }
killedBy: All tests
statusReason: packages/alfa-aria/test/node.spec.js(11,7): .from() constructs an accessible node from an element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    attributes: [],
...

[Killed] ConditionalExpression
packages/alfa-aria/src/role.ts:237:12
    * Check if this role has a required parent.
    */
   public hasRequiredParent(): boolean {
-    return Roles[this._name].parent.required.length > 0;
+    return true;
   }
 
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r42/rule.spec.js(13,7): evaluates() passes an implicit listitem inside a list

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
+   {
+     expectations: [

[Killed] ConditionalExpression
packages/alfa-aria/src/role.ts:237:12
    * Check if this role has a required parent.
    */
   public hasRequiredParent(): boolean {
-    return Roles[this._name].parent.required.length > 0;
+    return false;
   }
 
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r42/rule.spec.js(13,7): evaluates() passes an implicit listitem inside a list

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     mode: 'automatic',

[Killed] EqualityOperator
packages/alfa-aria/src/role.ts:251:12
    * Check if this role has required children.
    */
   public hasRequiredChildren(): boolean {
-    return Roles[this._name].children.required.length > 0;
+    return Roles[this._name].children.required.length <= 0;
   }
 
killedBy: All tests
statusReason: packages/alfa-aria/test/role.spec.js(12,7): .from() exposes implicitly required children of a presentational element with an inherited presentational role

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    children: [
      {

[Killed] ConditionalExpression
packages/alfa-aria/src/role.ts:251:12
    * Check if this role has required children.
    */
   public hasRequiredChildren(): boolean {
-    return Roles[this._name].children.required.length > 0;
+    return true;
   }
 
killedBy: All tests
statusReason: packages/alfa-aria/test/role.spec.js(51,7): .from() doesn't inherit presentational roles into children of implicitly required children of a presentational element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    children: [
      {

[Killed] BlockStatement
packages/alfa-aria/src/role.ts:281:50
   public implicitAttributeValue(name: Attribute.Name): Option<string> {
     const { inherited, attributes } = Roles[this._name];
 
-    for (const [found, { value }] of attributes) {
-      if (name === found && value !== null) {
-        return Option.from(value);
-      }
-    }
+    for (const [found, { value }] of attributes) {}
 
     for (const parent of inherited) {
killedBy: All tests
statusReason: packages/alfa-aria/test/role.spec.js(98,7): .from() maps `<select>` to listboxes

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
+   attributes: [],
-   attributes: [

[Killed] BlockStatement
packages/alfa-aria/src/role.ts:282:45
     const { inherited, attributes } = Roles[this._name];
 
     for (const [found, { value }] of attributes) {
-      if (name === found && value !== null) {
-        return Option.from(value);
-      }
+      if (name === found && value !== null) {}
     }
 
killedBy: All tests
statusReason: packages/alfa-aria/test/role.spec.js(98,7): .from() maps `<select>` to listboxes

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
+   attributes: [],
-   attributes: [

[Killed] ConditionalExpression
packages/alfa-aria/src/role.ts:282:11
     const { inherited, attributes } = Roles[this._name];
 
     for (const [found, { value }] of attributes) {
-      if (name === found && value !== null) {
+      if (false) {
         return Option.from(value);
       }
killedBy: All tests
statusReason: packages/alfa-aria/test/role.spec.js(98,7): .from() maps `<select>` to listboxes

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
+   attributes: [],
-   attributes: [

[Survived] BlockStatement
packages/alfa-aria/src/role.ts:287:37
       }
     }
 
-    for (const parent of inherited) {
-      for (const value of Role.of(parent).implicitAttributeValue(name)) {
-        return Option.of(value);
-      }
-    }
+    for (const parent of inherited) {}
 
     return None;

[Survived] BlockStatement
packages/alfa-aria/src/role.ts:288:73
     }
 
     for (const parent of inherited) {
-      for (const value of Role.of(parent).implicitAttributeValue(name)) {
-        return Option.of(value);
-      }
+      for (const value of Role.of(parent).implicitAttributeValue(name)) {}
     }
 

[Killed] ConditionalExpression
packages/alfa-aria/src/role.ts:297:37
   }
 
   public equals(value: unknown): value is this {
-    return value instanceof Role && value._name === this._name;
+    return value instanceof Role && true;
   }
 
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r16/rule.spec.js(14,7): evaluate() passes a <div> element with a role of checkbox and an aria-checked attribute

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     mode: 'automatic',

[Killed] ConditionalExpression
packages/alfa-aria/src/role.ts:297:12
   }
 
   public equals(value: unknown): value is this {
-    return value instanceof Role && value._name === this._name;
+    return false;
   }
 
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r16/rule.spec.js(92,7): evaluate() is inapplicable to elements with same explicit and implicit role

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     expectations: [

[Survived] BlockStatement
packages/alfa-aria/src/role.ts:300:33
     return value instanceof Role && value._name === this._name;
   }
 
-  public hash(hash: Hash): void {
-    hash.writeString(this._name);
-  }
+  public hash(hash: Hash): void {}
 
   public toJSON(): Role.JSON {

[Survived] LogicalOperator
packages/alfa-aria/src/role.ts:396:38
     value: unknown,
     name?: N,
   ): value is Role<Name> {
-    return value instanceof Role && (name === undefined || value.name === name);
+    return value instanceof Role && (name === undefined && value.name === name);
   }
 

[Survived] ConditionalExpression
packages/alfa-aria/src/role.ts:396:12
     value: unknown,
     name?: N,
   ): value is Role<Name> {
-    return value instanceof Role && (name === undefined || value.name === name);
+    return false;
   }
 

[Killed] MethodExpression
packages/alfa-aria/src/role.ts:418:24
 
     return (
       roles
-        .map((role) => role.toLowerCase())
+        .map((role) => role.toUpperCase())
         .filter(isName)
         .map(Role.of)
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of a <div> element with a role of button and with child text content
Error: Attempted to .getUnsafe() from None

[Killed] BooleanLiteral
packages/alfa-aria/src/role.ts:429:46
         // If the element is not allowed to be presentational, reject all
         // presentational roles.
         .reject((role) =>
-          isAllowedPresentational(element) ? false : role.isPresentational(),
+          isAllowedPresentational(element) ? true : role.isPresentational(),
         )
 
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of a <div> element with a role of button and with child text content
Error: Attempted to .getUnsafe() from None

[Killed] MethodExpression
packages/alfa-aria/src/role.ts:464:3
  * Check if an element has one or more global `aria-*` attributes.
  */
 const hasGlobalAttributes: Predicate<Element> = (element) =>
-  Iterable.some(Role.of("roletype").supportedAttributes, (attribute) =>
-    element.attribute(attribute).isSome(),
-  );
+  Iterable.every(Role.of("roletype").supportedAttributes, attribute => element.attribute(attribute).isSome());
 
 /**
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of a <img> element with a an empty alt attribute and an aria-label attribute
Error: Attempted to .getUnsafe() from None
