[Killed] UnaryOperator
packages/alfa-bits/src/bits.ts:14:19
   }
 
   export function clear(bits: number, i: number): number {
-    return bits & ~bit(i);
+    return bits & bit(i);
   }
 
killedBy: All tests
statusReason: packages/alfa-map/test/map.spec.js(59,7): #distinct() removes duplicate values from a map

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    [
...

[Killed] ConditionalExpression
packages/alfa-bits/src/bits.ts:18:12
   }
 
   export function test(bits: number, i: number): boolean {
-    return (bits & bit(i)) !== 0;
+    return true;
   }
 
killedBy: All tests
statusReason: packages/alfa-map/src/node.js(219,65): Name test case 539
TypeError: Cannot read properties of undefined (reading 'set')

[Killed] EqualityOperator
packages/alfa-bits/src/bits.ts:18:12
   }
 
   export function test(bits: number, i: number): boolean {
-    return (bits & bit(i)) !== 0;
+    return (bits & bit(i)) === 0;
   }
 
killedBy: All tests
statusReason: packages/alfa-map/src/node.js(219,65): hasAccessibleName() checks presence of an accessible name
TypeError: Cannot read properties of undefined (reading 'set')

[Killed] ArithmeticOperator
packages/alfa-bits/src/bits.ts:22:20
   }
 
   export function take(bits: number, n: number): number {
-    return bits & ((1 << n) - 1);
+    return bits & ((1 << n) + 1);
   }
 
killedBy: All tests
statusReason: packages/alfa-css/test/calculation/calculation.spec.js(23,5): .parse() parses an addition expression of percentages

false == true



file:///home/rcj/repos/alfa/.stryker-tmp/sandbox9251766/node_modules/execa/lib/error.js:60
		error = new Error(message);

[Killed] AssignmentOperator
packages/alfa-bits/src/bits.ts:38:5
    * {@link https://en.wikipedia.org/wiki/Hamming_weight}
    */
   export function popCount(bits: number): number {
-    bits -= (bits >> 1) & 0x55555555;
+    bits += bits >> 1 & 0x55555555;
     bits = (bits & 0x33333333) + ((bits >> 2) & 0x33333333);
     bits = (bits + (bits >> 4)) & 0x0f0f0f0f;
killedBy: All tests
statusReason: packages/alfa-map/src/node.js(219,65): .from() exposes implicitly required children of a presentational element with an inherited presentational role
TypeError: Cannot read properties of undefined (reading 'set')

[Killed] ArithmeticOperator
packages/alfa-bits/src/bits.ts:39:12
    */
   export function popCount(bits: number): number {
     bits -= (bits >> 1) & 0x55555555;
-    bits = (bits & 0x33333333) + ((bits >> 2) & 0x33333333);
+    bits = (bits & 0x33333333) - (bits >> 2 & 0x33333333);
     bits = (bits + (bits >> 4)) & 0x0f0f0f0f;
     bits += bits >> 8;
killedBy: All tests
statusReason: packages/alfa-map/src/node.js(219,65): hasIncorrectRoleWithoutName returns true for nameless `<section>`
TypeError: Cannot read properties of undefined (reading 'set')

[Killed] ArithmeticOperator
packages/alfa-bits/src/bits.ts:40:13
   export function popCount(bits: number): number {
     bits -= (bits >> 1) & 0x55555555;
     bits = (bits & 0x33333333) + ((bits >> 2) & 0x33333333);
-    bits = (bits + (bits >> 4)) & 0x0f0f0f0f;
+    bits = (bits - (bits >> 4)) & 0x0f0f0f0f;
     bits += bits >> 8;
     bits += bits >> 16;
killedBy: All tests
statusReason: packages/alfa-map/src/node.js(280,13): .from() exposes implicitly required children of a presentational element with an inherited presentational role
TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] AssignmentOperator
packages/alfa-bits/src/bits.ts:41:5
     bits -= (bits >> 1) & 0x55555555;
     bits = (bits & 0x33333333) + ((bits >> 2) & 0x33333333);
     bits = (bits + (bits >> 4)) & 0x0f0f0f0f;
-    bits += bits >> 8;
+    bits -= bits >> 8;
     bits += bits >> 16;
     return bits & 0x7f;
killedBy: All tests
statusReason: packages/alfa-map/src/node.js(280,13): .from() determines the name of a <button> element with child text content
TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] AssignmentOperator
packages/alfa-bits/src/bits.ts:42:5
     bits = (bits & 0x33333333) + ((bits >> 2) & 0x33333333);
     bits = (bits + (bits >> 4)) & 0x0f0f0f0f;
     bits += bits >> 8;
-    bits += bits >> 16;
+    bits -= bits >> 16;
     return bits & 0x7f;
   }
killedBy: All tests
statusReason: packages/alfa-map/src/node.js(280,13): .from() constructs an accessible node from an element
TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))
