[Killed] EqualityOperator
packages/alfa-branched/src/branched.ts:30:11
       List.of(
         Value.of(
           value,
-          branches.length === 0 ? None : Some.of(List.from(branches)),
+          branches.length !== 0 ? None : Some.of(List.from(branches)),
         ),
       ),
killedBy: All tests
statusReason: packages/alfa-branched/test/branched.spec.js(9,7): #map() applies a function to a branched value

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    [
      2,

[Killed] ConditionalExpression
packages/alfa-branched/src/branched.ts:30:11
       List.of(
         Value.of(
           value,
-          branches.length === 0 ? None : Some.of(List.from(branches)),
+          false ? None : Some.of(List.from(branches)),
         ),
       ),
killedBy: All tests
statusReason: packages/alfa-branched/test/branched.spec.js(30,7): #flatMap() flattens a branched value of both branchless and branched values

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
-   [
-     3,

[Survived] BooleanLiteral
packages/alfa-branched/src/branched.ts:47:12
   }
 
   public isEmpty(): this is Branched<never, B> {
-    return false;
+    return true;
   }
 

[Survived] BlockStatement
packages/alfa-branched/src/branched.ts:50:68
     return false;
   }
 
-  public forEach(callback: Callback<T, void, [Iterable<B>]>): void {
-    this._values.forEach(({ value, branches }) =>
-      callback(
-        value,
-        branches.getOrElse(() => List.empty()),
-      ),
-    );
-  }
+  public forEach(callback: Callback<T, void, [Iterable<B>]>): void {}
 
   public map<U>(mapper: Mapper<T, U, [Iterable<B>]>): Branched<U, B> {

[Survived] ArrowFunction
packages/alfa-branched/src/branched.ts:51:26
   }
 
   public forEach(callback: Callback<T, void, [Iterable<B>]>): void {
-    this._values.forEach(({ value, branches }) =>
-      callback(
-        value,
-        branches.getOrElse(() => List.empty()),
-      ),
+    this._values.forEach(() => undefined,
     );
   }

[Killed] ConditionalExpression
packages/alfa-branched/src/branched.ts:90:17
             value,
             scope.getOrElse(() => List.empty()),
           )._values.reduce((values, { value, branches }) => {
-            if (scope.isNone() && branches.isSome()) {
+            if (false) {
               branches = unused(branches, this._values);
             } else {
killedBy: All tests
statusReason: packages/alfa-branched/test/branched.spec.js(30,7): #flatMap() flattens a branched value of both branchless and branched values

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    [
+     5,

[Killed] ConditionalExpression
packages/alfa-branched/src/branched.ts:90:17
             value,
             scope.getOrElse(() => List.empty()),
           )._values.reduce((values, { value, branches }) => {
-            if (scope.isNone() && branches.isSome()) {
+            if (true) {
               branches = unused(branches, this._values);
             } else {
killedBy: All tests
statusReason: packages/alfa-branched/test/branched.spec.js(22,7): #flatMap() applies a function to a branched value and flattens the result

Expected values to be strictly deep-equal:
+ actual - expected

  [
    [
+     16,

[Killed] BlockStatement
packages/alfa-branched/src/branched.ts:92:20
           )._values.reduce((values, { value, branches }) => {
             if (scope.isNone() && branches.isSome()) {
               branches = unused(branches, this._values);
-            } else {
-              branches = narrow(branches, scope);
-            }
+            } else {}
 
             return merge(values, value, branches);
killedBy: All tests
statusReason: packages/alfa-branched/test/branched.spec.js(22,7): #flatMap() applies a function to a branched value and flattens the result

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    [
+     4,

[Survived] MethodExpression
packages/alfa-branched/src/branched.ts:127:7
 
   public filter(predicate: Predicate<T, [Iterable<B>]>): Branched<T, B> {
     return new Branched(
-      this._values.filter(({ value, branches }) =>
-        predicate(
-          value,
-          branches.getOrElse(() => List.empty()),
-        ),
-      ),
+      this._values,
     );
   }

[Survived] MethodExpression
packages/alfa-branched/src/branched.ts:143:12
   public reject(predicate: Predicate<T, [Iterable<B>]>): Branched<T, B>;
 
   public reject(predicate: Predicate<T, [Iterable<B>]>): Branched<T, B> {
-    return this.filter(not(predicate));
+    return this;
   }
 

[Survived] MethodExpression
packages/alfa-branched/src/branched.ts:164:12
   }
 
   public includes(value: T): boolean {
-    return this._values.some(({ value: found }) =>
-      Equatable.equals(value, found),
-    );
+    return this._values.every(({
+  value: found
+}) => Equatable.equals(value, found));
   }
 

[Survived] BlockStatement
packages/alfa-branched/src/branched.ts:198:39
   }
 
   public some(predicate: Predicate<T, [Iterable<B>]>): boolean {
-    for (const value of this._values) {
-      if (
-        predicate(
-          value.value,
-          value.branches.getOrElse(() => List.empty()),
-        )
-      ) {
-        return true;
-      }
-    }
+    for (const value of this._values) {}
 
     return false;

[Survived] ConditionalExpression
packages/alfa-branched/src/branched.ts:200:9
   public some(predicate: Predicate<T, [Iterable<B>]>): boolean {
     for (const value of this._values) {
       if (
-        predicate(
-          value.value,
-          value.branches.getOrElse(() => List.empty()),
-        )
+        true
       ) {
         return true;

[Survived] ConditionalExpression
packages/alfa-branched/src/branched.ts:200:9
   public some(predicate: Predicate<T, [Iterable<B>]>): boolean {
     for (const value of this._values) {
       if (
-        predicate(
-          value.value,
-          value.branches.getOrElse(() => List.empty()),
-        )
+        false
       ) {
         return true;

[Survived] BlockStatement
packages/alfa-branched/src/branched.ts:204:9
           value.value,
           value.branches.getOrElse(() => List.empty()),
         )
-      ) {
-        return true;
-      }
+      ) {}
     }
 

[Survived] MethodExpression
packages/alfa-branched/src/branched.ts:213:12
   }
 
   public none(predicate: Predicate<T, [Iterable<B>]>): boolean {
-    return this.every(not(predicate));
+    return this.some(not(predicate));
   }
 

[Survived] BlockStatement
packages/alfa-branched/src/branched.ts:217:39
   }
 
   public every(predicate: Predicate<T, [Iterable<B>]>): boolean {
-    for (const value of this._values) {
-      if (
-        !predicate(
-          value.value,
-          value.branches.getOrElse(() => List.empty()),
-        )
-      ) {
-        return false;
-      }
-    }
+    for (const value of this._values) {}
 
     return true;

[Survived] ConditionalExpression
packages/alfa-branched/src/branched.ts:219:9
   public every(predicate: Predicate<T, [Iterable<B>]>): boolean {
     for (const value of this._values) {
       if (
-        !predicate(
-          value.value,
-          value.branches.getOrElse(() => List.empty()),
-        )
+        false
       ) {
         return false;

[Survived] BooleanLiteral
packages/alfa-branched/src/branched.ts:219:9
   public every(predicate: Predicate<T, [Iterable<B>]>): boolean {
     for (const value of this._values) {
       if (
-        !predicate(
-          value.value,
-          value.branches.getOrElse(() => List.empty()),
-        )
+        predicate(value.value, value.branches.getOrElse(() => List.empty()))
       ) {
         return false;

[Survived] BlockStatement
packages/alfa-branched/src/branched.ts:223:9
           value.value,
           value.branches.getOrElse(() => List.empty()),
         )
-      ) {
-        return false;
-      }
+      ) {}
     }
 

[Survived] BooleanLiteral
packages/alfa-branched/src/branched.ts:224:16
           value.branches.getOrElse(() => List.empty()),
         )
       ) {
-        return false;
+        return true;
       }
     }

[Survived] ArithmeticOperator
packages/alfa-branched/src/branched.ts:234:38
   public count(predicate: Predicate<T, [Iterable<B>]>): number {
     return this.reduce(
       (count, value, branches) =>
-        predicate(value, branches) ? count + 1 : count,
+        predicate(value, branches) ? count - 1 : count,
       0,
     );

[Killed] ConditionalExpression
packages/alfa-branched/src/branched.ts:271:12
   public equals(value: unknown): value is this;
 
   public equals(value: unknown): boolean {
-    return value instanceof Branched && value._values.equals(this._values);
+    return false;
   }
 
killedBy: All tests
statusReason: packages/alfa-branched/test/branched.spec.js(84,7): #equals() returns true if two branched values are equal

Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
packages/alfa-branched/src/branched.ts:271:12
   public equals(value: unknown): value is this;
 
   public equals(value: unknown): boolean {
-    return value instanceof Branched && value._values.equals(this._values);
+    return true;
   }
 
killedBy: All tests
statusReason: packages/alfa-branched/test/branched.spec.js(89,7): #equals() returns false if two branched values are not equal

Expected values to be strictly equal:

true !== false

[Survived] BlockStatement
packages/alfa-branched/src/branched.ts:274:33
     return value instanceof Branched && value._values.equals(this._values);
   }
 
-  public hash(hash: Hash): void {
-    hash.writeHashable(this._values);
-  }
+  public hash(hash: Hash): void {}
 
   public *[Symbol.iterator](): Iterator<[T, Iterable<B>]> {

[Survived] BlockStatement
packages/alfa-branched/src/branched.ts:278:59
     hash.writeHashable(this._values);
   }
 
-  public *[Symbol.iterator](): Iterator<[T, Iterable<B>]> {
-    for (const value of this._values) {
-      yield [value.value, value.branches.getOrElse(() => List.empty())];
-    }
-  }
+  public *[Symbol.iterator](): Iterator<[T, Iterable<B>]> {}
 
   public toArray(): Array<[T, Array<B>]> {

[Survived] BlockStatement
packages/alfa-branched/src/branched.ts:279:39
   }
 
   public *[Symbol.iterator](): Iterator<[T, Iterable<B>]> {
-    for (const value of this._values) {
-      yield [value.value, value.branches.getOrElse(() => List.empty())];
-    }
+    for (const value of this._values) {}
   }
 

[Survived] BlockStatement
packages/alfa-branched/src/branched.ts:320:35
   export function from<T, B = never>(
     values: Iterable<readonly [T, Iterable<B>]>,
   ): Branched<T, B> {
-    if (isBranched<T, B>(values)) {
-      return values;
-    }
+    if (isBranched<T, B>(values)) {}
 
     const [[value, branches], ...rest] = values;

[Killed] ConditionalExpression
packages/alfa-branched/src/branched.ts:379:7
 
   public equals(value: unknown): value is this {
     return (
-      value instanceof Value &&
-      Equatable.equals(value._value, this._value) &&
-      Equatable.equals(value._branches, this._branches)
+      true
     );
   }
killedBy: All tests
statusReason: packages/alfa-branched/test/branched.spec.js(89,7): #equals() returns false if two branched values are not equal

Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
packages/alfa-branched/src/branched.ts:379:7
 
   public equals(value: unknown): value is this {
     return (
-      value instanceof Value &&
-      Equatable.equals(value._value, this._value) &&
-      Equatable.equals(value._branches, this._branches)
+      false
     );
   }
killedBy: All tests
statusReason: packages/alfa-branched/test/branched.spec.js(84,7): #equals() returns true if two branched values are equal

Expected values to be strictly equal:

false !== true

[Survived] BlockStatement
packages/alfa-branched/src/branched.ts:385:33
     );
   }
 
-  public hash(hash: Hash): void {
-    hash.writeUnknown(this._value).writeHashable(this._branches);
-  }
+  public hash(hash: Hash): void {}
 }
 

[Killed] ConditionalExpression
packages/alfa-branched/src/branched.ts:395:7
   value: T,
   branches: Option<List<B>>,
 ): List<Value<T, B>> {
-  if (values.size === 0) {
+  if (true) {
     return List.of(Value.of(value, branches));
   }
killedBy: All tests
statusReason: packages/alfa-branched/test/branched.spec.js(9,7): #map() applies a function to a branched value

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
-   [
-     2,

[Killed] EqualityOperator
packages/alfa-branched/src/branched.ts:395:7
   value: T,
   branches: Option<List<B>>,
 ): List<Value<T, B>> {
-  if (values.size === 0) {
+  if (values.size !== 0) {
     return List.of(Value.of(value, branches));
   }
killedBy: All tests
statusReason: packages/alfa-branched/test/branched.spec.js(9,7): #map() applies a function to a branched value

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
-   [
-     2,

[Killed] ConditionalExpression
packages/alfa-branched/src/branched.ts:417:9
   branches: Option<List<B>>,
 ): List<Value<T, B>> {
   return values.reduce((values, existing) => {
-    if (Equatable.equals(existing.value, value)) {
+    if (true) {
       return values;
     }
killedBy: All tests
statusReason: packages/alfa-branched/test/branched.spec.js(9,7): #map() applies a function to a branched value

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
-   [
-     2,

[Survived] ConditionalExpression
packages/alfa-branched/src/branched.ts:417:9
   branches: Option<List<B>>,
 ): List<Value<T, B>> {
   return values.reduce((values, existing) => {
-    if (Equatable.equals(existing.value, value)) {
+    if (false) {
       return values;
     }

[Killed] BlockStatement
packages/alfa-branched/src/branched.ts:421:37
       return values;
     }
 
-    if (existing.branches.isNone()) {
-      return branches.isNone() ? values : values.append(existing);
-    }
+    if (existing.branches.isNone()) {}
 
     return existing.branches.reduce((values, existingBranches) => {
killedBy: All tests
statusReason: packages/alfa-branched/test/branched.spec.js(30,7): #flatMap() flattens a branched value of both branchless and branched values

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
-   [
-     3,

[Killed] ConditionalExpression
packages/alfa-branched/src/branched.ts:421:9
       return values;
     }
 
-    if (existing.branches.isNone()) {
+    if (false) {
       return branches.isNone() ? values : values.append(existing);
     }
killedBy: All tests
statusReason: packages/alfa-branched/test/branched.spec.js(30,7): #flatMap() flattens a branched value of both branchless and branched values

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
-   [
-     3,

[Killed] ConditionalExpression
packages/alfa-branched/src/branched.ts:431:11
         existingBranches,
       );
 
-      if (deduplicated.size === 0) {
+      if (false) {
         return values;
       }
killedBy: All tests
statusReason: packages/alfa-branched/test/branched.spec.js(22,7): #flatMap() applies a function to a branched value and flattens the result

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    [
...

[Killed] BlockStatement
packages/alfa-branched/src/branched.ts:431:36
         existingBranches,
       );
 
-      if (deduplicated.size === 0) {
-        return values;
-      }
+      if (deduplicated.size === 0) {}
 
       return values.append(Value.of(existing.value, Some.of(deduplicated)));
killedBy: All tests
statusReason: packages/alfa-branched/test/branched.spec.js(22,7): #flatMap() applies a function to a branched value and flattens the result

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    [
...
