[Killed] BlockStatement
packages/alfa-cache/src/cache.ts:25:33
     key: K,
     ifMissing?: Mapper<this, U>,
   ): V | Option<V> {
-    if (this._storage.has(key)) {
-      const value = this._storage.get(key)!;
-
-      if (ifMissing === undefined) {
-        return Option.of(value);
-      }
-
-      return value;
-    }
+    if (this._storage.has(key)) {}
 
     if (ifMissing === undefined) {
killedBy: All tests
statusReason: packages/alfa-cache/test/cache.spec.js(15,7): get() returns some when getting a value that does exist

Expected values to be strictly deep-equal:
+ actual - expected

+ None {}
- Some {
-   _value: 1

[Killed] ConditionalExpression
packages/alfa-cache/src/cache.ts:25:9
     key: K,
     ifMissing?: Mapper<this, U>,
   ): V | Option<V> {
-    if (this._storage.has(key)) {
+    if (false) {
       const value = this._storage.get(key)!;
 
killedBy: All tests
statusReason: packages/alfa-cache/test/cache.spec.js(15,7): get() returns some when getting a value that does exist

Expected values to be strictly deep-equal:
+ actual - expected

+ None {}
- Some {
-   _value: 1

[Killed] ConditionalExpression
packages/alfa-cache/src/cache.ts:28:11
     if (this._storage.has(key)) {
       const value = this._storage.get(key)!;
 
-      if (ifMissing === undefined) {
+      if (false) {
         return Option.of(value);
       }
killedBy: All tests
statusReason: packages/alfa-cache/test/cache.spec.js(15,7): get() returns some when getting a value that does exist

Expected values to be strictly deep-equal:
+ actual - expected

+ 1
- Some {
-   _value: 1

[Killed] ConditionalExpression
packages/alfa-cache/src/cache.ts:28:11
     if (this._storage.has(key)) {
       const value = this._storage.get(key)!;
 
-      if (ifMissing === undefined) {
+      if (true) {
         return Option.of(value);
       }
killedBy: All tests
statusReason: packages/alfa-aria/test/name.spec.js(12,42): .from() determines the name of a <button> element with child text content
TypeError: src_1.Name.from(...).getUnsafe is not a function
