[Killed] BlockStatement
packages/alfa-array/src/array.ts:58:28
    * along existing arrays as-is instead of returning a copy.
    */
   export function from<T>(iterable: Iterable<T>): Array<T> {
-    if (isArray(iterable)) {
-      return iterable;
-    }
+    if (isArray(iterable)) {}
 
     return [...iterable];
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(9,7): #from() returns the same instance if the array is already an array

Values have same structure but are not reference-equal:

[
  1,
  2,
  3

[Killed] ConditionalExpression
packages/alfa-array/src/array.ts:70:12
   }
 
   export function isEmpty<T>(array: ReadonlyArray<T>): array is Array<never> {
-    return array.length === 0;
+    return true;
   }
 
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(15,7): #isEmpty() returns false if the array is not empty

Expected values to be strictly equal:

true !== false

[Killed] EqualityOperator
packages/alfa-array/src/array.ts:70:12
   }
 
   export function isEmpty<T>(array: ReadonlyArray<T>): array is Array<never> {
-    return array.length === 0;
+    return array.length !== 0;
   }
 
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(12,7): #isEmpty() returns true if the array is empty

Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
packages/alfa-array/src/array.ts:84:11
   export function forEach<T>(
     array: ReadonlyArray<T>,
     callback: Callback<T, void, [index: number]>,
-  ): void {
-    for (let i = 0, n = array.length; i < n; i++) {
-      callback(array[i], i);
-    }
-  }
+  ): void {}
 
   export function map<T, U = T>(
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(25,7): #forEach() iterates over each element in the array

Expected values to be strictly equal:

0 !== 3

[Killed] ConditionalExpression
packages/alfa-array/src/array.ts:85:39
     array: ReadonlyArray<T>,
     callback: Callback<T, void, [index: number]>,
   ): void {
-    for (let i = 0, n = array.length; i < n; i++) {
+    for (let i = 0, n = array.length; false; i++) {
       callback(array[i], i);
     }
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(25,7): #forEach() iterates over each element in the array

Expected values to be strictly equal:

0 !== 3

[Killed] UpdateOperator
packages/alfa-array/src/array.ts:85:46
     array: ReadonlyArray<T>,
     callback: Callback<T, void, [index: number]>,
   ): void {
-    for (let i = 0, n = array.length; i < n; i++) {
+    for (let i = 0, n = array.length; i < n; i--) {
       callback(array[i], i);
     }
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(21,11): #forEach() iterates over each element in the array

Expected values to be strictly equal:

undefined !== 2

[Killed] EqualityOperator
packages/alfa-array/src/array.ts:96:39
   ): Array<U> {
     const result = new builtin.Array<U>(array.length);
 
-    for (let i = 0, n = array.length; i < n; i++) {
+    for (let i = 0, n = array.length; i >= n; i++) {
       result[i] = mapper(array[i], i);
     }
killedBy: All tests
statusReason: packages/alfa-rules/src/sia-r62/rule.js(323,37): evaluate() passes an <a> element that has a difference in contrast of 3:1 as a distinguishing feature
TypeError: Cannot read properties of undefined (reading 'contrast')

[Killed] BlockStatement
packages/alfa-array/src/array.ts:96:51
   ): Array<U> {
     const result = new builtin.Array<U>(array.length);
 
-    for (let i = 0, n = array.length; i < n; i++) {
-      result[i] = mapper(array[i], i);
-    }
+    for (let i = 0, n = array.length; i < n; i++) {}
 
     return result;
killedBy: All tests
statusReason: packages/alfa-rules/src/sia-r62/rule.js(323,37): evaluate() passes an <a> element that has a difference in contrast of 3:1 as a distinguishing feature
TypeError: Cannot read properties of undefined (reading 'contrast')

[Killed] BlockStatement
packages/alfa-array/src/array.ts:109:51
   ): Array<U> {
     const result = empty<U>();
 
-    for (let i = 0, n = array.length; i < n; i++) {
-      result.push(...mapper(array[i], i));
-    }
+    for (let i = 0, n = array.length; i < n; i++) {}
 
     return result;
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r62/rule.expectation.textdecoration.spec.js(34,7): evaluates() accepts decoration on children of links

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] EqualityOperator
packages/alfa-array/src/array.ts:125:39
     reducer: Reducer<T, U, [index: number]>,
     accumulator: U,
   ): U {
-    for (let i = 0, n = array.length; i < n; i++) {
+    for (let i = 0, n = array.length; i >= n; i++) {
       accumulator = reducer(accumulator, array[i], i);
     }
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(70,7): #count() counts the number of elements in the array that satisfy the predicate

Expected values to be strictly equal:

0 !== 2

[Killed] EqualityOperator
packages/alfa-array/src/array.ts:125:39
     reducer: Reducer<T, U, [index: number]>,
     accumulator: U,
   ): U {
-    for (let i = 0, n = array.length; i < n; i++) {
+    for (let i = 0, n = array.length; i <= n; i++) {
       accumulator = reducer(accumulator, array[i], i);
     }
killedBy: All tests
statusReason: packages/alfa-iterable/src/iterable.js(113,17): .from() determines the name of a <div> element with a role of button and with child text content
TypeError: predicate is not a function

[Killed] BlockStatement
packages/alfa-array/src/array.ts:138:51
     reducer: Reducer<T, U, [index: number]>,
     accumulator: U,
   ): U {
-    for (let i = 0, n = array.length; i < n; i++) {
-      const value = array[i];
-
-      if (predicate(value, i)) {
-        accumulator = reducer(accumulator, value, i);
-      } else {
-        break;
-      }
-    }
+    for (let i = 0, n = array.length; i < n; i++) {}
 
     return accumulator;
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(30,7): #reduceWhile() reduces the array while the predicate is true

Expected values to be strictly equal:

0 !== 6

[Killed] UpdateOperator
packages/alfa-array/src/array.ts:138:46
     reducer: Reducer<T, U, [index: number]>,
     accumulator: U,
   ): U {
-    for (let i = 0, n = array.length; i < n; i++) {
+    for (let i = 0, n = array.length; i < n; i--) {
       const value = array[i];
 
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(30,7): #reduceWhile() reduces the array while the predicate is true

Expected values to be strictly equal:

1 !== 6

[Killed] ConditionalExpression
packages/alfa-array/src/array.ts:141:11
     for (let i = 0, n = array.length; i < n; i++) {
       const value = array[i];
 
-      if (predicate(value, i)) {
+      if (false) {
         accumulator = reducer(accumulator, value, i);
       } else {
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(30,7): #reduceWhile() reduces the array while the predicate is true

Expected values to be strictly equal:

0 !== 6

[Killed] ConditionalExpression
packages/alfa-array/src/array.ts:141:11
     for (let i = 0, n = array.length; i < n; i++) {
       const value = array[i];
 
-      if (predicate(value, i)) {
+      if (true) {
         accumulator = reducer(accumulator, value, i);
       } else {
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(30,7): #reduceWhile() reduces the array while the predicate is true

Expected values to be strictly equal:

15 !== 6

[Survived] BlockStatement
packages/alfa-array/src/array.ts:143:14
 
       if (predicate(value, i)) {
         accumulator = reducer(accumulator, value, i);
-      } else {
-        break;
-      }
+      } else {}
     }
 

[Killed] ConditionalExpression
packages/alfa-array/src/array.ts:183:39
   ): Array<T> {
     const result = empty<T>();
 
-    for (let i = 0, n = array.length; i < n; i++) {
+    for (let i = 0, n = array.length; false; i++) {
       const value = array[i];
 
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(35,7): #filter() filters the array

Expected values to be strictly deep-equal:
+ actual - expected

+ []
- [
-   2,

[Killed] BlockStatement
packages/alfa-array/src/array.ts:183:51
   ): Array<T> {
     const result = empty<T>();
 
-    for (let i = 0, n = array.length; i < n; i++) {
-      const value = array[i];
-
-      if (predicate(value, i)) {
-        result.push(value);
-      }
-    }
+    for (let i = 0, n = array.length; i < n; i++) {}
 
     return result;
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(35,7): #filter() filters the array

Expected values to be strictly deep-equal:
+ actual - expected

+ []
- [
-   2,

[Killed] EqualityOperator
packages/alfa-array/src/array.ts:225:39
     array: ReadonlyArray<T>,
     predicate: Predicate<T, [index: number]>,
   ): Option<T> {
-    for (let i = 0, n = array.length; i < n; i++) {
+    for (let i = 0, n = array.length; i >= n; i++) {
       const value = array[i];
 
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): #find() finds the first element in the array that satisfies the predicate
Error: Attempted to .getUnsafe() from None

[Killed] ConditionalExpression
packages/alfa-array/src/array.ts:225:39
     array: ReadonlyArray<T>,
     predicate: Predicate<T, [index: number]>,
   ): Option<T> {
-    for (let i = 0, n = array.length; i < n; i++) {
+    for (let i = 0, n = array.length; false; i++) {
       const value = array[i];
 
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): #find() finds the first element in the array that satisfies the predicate
Error: Attempted to .getUnsafe() from None

[Killed] BlockStatement
packages/alfa-array/src/array.ts:228:32
     for (let i = 0, n = array.length; i < n; i++) {
       const value = array[i];
 
-      if (predicate(value, i)) {
-        return Option.of(value);
-      }
+      if (predicate(value, i)) {}
     }
 
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): #find() finds the first element in the array that satisfies the predicate
Error: Attempted to .getUnsafe() from None

[Killed] EqualityOperator
packages/alfa-array/src/array.ts:250:36
     array: ReadonlyArray<T>,
     predicate: Predicate<T, [index: number]>,
   ): Option<T> {
-    for (let i = array.length - 1; i >= 0; i--) {
+    for (let i = array.length - 1; i < 0; i--) {
       const value = array[i];
 
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): #findLast() finds the last element in the array that satisfies the predicate
Error: Attempted to .getUnsafe() from None

[Killed] BlockStatement
packages/alfa-array/src/array.ts:250:49
     array: ReadonlyArray<T>,
     predicate: Predicate<T, [index: number]>,
   ): Option<T> {
-    for (let i = array.length - 1; i >= 0; i--) {
-      const value = array[i];
-
-      if (predicate(value, i)) {
-        return Option.of(value);
-      }
-    }
+    for (let i = array.length - 1; i >= 0; i--) {}
 
     return None;
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): #findLast() finds the last element in the array that satisfies the predicate
Error: Attempted to .getUnsafe() from None

[Killed] BlockStatement
packages/alfa-array/src/array.ts:271:51
   ): Array<U> {
     const result = empty<U>();
 
-    for (let i = 0, n = array.length; i < n; i++) {
-      for (const value of mapper(array[i], i)) {
-        result.push(value);
-      }
-    }
+    for (let i = 0, n = array.length; i < n; i++) {}
 
     return result;
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r16/rule.spec.js(14,7): evaluate() passes a <div> element with a role of checkbox and an aria-checked attribute

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] BlockStatement
packages/alfa-array/src/array.ts:272:48
     const result = empty<U>();
 
     for (let i = 0, n = array.length; i < n; i++) {
-      for (const value of mapper(array[i], i)) {
-        result.push(value);
-      }
+      for (const value of mapper(array[i], i)) {}
     }
 
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r16/rule.spec.js(14,7): evaluate() passes a <div> element with a role of checkbox and an aria-checked attribute

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] BlockStatement
packages/alfa-array/src/array.ts:284:51
     array: ReadonlyArray<T>,
     mapper: Mapper<T, Option<U>, [index: number]>,
   ): Option<U> {
-    for (let i = 0, n = array.length; i < n; i++) {
-      const value = mapper(array[i], i);
-
-      if (value.isSome()) {
-        return value;
-      }
-    }
+    for (let i = 0, n = array.length; i < n; i++) {}
 
     return None;
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): .from() determines the name of a <button> element with child text content
Error: Attempted to .getUnsafe() from None

[Killed] EqualityOperator
packages/alfa-array/src/array.ts:284:39
     array: ReadonlyArray<T>,
     mapper: Mapper<T, Option<U>, [index: number]>,
   ): Option<U> {
-    for (let i = 0, n = array.length; i < n; i++) {
+    for (let i = 0, n = array.length; i <= n; i++) {
       const value = mapper(array[i], i);
 
killedBy: All tests
statusReason: packages/alfa-aria/src/name.js(628,65): .from() determines the name of a <button> element with child text content
TypeError: step is not a function

[Killed] ConditionalExpression
packages/alfa-array/src/array.ts:287:11
     for (let i = 0, n = array.length; i < n; i++) {
       const value = mapper(array[i], i);
 
-      if (value.isSome()) {
+      if (true) {
         return value;
       }
killedBy: All tests
statusReason: packages/alfa-aria/test/role.spec.js(98,7): .from() maps `<select>` to listboxes

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    attributes: [
...

[Killed] BlockStatement
packages/alfa-array/src/array.ts:287:27
     for (let i = 0, n = array.length; i < n; i++) {
       const value = mapper(array[i], i);
 
-      if (value.isSome()) {
-        return value;
-      }
+      if (value.isSome()) {}
     }
 
killedBy: All tests
statusReason: packages/alfa-aria/test/role.spec.js(98,7): .from() maps `<select>` to listboxes

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    attributes: [
...

[Killed] ConditionalExpression
packages/alfa-array/src/array.ts:299:39
     array: ReadonlyArray<T>,
     predicate: Predicate<T, [index: number]>,
   ): boolean {
-    for (let i = 0, n = array.length; i < n; i++) {
+    for (let i = 0, n = array.length; false; i++) {
       if (predicate(array[i], i)) {
         return true;
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(54,7): #some() returns true if any element in the array satisfies the predicate

Expected values to be strictly equal:

false !== true

[Killed] EqualityOperator
packages/alfa-array/src/array.ts:299:39
     array: ReadonlyArray<T>,
     predicate: Predicate<T, [index: number]>,
   ): boolean {
-    for (let i = 0, n = array.length; i < n; i++) {
+    for (let i = 0, n = array.length; i >= n; i++) {
       if (predicate(array[i], i)) {
         return true;
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(54,7): #some() returns true if any element in the array satisfies the predicate

Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
packages/alfa-array/src/array.ts:300:11
     predicate: Predicate<T, [index: number]>,
   ): boolean {
     for (let i = 0, n = array.length; i < n; i++) {
-      if (predicate(array[i], i)) {
+      if (true) {
         return true;
       }
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(58,7): #some() returns false if no element in the array satisfies the predicate

Expected values to be strictly equal:

true !== false

[Killed] BlockStatement
packages/alfa-array/src/array.ts:300:35
     predicate: Predicate<T, [index: number]>,
   ): boolean {
     for (let i = 0, n = array.length; i < n; i++) {
-      if (predicate(array[i], i)) {
-        return true;
-      }
+      if (predicate(array[i], i)) {}
     }
 
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(54,7): #some() returns true if any element in the array satisfies the predicate

Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
packages/alfa-array/src/array.ts:301:16
   ): boolean {
     for (let i = 0, n = array.length; i < n; i++) {
       if (predicate(array[i], i)) {
-        return true;
+        return false;
       }
     }
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(54,7): #some() returns true if any element in the array satisfies the predicate

Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
packages/alfa-array/src/array.ts:330:11
     predicate: Predicate<T, [index: number]>,
   ): boolean {
     for (let i = 0, n = array.length; i < n; i++) {
-      if (!predicate(array[i], i)) {
+      if (predicate(array[i], i)) {
         return false;
       }
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(62,7): #every() returns true if all elements in the array satisfy the predicate

Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
packages/alfa-array/src/array.ts:330:11
     predicate: Predicate<T, [index: number]>,
   ): boolean {
     for (let i = 0, n = array.length; i < n; i++) {
-      if (!predicate(array[i], i)) {
+      if (false) {
         return false;
       }
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(66,7): #every() returns false if any element in the array does not satisfy the predicate

Expected values to be strictly equal:

true !== false

[Killed] BooleanLiteral
packages/alfa-array/src/array.ts:331:16
   ): boolean {
     for (let i = 0, n = array.length; i < n; i++) {
       if (!predicate(array[i], i)) {
-        return false;
+        return true;
       }
     }
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(66,7): #every() returns false if any element in the array does not satisfy the predicate

Expected values to be strictly equal:

true !== false

[Killed] ArithmeticOperator
packages/alfa-array/src/array.ts:344:59
   ): number {
     return reduce(
       array,
-      (count, value, index) => (predicate(value, index) ? count + 1 : count),
+      (count, value, index) => (predicate(value, index) ? count - 1 : count),
       0,
     );
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(70,7): #count() counts the number of elements in the array that satisfy the predicate

Expected values to be strictly equal:

-2 !== 2

[Killed] BlockStatement
packages/alfa-array/src/array.ts:352:51
   export function distinct<T>(array: ReadonlyArray<T>): Array<T> {
     const result = empty<T>();
 
-    for (let i = 0, n = array.length; i < n; i++) {
-      const value = array[i];
-
-      if (result.some(Predicate.equals(value))) {
-        continue;
-      }
-
-      result.push(value);
-    }
+    for (let i = 0, n = array.length; i < n; i++) {}
 
     return result;
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(74,7): #distinct() returns a new array with all duplicate elements removed

Expected values to be strictly deep-equal:
+ actual - expected

+ []
- [
-   1,

[Killed] MethodExpression
packages/alfa-array/src/array.ts:355:11
     for (let i = 0, n = array.length; i < n; i++) {
       const value = array[i];
 
-      if (result.some(Predicate.equals(value))) {
+      if (result.every(Predicate.equals(value))) {
         continue;
       }
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(74,7): #distinct() returns a new array with all duplicate elements removed

Expected values to be strictly deep-equal:
+ actual - expected

+ []
- [
-   1,

[Killed] ConditionalExpression
packages/alfa-array/src/array.ts:355:11
     for (let i = 0, n = array.length; i < n; i++) {
       const value = array[i];
 
-      if (result.some(Predicate.equals(value))) {
+      if (true) {
         continue;
       }
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(74,7): #distinct() returns a new array with all duplicate elements removed

Expected values to be strictly deep-equal:
+ actual - expected

+ []
- [
-   1,

[Killed] EqualityOperator
packages/alfa-array/src/array.ts:366:12
   }
 
   export function get<T>(array: ReadonlyArray<T>, index: number): Option<T> {
-    return index < array.length ? Option.of(array[index]) : None;
+    return index >= array.length ? Option.of(array[index]) : None;
   }
 
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): #get() returns the element at the given index if it exists
Error: Attempted to .getUnsafe() from None

[Killed] ConditionalExpression
packages/alfa-array/src/array.ts:366:12
   }
 
   export function get<T>(array: ReadonlyArray<T>, index: number): Option<T> {
-    return index < array.length ? Option.of(array[index]) : None;
+    return true ? Option.of(array[index]) : None;
   }
 
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(82,7): #get() returns none if the element at the given index does not exist

Expected values to be strictly equal:

false !== true

[Survived] EqualityOperator
packages/alfa-array/src/array.ts:370:12
   }
 
   export function has<T>(array: ReadonlyArray<T>, index: number): boolean {
-    return index < array.length;
+    return index <= array.length;
   }
 

[Survived] ConditionalExpression
packages/alfa-array/src/array.ts:370:12
   }
 
   export function has<T>(array: ReadonlyArray<T>, index: number): boolean {
-    return index < array.length;
+    return false;
   }
 

[Survived] EqualityOperator
packages/alfa-array/src/array.ts:374:9
   }
 
   export function set<T>(array: Array<T>, index: number, value: T): Array<T> {
-    if (index < array.length) {
+    if (index >= array.length) {
       array[index] = value;
     }

[Survived] ConditionalExpression
packages/alfa-array/src/array.ts:374:9
   }
 
   export function set<T>(array: Array<T>, index: number, value: T): Array<T> {
-    if (index < array.length) {
+    if (true) {
       array[index] = value;
     }

[Killed] ConditionalExpression
packages/alfa-array/src/array.ts:386:9
     index: number,
     value: T,
   ): Array<T> {
-    if (index <= array.length) {
+    if (false) {
       array.splice(index, 0, value);
     }
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(86,7): #insert() inserts the given element at the given index

Expected values to be strictly deep-equal:
+ actual - expected

  [
    1,
    2,

[Killed] BlockStatement
packages/alfa-array/src/array.ts:386:32
     index: number,
     value: T,
   ): Array<T> {
-    if (index <= array.length) {
-      array.splice(index, 0, value);
-    }
+    if (index <= array.length) {}
 
     return array;
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(86,7): #insert() inserts the given element at the given index

Expected values to be strictly deep-equal:
+ actual - expected

  [
    1,
    2,

[Killed] UpdateOperator
packages/alfa-array/src/array.ts:431:46
     const result = empty<[T, U]>();
     const it = Iterable.iterator(iterable);
 
-    for (let i = 0, n = array.length; i < n; i++) {
+    for (let i = 0, n = array.length; i < n; i--) {
       const next = it.next();
 
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(106,7): #zip() zips the given arrays

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    [
...

[Killed] EqualityOperator
packages/alfa-array/src/array.ts:434:11
     for (let i = 0, n = array.length; i < n; i++) {
       const next = it.next();
 
-      if (next.done === true) {
+      if (next.done !== true) {
         break;
       }
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(106,7): #zip() zips the given arrays

Expected values to be strictly deep-equal:
+ actual - expected

+ []
- [
-   [

[Killed] ConditionalExpression
packages/alfa-array/src/array.ts:434:11
     for (let i = 0, n = array.length; i < n; i++) {
       const next = it.next();
 
-      if (next.done === true) {
+      if (true) {
         break;
       }
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(106,7): #zip() zips the given arrays

Expected values to be strictly deep-equal:
+ actual - expected

+ []
- [
-   [

[Killed] ConditionalExpression
packages/alfa-array/src/array.ts:445:12
   }
 
   export function first<T>(array: ReadonlyArray<T>): Option<T> {
-    return array.length > 0 ? Option.of(array[0]) : None;
+    return false ? Option.of(array[0]) : None;
   }
 
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): #first() returns the first element in the array
Error: Attempted to .getUnsafe() from None

[Killed] EqualityOperator
packages/alfa-array/src/array.ts:445:12
   }
 
   export function first<T>(array: ReadonlyArray<T>): Option<T> {
-    return array.length > 0 ? Option.of(array[0]) : None;
+    return array.length <= 0 ? Option.of(array[0]) : None;
   }
 
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): #first() returns the first element in the array
Error: Attempted to .getUnsafe() from None

[Killed] EqualityOperator
packages/alfa-array/src/array.ts:449:12
   }
 
   export function last<T>(array: ReadonlyArray<T>): Option<T> {
-    return array.length > 0 ? Option.of(array[array.length - 1]) : None;
+    return array.length <= 0 ? Option.of(array[array.length - 1]) : None;
   }
 
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): #last() returns the last element in the array
Error: Attempted to .getUnsafe() from None

[Killed] ConditionalExpression
packages/alfa-array/src/array.ts:449:12
   }
 
   export function last<T>(array: ReadonlyArray<T>): Option<T> {
-    return array.length > 0 ? Option.of(array[array.length - 1]) : None;
+    return false ? Option.of(array[array.length - 1]) : None;
   }
 
killedBy: All tests
statusReason: packages/alfa-option/src/none.js(69,15): #last() returns the last element in the array
Error: Attempted to .getUnsafe() from None

[Killed] MethodExpression
packages/alfa-array/src/array.ts:467:12
     array: Array<T>,
     comparer: Comparer<T>,
   ): Array<T> {
-    return array.sort(comparer);
+    return array;
   }
 
killedBy: All tests
statusReason: packages/alfa-dom/test/node.spec.js(20,7): #tabOrder() correctly handles explicitly ordered tab indices

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
+   <ref *1> Element {
-   <ref *3> Element {

[Killed] ArithmeticOperator
packages/alfa-array/src/array.ts:491:17
     comparer: Comparer<T>,
   ): number {
     let lower = 0;
-    let upper = array.length - 1;
+    let upper = array.length + 1;
 
     while (lower <= upper) {
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(131,7): #search() returns the index of an element in a sorted array given a custom comparer

Expected values to be strictly equal:

5 !== 4

[Killed] EqualityOperator
packages/alfa-array/src/array.ts:493:12
     let lower = 0;
     let upper = array.length - 1;
 
-    while (lower <= upper) {
+    while (lower < upper) {
       const middle = (lower + (upper - lower) / 2) >>> 0;
 
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(139,7): #search() returns wrong index if value is not found

Expected values to be strictly equal:

4 !== 5

[Killed] ConditionalExpression
packages/alfa-array/src/array.ts:493:12
     let lower = 0;
     let upper = array.length - 1;
 
-    while (lower <= upper) {
+    while (false) {
       const middle = (lower + (upper - lower) / 2) >>> 0;
 
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(130,7): #search() returns the index of an element in a sorted array given a custom comparer

Expected values to be strictly equal:

0 !== 2

[Killed] ArithmeticOperator
packages/alfa-array/src/array.ts:494:32
     let upper = array.length - 1;
 
     while (lower <= upper) {
-      const middle = (lower + (upper - lower) / 2) >>> 0;
+      const middle = (lower + (upper + lower) / 2) >>> 0;
 
       switch (comparer(value, array[middle]!)) {
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(131,7): #search() returns the index of an element in a sorted array given a custom comparer

Expected values to be strictly equal:

6 !== 4

[Killed] ArithmeticOperator
packages/alfa-array/src/array.ts:494:31
     let upper = array.length - 1;
 
     while (lower <= upper) {
-      const middle = (lower + (upper - lower) / 2) >>> 0;
+      const middle = (lower + (upper - lower) * 2) >>> 0;
 
       switch (comparer(value, array[middle]!)) {
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(129,7): #search() returns the index of an element in a sorted array given a custom comparer

Expected values to be strictly equal:

8 !== 0
