[Killed] ConditionalExpression
packages/alfa-array/src/array.ts:497:9
       const middle = (lower + (upper - lower) / 2) >>> 0;
 
       switch (comparer(value, array[middle]!)) {
-        case Comparison.Greater:
-          lower = middle + 1;
-          break;
+        case Comparison.Greater:
         case Comparison.Less:
           upper = middle - 1;
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(131,7): #search() returns the index of an element in a sorted array given a custom comparer

Expected values to be strictly equal:

0 !== 4

[Timeout] ArithmeticOperator
packages/alfa-array/src/array.ts:498:19
 
       switch (comparer(value, array[middle]!)) {
         case Comparison.Greater:
-          lower = middle + 1;
+          lower = middle - 1;
           break;
         case Comparison.Less:

[Killed] ConditionalExpression
packages/alfa-array/src/array.ts:500:9
         case Comparison.Greater:
           lower = middle + 1;
           break;
-        case Comparison.Less:
-          upper = middle - 1;
-          break;
+        case Comparison.Less:
         case Comparison.Equal:
           return middle;
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(129,7): #search() returns the index of an element in a sorted array given a custom comparer

Expected values to be strictly equal:

2 !== 0

[Timeout] ArithmeticOperator
packages/alfa-array/src/array.ts:501:19
           lower = middle + 1;
           break;
         case Comparison.Less:
-          upper = middle - 1;
+          upper = middle + 1;
           break;
         case Comparison.Equal:

[Timeout] ConditionalExpression
packages/alfa-array/src/array.ts:503:9
         case Comparison.Less:
           upper = middle - 1;
           break;
-        case Comparison.Equal:
-          return middle;
+        case Comparison.Equal:
       }
     }

[Killed] EqualityOperator
packages/alfa-array/src/array.ts:512:9
   }
 
   export function equals<T>(a: ReadonlyArray<T>, b: ReadonlyArray<T>): boolean {
-    if (a.length !== b.length) {
+    if (a.length === b.length) {
       return false;
     }
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(152,7): #equals() returns true if the elements are instances of Equatable and are pairwise equal

Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
packages/alfa-array/src/array.ts:512:9
   }
 
   export function equals<T>(a: ReadonlyArray<T>, b: ReadonlyArray<T>): boolean {
-    if (a.length !== b.length) {
+    if (true) {
       return false;
     }
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(152,7): #equals() returns true if the elements are instances of Equatable and are pairwise equal

Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
packages/alfa-array/src/array.ts:516:47
       return false;
     }
 
-    for (let i = 0, n = a.length; i < n; i++) {
-      if (!Equatable.equals(a[i], b[i])) {
-        return false;
-      }
-    }
+    for (let i = 0, n = a.length; i < n; i++) {}
 
     return true;
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(157,7): #equals() returns false if the elements are instances of Equatable and are not pairwise equal

Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
packages/alfa-array/src/array.ts:516:35
       return false;
     }
 
-    for (let i = 0, n = a.length; i < n; i++) {
+    for (let i = 0, n = a.length; false; i++) {
       if (!Equatable.equals(a[i], b[i])) {
         return false;
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(157,7): #equals() returns false if the elements are instances of Equatable and are not pairwise equal

Expected values to be strictly equal:

true !== false

[Killed] BooleanLiteral
packages/alfa-array/src/array.ts:517:11
     }
 
     for (let i = 0, n = a.length; i < n; i++) {
-      if (!Equatable.equals(a[i], b[i])) {
+      if (Equatable.equals(a[i], b[i])) {
         return false;
       }
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(152,7): #equals() returns true if the elements are instances of Equatable and are pairwise equal

Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
packages/alfa-array/src/array.ts:517:11
     }
 
     for (let i = 0, n = a.length; i < n; i++) {
-      if (!Equatable.equals(a[i], b[i])) {
+      if (true) {
         return false;
       }
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(152,7): #equals() returns true if the elements are instances of Equatable and are pairwise equal

Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
packages/alfa-array/src/array.ts:518:16
 
     for (let i = 0, n = a.length; i < n; i++) {
       if (!Equatable.equals(a[i], b[i])) {
-        return false;
+        return true;
       }
     }
killedBy: All tests
statusReason: packages/alfa-array/test/array.spec.js(157,7): #equals() returns false if the elements are instances of Equatable and are not pairwise equal

Expected values to be strictly equal:

true !== false

[Killed] BlockStatement
packages/alfa-array/src/array.ts:525:70
     return true;
   }
 
-  export function hash<T>(array: ReadonlyArray<T>, hash: Hash): void {
-    for (let i = 0, n = array.length; i < n; i++) {
-      hash.writeUnknown(array[i]);
-    }
-
-    hash.writeUint32(array.length);
-  }
+  export function hash<T>(array: ReadonlyArray<T>, hash: Hash): void {}
 
   export function iterator<T>(array: ReadonlyArray<T>): Iterator<T> {
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r62/rule.expectation.spec.js(354,7): evaluate() passes an <a> element in superscript

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] EqualityOperator
packages/alfa-array/src/array.ts:526:39
   }
 
   export function hash<T>(array: ReadonlyArray<T>, hash: Hash): void {
-    for (let i = 0, n = array.length; i < n; i++) {
+    for (let i = 0, n = array.length; i <= n; i++) {
       hash.writeUnknown(array[i]);
     }
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r62/rule.expectation.textdecoration.spec.js(45,7): evaluates() doesn't break when link text is nested

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Survived] ConditionalExpression
packages/alfa-array/src/array.ts:526:39
   }
 
   export function hash<T>(array: ReadonlyArray<T>, hash: Hash): void {
-    for (let i = 0, n = array.length; i < n; i++) {
+    for (let i = 0, n = array.length; false; i++) {
       hash.writeUnknown(array[i]);
     }
