[Killed] BlockStatement
packages/alfa-act/src/cache.ts:13:32
  * @public
  */
 export class Cache {
-  public static empty(): Cache {
-    return new Cache();
-  }
+  public static empty(): Cache {}
 
   private readonly _storage = new WeakMap<object, unknown>();
killedBy: All tests
statusReason: packages/alfa-act/src/rule.js(101,95): evaluate() passes video with accurate descriptions track
TypeError: Cannot read properties of undefined (reading 'get')

[Killed] BlockStatement
packages/alfa-act/src/cache.ts:24:44
   public get<I, T extends Hashable, Q extends Question.Metadata, S>(
     rule: Rule<I, T, Q, S>,
     ifMissing: Thunk<Future<Iterable<Outcome<I, T, Q, S>>>>,
-  ): Future<Iterable<Outcome<I, T, Q, S>>> {
-    let outcomes = this._storage.get(rule) as
-      | Future<Iterable<Outcome<I, T, Q, S>>>
-      | undefined;
-
-    if (outcomes === undefined) {
-      outcomes = ifMissing();
-      this._storage.set(rule, outcomes);
-    }
-
-    return outcomes;
-  }
+  ): Future<Iterable<Outcome<I, T, Q, S>>> {}
 }
 
killedBy: All tests
statusReason: packages/alfa-rules/test/common/evaluate.js(20,9): evaluate() passes a document that that a non-empty <title> element
TypeError: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
packages/alfa-act/src/cache.ts:29:33
       | Future<Iterable<Outcome<I, T, Q, S>>>
       | undefined;
 
-    if (outcomes === undefined) {
-      outcomes = ifMissing();
-      this._storage.set(rule, outcomes);
-    }
+    if (outcomes === undefined) {}
 
     return outcomes;
killedBy: All tests
statusReason: packages/alfa-rules/test/common/evaluate.js(20,9): evaluate() passes a document that that a non-empty <title> element
TypeError: Cannot read properties of undefined (reading 'map')

[Killed] EqualityOperator
packages/alfa-act/src/cache.ts:29:9
       | Future<Iterable<Outcome<I, T, Q, S>>>
       | undefined;
 
-    if (outcomes === undefined) {
+    if (outcomes !== undefined) {
       outcomes = ifMissing();
       this._storage.set(rule, outcomes);
killedBy: All tests
statusReason: packages/alfa-rules/test/common/evaluate.js(20,9): evaluate() passes a document that that a non-empty <title> element
TypeError: Cannot read properties of undefined (reading 'map')
