[Killed] BlockStatement
packages/alfa-act/src/diagnostic.ts:13:49
 export class Diagnostic
   implements Equatable, Hashable, Serializable<Diagnostic.JSON>
 {
-  public static of(message: string): Diagnostic {
-    return new Diagnostic(normalize(message));
-  }
+  public static of(message: string): Diagnostic {}
 
   protected readonly _message: string;
killedBy: All tests
statusReason: packages/alfa-act/src/outcome.js(317,46): evaluate() can't tell if questions are left unanswered
TypeError: Cannot read properties of undefined (reading 'toJSON')

[Killed] BlockStatement
packages/alfa-act/src/diagnostic.ts:19:42
 
   protected readonly _message: string;
 
-  protected constructor(message: string) {
-    this._message = message;
-  }
+  protected constructor(message: string) {}
 
   public get message(): string {
killedBy: All tests
statusReason: packages/alfa-rules/test/common/dom/get-colors.spec.js(274,7): getColor() can't resolve most system colors

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    error: {
...

[Survived] BlockStatement
packages/alfa-act/src/diagnostic.ts:23:32
     this._message = message;
   }
 
-  public get message(): string {
-    return this._message;
-  }
+  public get message(): string {}
 
   public equals(value: Diagnostic): boolean;

[Survived] BlockStatement
packages/alfa-act/src/diagnostic.ts:31:42
 
   public equals(value: unknown): value is this;
 
-  public equals(value: unknown): boolean {
-    return value instanceof Diagnostic && value._message === this._message;
-  }
+  public equals(value: unknown): boolean {}
 
   public hash(hash: Hash) {

[Killed] BlockStatement
packages/alfa-act/src/diagnostic.ts:39:36
     hash.writeString(this._message);
   }
 
-  public toJSON(): Diagnostic.JSON {
-    return {
-      message: this._message,
-    };
-  }
+  public toJSON(): Diagnostic.JSON {}
 }
 
killedBy: All tests
statusReason: packages/alfa-rules/test/common/dom/get-colors.spec.js(274,7): getColor() can't resolve most system colors

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    error: {
...

[Killed] BlockStatement
packages/alfa-act/src/diagnostic.ts:55:69
     message: string;
   }
 
-  export function isDiagnostic(value: unknown): value is Diagnostic {
-    return value instanceof Diagnostic;
-  }
+  export function isDiagnostic(value: unknown): value is Diagnostic {}
 
   export const empty = Diagnostic.of("No extra information");
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-dr66/rule.spec.js(144,7): evaluate() correctly handles circular `currentcolor` references

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
      diagnostic: {

[Survived] BlockStatement
packages/alfa-act/src/diagnostic.ts:62:43
   export const empty = Diagnostic.of("No extra information");
 }
 
-function normalize(input: string): string {
-  return input.trim().replace(/\s+/g, " ");
-}
+function normalize(input: string): string {}
 
