[Survived] UpdateOperator
packages/alfa-array/src/array.ts:225:46
     array: ReadonlyArray<T>,
     predicate: Predicate<T, [index: number]>,
   ): Option<T> {
-    for (let i = 0, n = array.length; i < n; i++) {
+    for (let i = 0, n = array.length; i < n; i--) {
       const value = array[i];
 

[Survived] EqualityOperator
packages/alfa-array/src/array.ts:225:39
     array: ReadonlyArray<T>,
     predicate: Predicate<T, [index: number]>,
   ): Option<T> {
-    for (let i = 0, n = array.length; i < n; i++) {
+    for (let i = 0, n = array.length; i <= n; i++) {
       const value = array[i];
 

[Survived] ArithmeticOperator
packages/alfa-array/src/array.ts:250:18
     array: ReadonlyArray<T>,
     predicate: Predicate<T, [index: number]>,
   ): Option<T> {
-    for (let i = array.length - 1; i >= 0; i--) {
+    for (let i = array.length + 1; i >= 0; i--) {
       const value = array[i];
 

[Survived] UpdateOperator
packages/alfa-array/src/array.ts:250:44
     array: ReadonlyArray<T>,
     predicate: Predicate<T, [index: number]>,
   ): Option<T> {
-    for (let i = array.length - 1; i >= 0; i--) {
+    for (let i = array.length - 1; i >= 0; i++) {
       const value = array[i];
 

[Survived] EqualityOperator
packages/alfa-array/src/array.ts:299:39
     array: ReadonlyArray<T>,
     predicate: Predicate<T, [index: number]>,
   ): boolean {
-    for (let i = 0, n = array.length; i < n; i++) {
+    for (let i = 0, n = array.length; i <= n; i++) {
       if (predicate(array[i], i)) {
         return true;

[Killed] UpdateOperator
packages/alfa-array/src/array.ts:329:46
     array: ReadonlyArray<T>,
     predicate: Predicate<T, [index: number]>,
   ): boolean {
-    for (let i = 0, n = array.length; i < n; i++) {
+    for (let i = 0, n = array.length; i < n; i--) {
       if (!predicate(array[i], i)) {
         return false;
killedBy: All tests
statusReason: packages/alfa-css/test/calculation/math-functions.spec.js(21,11): .parse() parses a max of one or more numbers or calculation

Expected values to be strictly deep-equal:
+ actual - expected

  {
    expression: {
+     arguments: [

[Killed] ConditionalExpression
packages/alfa-array/src/array.ts:330:11
     predicate: Predicate<T, [index: number]>,
   ): boolean {
     for (let i = 0, n = array.length; i < n; i++) {
-      if (!predicate(array[i], i)) {
+      if (true) {
         return false;
       }
killedBy: All tests
statusReason: packages/alfa-css/test/calculation/math-functions.spec.js(21,11): .parse() parses a max of one or more numbers or calculation

Expected values to be strictly deep-equal:
+ actual - expected

  {
    expression: {
+     arguments: [

[Survived] EqualityOperator
packages/alfa-array/src/array.ts:386:9
     index: number,
     value: T,
   ): Array<T> {
-    if (index <= array.length) {
+    if (index < array.length) {
       array.splice(index, 0, value);
     }

[Survived] ConditionalExpression
packages/alfa-array/src/array.ts:445:12
   }
 
   export function first<T>(array: ReadonlyArray<T>): Option<T> {
-    return array.length > 0 ? Option.of(array[0]) : None;
+    return true ? Option.of(array[0]) : None;
   }
 

[Survived] EqualityOperator
packages/alfa-array/src/array.ts:516:35
       return false;
     }
 
-    for (let i = 0, n = a.length; i < n; i++) {
+    for (let i = 0, n = a.length; i <= n; i++) {
       if (!Equatable.equals(a[i], b[i])) {
         return false;
