[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:20:12
       "1": { date: 1228953600000 },
       "2": { date: 1242864000000 },
       "3": { date: 1252972800000 },
-      "4": { date: 1264377600000 },
+      "4": {},
       "5": { date: 1274745600000 },
       "6": { date: 1283385600000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:23:12
       "4": { date: 1264377600000 },
       "5": { date: 1274745600000 },
       "6": { date: 1283385600000 },
-      "7": { date: 1287446400000 },
+      "7": {},
       "8": { date: 1291248000000 },
       "9": { date: 1296691200000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:26:13
       "7": { date: 1287446400000 },
       "8": { date: 1291248000000 },
       "9": { date: 1296691200000 },
-      "10": { date: 1299542400000 },
+      "10": {},
       "11": { date: 1303862400000 },
       "12": { date: 1307404800000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:27:13
       "8": { date: 1291248000000 },
       "9": { date: 1296691200000 },
       "10": { date: 1299542400000 },
-      "11": { date: 1303862400000 },
+      "11": {},
       "12": { date: 1307404800000 },
       "13": { date: 1312243200000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:31:13
       "12": { date: 1307404800000 },
       "13": { date: 1312243200000 },
       "14": { date: 1316131200000 },
-      "15": { date: 1319500800000 },
+      "15": {},
       "16": { date: 1323734400000 },
       "17": { date: 1328659200000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:32:13
       "13": { date: 1312243200000 },
       "14": { date: 1316131200000 },
       "15": { date: 1319500800000 },
-      "16": { date: 1323734400000 },
+      "16": {},
       "17": { date: 1328659200000 },
       "18": { date: 1332892800000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:34:13
       "15": { date: 1319500800000 },
       "16": { date: 1323734400000 },
       "17": { date: 1328659200000 },
-      "18": { date: 1332892800000 },
+      "18": {},
       "19": { date: 1337040000000 },
       "20": { date: 1340668800000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:36:13
       "17": { date: 1328659200000 },
       "18": { date: 1332892800000 },
       "19": { date: 1337040000000 },
-      "20": { date: 1340668800000 },
+      "20": {},
       "21": { date: 1343692800000 },
       "22": { date: 1348531200000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:44:13
       "25": { date: 1361404800000 },
       "26": { date: 1364256000000 },
       "27": { date: 1369094400000 },
-      "28": { date: 1373328000000 },
+      "28": {},
       "29": { date: 1376956800000 },
       "30": { date: 1380585600000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:46:13
       "27": { date: 1369094400000 },
       "28": { date: 1373328000000 },
       "29": { date: 1376956800000 },
-      "30": { date: 1380585600000 },
+      "30": {},
       "31": { date: 1384214400000 },
       "32": { date: 1389657600000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:51:13
       "32": { date: 1389657600000 },
       "33": { date: 1392854400000 },
       "34": { date: 1396915200000 },
-      "35": { date: 1400544000000 },
+      "35": {},
       "36": { date: 1405468800000 },
       "37": { date: 1409011200000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:52:13
       "33": { date: 1392854400000 },
       "34": { date: 1396915200000 },
       "35": { date: 1400544000000 },
-      "36": { date: 1405468800000 },
+      "36": {},
       "37": { date: 1409011200000 },
       "38": { date: 1412640000000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:53:13
       "34": { date: 1396915200000 },
       "35": { date: 1400544000000 },
       "36": { date: 1405468800000 },
-      "37": { date: 1409011200000 },
+      "37": {},
       "38": { date: 1412640000000 },
       "39": { date: 1416268800000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:54:13
       "35": { date: 1400544000000 },
       "36": { date: 1405468800000 },
       "37": { date: 1409011200000 },
-      "38": { date: 1412640000000 },
+      "38": {},
       "39": { date: 1416268800000 },
       "40": { date: 1421798400000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:58:13
       "39": { date: 1416268800000 },
       "40": { date: 1421798400000 },
       "41": { date: 1425340800000 },
-      "42": { date: 1428969600000 },
+      "42": {},
       "43": { date: 1431993600000 },
       "44": { date: 1437436800000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:63:13
       "44": { date: 1437436800000 },
       "45": { date: 1441065600000 },
       "46": { date: 1444694400000 },
-      "47": { date: 1448928000000 },
+      "47": {},
       "48": { date: 1453248000000 },
       "49": { date: 1456876800000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:76:13
       "57": { date: 1489017600000 },
       "58": { date: 1492560000000 },
       "59": { date: 1496620800000 },
-      "60": { date: 1500940800000 },
+      "60": {},
       "61": { date: 1504569600000 },
       "62": { date: 1508198400000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:78:13
       "59": { date: 1496620800000 },
       "60": { date: 1500940800000 },
       "61": { date: 1504569600000 },
-      "62": { date: 1508198400000 },
+      "62": {},
       "63": { date: 1512518400000 },
       "64": { date: 1516665600000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:82:13
       "63": { date: 1512518400000 },
       "64": { date: 1516665600000 },
       "65": { date: 1520294400000 },
-      "66": { date: 1523923200000 },
+      "66": {},
       "67": { date: 1527552000000 },
       "68": { date: 1532390400000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:86:13
       "67": { date: 1527552000000 },
       "68": { date: 1532390400000 },
       "69": { date: 1536019200000 },
-      "70": { date: 1539648000000 },
+      "70": {},
       "71": { date: 1543881600000 },
       "72": { date: 1548720000000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:87:13
       "68": { date: 1532390400000 },
       "69": { date: 1536019200000 },
       "70": { date: 1539648000000 },
-      "71": { date: 1543881600000 },
+      "71": {},
       "72": { date: 1548720000000 },
       "73": { date: 1552348800000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:93:13
       "74": { date: 1555977600000 },
       "75": { date: 1559606400000 },
       "76": { date: 1564444800000 },
-      "77": { date: 1568073600000 },
+      "77": {},
       "78": { date: 1571702400000 },
       "79": { date: 1575936000000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:96:13
       "77": { date: 1568073600000 },
       "78": { date: 1571702400000 },
       "79": { date: 1575936000000 },
-      "80": { date: 1580774400000 },
+      "80": {},
       "81": { date: 1586217600000 },
       "83": { date: 1589846400000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:100:13
       "81": { date: 1586217600000 },
       "83": { date: 1589846400000 },
       "84": { date: 1595808000000 },
-      "85": { date: 1598313600000 },
+      "85": {},
       "86": { date: 1603152000000 },
       "87": { date: 1605571200000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:102:13
       "84": { date: 1595808000000 },
       "85": { date: 1598313600000 },
       "86": { date: 1603152000000 },
-      "87": { date: 1605571200000 },
+      "87": {},
       "88": { date: 1611014400000 },
       "89": { date: 1614643200000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:109:13
   },
   edge: {
     releases: {
-      "12": { date: 1438041600000 },
+      "12": {},
       "13": { date: 1447286400000 },
       "14": { date: 1470096000000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:114:13
       "14": { date: 1470096000000 },
       "15": { date: 1491350400000 },
       "16": { date: 1508198400000 },
-      "17": { date: 1525046400000 },
+      "17": {},
       "18": { date: 1538438400000 },
       "79": { date: 1579046400000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:115:13
       "15": { date: 1491350400000 },
       "16": { date: 1508198400000 },
       "17": { date: 1525046400000 },
-      "18": { date: 1538438400000 },
+      "18": {},
       "79": { date: 1579046400000 },
       "80": { date: 1581033600000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:119:13
       "79": { date: 1579046400000 },
       "80": { date: 1581033600000 },
       "81": { date: 1586736000000 },
-      "83": { date: 1590019200000 },
+      "83": {},
       "84": { date: 1594857600000 },
       "85": { date: 1598486400000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:124:13
       "85": { date: 1598486400000 },
       "86": { date: 1602201600000 },
       "87": { date: 1605744000000 },
-      "88": { date: 1611187200000 },
+      "88": {},
     },
   },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:129:12
   },
   firefox: {
     releases: {
-      "1": { date: 1099958400000 },
+      "1": {},
       "1.5": { date: 1133222400000 },
       "2": { date: 1161648000000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:131:12
     releases: {
       "1": { date: 1099958400000 },
       "1.5": { date: 1133222400000 },
-      "2": { date: 1161648000000 },
+      "2": {},
       "3": { date: 1213660800000 },
       "3.5": { date: 1246320000000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:133:14
       "1.5": { date: 1133222400000 },
       "2": { date: 1161648000000 },
       "3": { date: 1213660800000 },
-      "3.5": { date: 1246320000000 },
+      "3.5": {},
       "3.6": { date: 1264032000000 },
       "4": { date: 1300752000000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:135:12
       "3": { date: 1213660800000 },
       "3.5": { date: 1246320000000 },
       "3.6": { date: 1264032000000 },
-      "4": { date: 1300752000000 },
+      "4": {},
       "5": { date: 1308614400000 },
       "6": { date: 1313452800000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:137:12
       "3.6": { date: 1264032000000 },
       "4": { date: 1300752000000 },
       "5": { date: 1308614400000 },
-      "6": { date: 1313452800000 },
+      "6": {},
       "7": { date: 1317081600000 },
       "8": { date: 1320710400000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:139:12
       "5": { date: 1308614400000 },
       "6": { date: 1313452800000 },
       "7": { date: 1317081600000 },
-      "8": { date: 1320710400000 },
+      "8": {},
       "9": { date: 1324339200000 },
       "10": { date: 1327968000000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:145:13
       "11": { date: 1331596800000 },
       "12": { date: 1335225600000 },
       "13": { date: 1338854400000 },
-      "14": { date: 1342483200000 },
+      "14": {},
       "15": { date: 1346112000000 },
       "16": { date: 1349740800000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:146:13
       "12": { date: 1335225600000 },
       "13": { date: 1338854400000 },
       "14": { date: 1342483200000 },
-      "15": { date: 1346112000000 },
+      "15": {},
       "16": { date: 1349740800000 },
       "17": { date: 1353369600000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:147:13
       "13": { date: 1338854400000 },
       "14": { date: 1342483200000 },
       "15": { date: 1346112000000 },
-      "16": { date: 1349740800000 },
+      "16": {},
       "17": { date: 1353369600000 },
       "18": { date: 1357603200000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:150:13
       "16": { date: 1349740800000 },
       "17": { date: 1353369600000 },
       "18": { date: 1357603200000 },
-      "19": { date: 1361232000000 },
+      "19": {},
       "20": { date: 1364860800000 },
       "21": { date: 1368489600000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:151:13
       "17": { date: 1353369600000 },
       "18": { date: 1357603200000 },
       "19": { date: 1361232000000 },
-      "20": { date: 1364860800000 },
+      "20": {},
       "21": { date: 1368489600000 },
       "22": { date: 1372118400000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:153:13
       "19": { date: 1361232000000 },
       "20": { date: 1364860800000 },
       "21": { date: 1368489600000 },
-      "22": { date: 1372118400000 },
+      "22": {},
       "23": { date: 1375747200000 },
       "24": { date: 1379376000000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:156:13
       "22": { date: 1372118400000 },
       "23": { date: 1375747200000 },
       "24": { date: 1379376000000 },
-      "25": { date: 1383004800000 },
+      "25": {},
       "26": { date: 1386633600000 },
       "27": { date: 1391472000000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:157:13
       "23": { date: 1375747200000 },
       "24": { date: 1379376000000 },
       "25": { date: 1383004800000 },
-      "26": { date: 1386633600000 },
+      "26": {},
       "27": { date: 1391472000000 },
       "28": { date: 1395100800000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:158:13
       "24": { date: 1379376000000 },
       "25": { date: 1383004800000 },
       "26": { date: 1386633600000 },
-      "27": { date: 1391472000000 },
+      "27": {},
       "28": { date: 1395100800000 },
       "29": { date: 1398729600000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:163:13
       "29": { date: 1398729600000 },
       "30": { date: 1402358400000 },
       "31": { date: 1405987200000 },
-      "32": { date: 1409616000000 },
+      "32": {},
       "33": { date: 1413244800000 },
       "34": { date: 1417392000000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:168:13
       "34": { date: 1417392000000 },
       "35": { date: 1421107200000 },
       "36": { date: 1424736000000 },
-      "37": { date: 1427760000000 },
+      "37": {},
       "38": { date: 1431388800000 },
       "39": { date: 1435795200000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:169:13
       "35": { date: 1421107200000 },
       "36": { date: 1424736000000 },
       "37": { date: 1427760000000 },
-      "38": { date: 1431388800000 },
+      "38": {},
       "39": { date: 1435795200000 },
       "40": { date: 1439251200000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:170:13
       "36": { date: 1424736000000 },
       "37": { date: 1427760000000 },
       "38": { date: 1431388800000 },
-      "39": { date: 1435795200000 },
+      "39": {},
       "40": { date: 1439251200000 },
       "41": { date: 1442880000000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:172:13
       "38": { date: 1431388800000 },
       "39": { date: 1435795200000 },
       "40": { date: 1439251200000 },
-      "41": { date: 1442880000000 },
+      "41": {},
       "42": { date: 1446508800000 },
       "43": { date: 1450137600000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:175:13
       "41": { date: 1442880000000 },
       "42": { date: 1446508800000 },
       "43": { date: 1450137600000 },
-      "44": { date: 1453766400000 },
+      "44": {},
       "45": { date: 1457395200000 },
       "46": { date: 1461628800000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:177:13
       "43": { date: 1450137600000 },
       "44": { date: 1453766400000 },
       "45": { date: 1457395200000 },
-      "46": { date: 1461628800000 },
+      "46": {},
       "47": { date: 1465257600000 },
       "48": { date: 1470096000000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:178:13
       "44": { date: 1453766400000 },
       "45": { date: 1457395200000 },
       "46": { date: 1461628800000 },
-      "47": { date: 1465257600000 },
+      "47": {},
       "48": { date: 1470096000000 },
       "49": { date: 1474329600000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:179:13
       "45": { date: 1457395200000 },
       "46": { date: 1461628800000 },
       "47": { date: 1465257600000 },
-      "48": { date: 1470096000000 },
+      "48": {},
       "49": { date: 1474329600000 },
       "50": { date: 1479168000000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:186:13
       "52": { date: 1488844800000 },
       "53": { date: 1492560000000 },
       "54": { date: 1497312000000 },
-      "55": { date: 1502150400000 },
+      "55": {},
       "56": { date: 1506556800000 },
       "57": { date: 1510617600000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:188:13
       "54": { date: 1497312000000 },
       "55": { date: 1502150400000 },
       "56": { date: 1506556800000 },
-      "57": { date: 1510617600000 },
+      "57": {},
       "58": { date: 1516665600000 },
       "59": { date: 1520899200000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:195:13
       "61": { date: 1529971200000 },
       "62": { date: 1536105600000 },
       "63": { date: 1540252800000 },
-      "64": { date: 1544486400000 },
+      "64": {},
       "65": { date: 1548720000000 },
       "66": { date: 1552953600000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:196:13
       "62": { date: 1536105600000 },
       "63": { date: 1540252800000 },
       "64": { date: 1544486400000 },
-      "65": { date: 1548720000000 },
+      "65": {},
       "66": { date: 1552953600000 },
       "67": { date: 1558396800000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:197:13
       "63": { date: 1540252800000 },
       "64": { date: 1544486400000 },
       "65": { date: 1548720000000 },
-      "66": { date: 1552953600000 },
+      "66": {},
       "67": { date: 1558396800000 },
       "68": { date: 1562630400000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:202:13
       "68": { date: 1562630400000 },
       "69": { date: 1567468800000 },
       "70": { date: 1571702400000 },
-      "71": { date: 1575936000000 },
+      "71": {},
       "72": { date: 1578355200000 },
       "73": { date: 1581379200000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:208:13
       "74": { date: 1583798400000 },
       "75": { date: 1586217600000 },
       "76": { date: 1588636800000 },
-      "77": { date: 1591056000000 },
+      "77": {},
       "78": { date: 1593475200000 },
       "79": { date: 1595894400000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:209:13
       "75": { date: 1586217600000 },
       "76": { date: 1588636800000 },
       "77": { date: 1591056000000 },
-      "78": { date: 1593475200000 },
+      "78": {},
       "79": { date: 1595894400000 },
       "80": { date: 1598313600000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:212:13
       "78": { date: 1593475200000 },
       "79": { date: 1595894400000 },
       "80": { date: 1598313600000 },
-      "81": { date: 1600732800000 },
+      "81": {},
       "82": { date: 1603152000000 },
       "83": { date: 1605571200000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:215:13
       "81": { date: 1600732800000 },
       "82": { date: 1603152000000 },
       "83": { date: 1605571200000 },
-      "84": { date: 1607990400000 },
+      "84": {},
       "85": { date: 1611619200000 },
       "86": { date: 1614038400000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:216:13
       "82": { date: 1603152000000 },
       "83": { date: 1605571200000 },
       "84": { date: 1607990400000 },
-      "85": { date: 1611619200000 },
+      "85": {},
       "86": { date: 1614038400000 },
     },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:222:12
   },
   ie: {
     releases: {
-      "1": { date: 808531200000 },
+      "1": {},
       "2": { date: 816998400000 },
       "3": { date: 839894400000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:223:12
   ie: {
     releases: {
       "1": { date: 808531200000 },
-      "2": { date: 816998400000 },
+      "2": {},
       "3": { date: 839894400000 },
       "4": { date: 875577600000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:227:14
       "3": { date: 839894400000 },
       "4": { date: 875577600000 },
       "5": { date: 921715200000 },
-      "5.5": { date: 962841600000 },
+      "5.5": {},
       "6": { date: 998870400000 },
       "7": { date: 1161129600000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:233:13
       "8": { date: 1237420800000 },
       "9": { date: 1300060800000 },
       "10": { date: 1351209600000 },
-      "11": { date: 1381968000000 },
+      "11": {},
     },
   },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:243:12
       "3.5": { date: 911347200000 },
       "3.6": { date: 925948800000 },
       "4": { date: 962150400000 },
-      "5": { date: 976060800000 },
+      "5": {},
       "5.1": { date: 986860800000 },
       "6": { date: 1008633600000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:244:14
       "3.6": { date: 925948800000 },
       "4": { date: 962150400000 },
       "5": { date: 976060800000 },
-      "5.1": { date: 986860800000 },
+      "5.1": {},
       "6": { date: 1008633600000 },
       "7": { date: 1043712000000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:246:12
       "5": { date: 976060800000 },
       "5.1": { date: 986860800000 },
       "6": { date: 1008633600000 },
-      "7": { date: 1043712000000 },
+      "7": {},
       "7.1": { date: 1050019200000 },
       "7.2": { date: 1064275200000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:247:14
       "5.1": { date: 986860800000 },
       "6": { date: 1008633600000 },
       "7": { date: 1043712000000 },
-      "7.1": { date: 1050019200000 },
+      "7.1": {},
       "7.2": { date: 1064275200000 },
       "7.5": { date: 1084320000000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:249:14
       "7": { date: 1043712000000 },
       "7.1": { date: 1050019200000 },
       "7.2": { date: 1064275200000 },
-      "7.5": { date: 1084320000000 },
+      "7.5": {},
       "8": { date: 1113868800000 },
       "8.5": { date: 1127174400000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:254:14
       "8.5": { date: 1127174400000 },
       "9": { date: 1150761600000 },
       "9.1": { date: 1166400000000 },
-      "9.2": { date: 1176249600000 },
+      "9.2": {},
       "9.5": { date: 1213228800000 },
       "9.6": { date: 1223424000000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:255:14
       "9": { date: 1150761600000 },
       "9.1": { date: 1166400000000 },
       "9.2": { date: 1176249600000 },
-      "9.5": { date: 1213228800000 },
+      "9.5": {},
       "9.6": { date: 1223424000000 },
       "10": { date: 1251763200000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:259:15
       "9.6": { date: 1223424000000 },
       "10": { date: 1251763200000 },
       "10.1": { date: 1258934400000 },
-      "10.5": { date: 1267488000000 },
+      "10.5": {},
       "10.6": { date: 1277942400000 },
       "11": { date: 1292457600000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:262:15
       "10.5": { date: 1267488000000 },
       "10.6": { date: 1277942400000 },
       "11": { date: 1292457600000 },
-      "11.1": { date: 1302566400000 },
+      "11.1": {},
       "11.5": { date: 1309219200000 },
       "11.6": { date: 1323129600000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:264:15
       "11": { date: 1292457600000 },
       "11.1": { date: 1302566400000 },
       "11.5": { date: 1309219200000 },
-      "11.6": { date: 1323129600000 },
+      "11.6": {},
       "12": { date: 1339632000000 },
       "12.1": { date: 1353369600000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:266:15
       "11.5": { date: 1309219200000 },
       "11.6": { date: 1323129600000 },
       "12": { date: 1339632000000 },
-      "12.1": { date: 1353369600000 },
+      "12.1": {},
       "15": { date: 1372723200000 },
       "16": { date: 1377561600000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:267:13
       "11.6": { date: 1323129600000 },
       "12": { date: 1339632000000 },
       "12.1": { date: 1353369600000 },
-      "15": { date: 1372723200000 },
+      "15": {},
       "16": { date: 1377561600000 },
       "17": { date: 1381190400000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:268:13
       "12": { date: 1339632000000 },
       "12.1": { date: 1353369600000 },
       "15": { date: 1372723200000 },
-      "16": { date: 1377561600000 },
+      "16": {},
       "17": { date: 1381190400000 },
       "18": { date: 1384819200000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:274:13
       "19": { date: 1390867200000 },
       "20": { date: 1393891200000 },
       "21": { date: 1399334400000 },
-      "22": { date: 1401753600000 },
+      "22": {},
       "23": { date: 1405987200000 },
       "24": { date: 1409616000000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:277:13
       "22": { date: 1401753600000 },
       "23": { date: 1405987200000 },
       "24": { date: 1409616000000 },
-      "25": { date: 1413331200000 },
+      "25": {},
       "26": { date: 1417564800000 },
       "27": { date: 1422316800000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:279:13
       "24": { date: 1409616000000 },
       "25": { date: 1413331200000 },
       "26": { date: 1417564800000 },
-      "27": { date: 1422316800000 },
+      "27": {},
       "28": { date: 1425945600000 },
       "29": { date: 1430179200000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:280:13
       "25": { date: 1413331200000 },
       "26": { date: 1417564800000 },
       "27": { date: 1422316800000 },
-      "28": { date: 1425945600000 },
+      "28": {},
       "29": { date: 1430179200000 },
       "30": { date: 1433808000000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:283:13
       "28": { date: 1425945600000 },
       "29": { date: 1430179200000 },
       "30": { date: 1433808000000 },
-      "31": { date: 1438646400000 },
+      "31": {},
       "32": { date: 1442275200000 },
       "33": { date: 1445904000000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:285:13
       "30": { date: 1433808000000 },
       "31": { date: 1438646400000 },
       "32": { date: 1442275200000 },
-      "33": { date: 1445904000000 },
+      "33": {},
       "34": { date: 1449532800000 },
       "35": { date: 1454371200000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:292:13
       "37": { date: 1462320000000 },
       "38": { date: 1465344000000 },
       "39": { date: 1470096000000 },
-      "40": { date: 1474329600000 },
+      "40": {},
       "41": { date: 1477353600000 },
       "42": { date: 1481587200000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:303:13
       "48": { date: 1506470400000 },
       "49": { date: 1510099200000 },
       "50": { date: 1515024000000 },
-      "51": { date: 1517961600000 },
+      "51": {},
       "52": { date: 1521676800000 },
       "53": { date: 1525910400000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:305:13
       "50": { date: 1515024000000 },
       "51": { date: 1517961600000 },
       "52": { date: 1521676800000 },
-      "53": { date: 1525910400000 },
+      "53": {},
       "54": { date: 1530144000000 },
       "55": { date: 1534377600000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:313:13
       "58": { date: 1548201600000 },
       "60": { date: 1554768000000 },
       "62": { date: 1561593600000 },
-      "63": { date: 1566259200000 },
+      "63": {},
       "64": { date: 1570406400000 },
       "65": { date: 1573603200000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:315:13
       "62": { date: 1561593600000 },
       "63": { date: 1566259200000 },
       "64": { date: 1570406400000 },
-      "65": { date: 1573603200000 },
+      "65": {},
       "66": { date: 1578355200000 },
       "67": { date: 1583193600000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:316:13
       "63": { date: 1566259200000 },
       "64": { date: 1570406400000 },
       "65": { date: 1573603200000 },
-      "66": { date: 1578355200000 },
+      "66": {},
       "67": { date: 1583193600000 },
       "68": { date: 1587513600000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:319:13
       "66": { date: 1578355200000 },
       "67": { date: 1583193600000 },
       "68": { date: 1587513600000 },
-      "69": { date: 1592956800000 },
+      "69": {},
       "70": { date: 1595808000000 },
       "71": { date: 1600128000000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:320:13
       "67": { date: 1583193600000 },
       "68": { date: 1587513600000 },
       "69": { date: 1592956800000 },
-      "70": { date: 1595808000000 },
+      "70": {},
       "71": { date: 1600128000000 },
       "72": { date: 1603238400000 },
