[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:323:13
       "70": { date: 1595808000000 },
       "71": { date: 1600128000000 },
       "72": { date: 1603238400000 },
-      "73": { date: 1607472000000 },
+      "73": {},
       "74": { date: 1612224000000 },
     },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:330:14
   safari: {
     releases: {
       "1": { date: 1056326400000 },
-      "1.1": { date: 1066953600000 },
+      "1.1": {},
       "1.2": { date: 1075680000000 },
       "1.3": { date: 1113523200000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:333:12
       "1.1": { date: 1066953600000 },
       "1.2": { date: 1075680000000 },
       "1.3": { date: 1113523200000 },
-      "2": { date: 1114732800000 },
+      "2": {},
       "3": { date: 1194998400000 },
       "3.1": { date: 1205798400000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:335:14
       "1.3": { date: 1113523200000 },
       "2": { date: 1114732800000 },
       "3": { date: 1194998400000 },
-      "3.1": { date: 1205798400000 },
+      "3.1": {},
       "3.2": { date: 1226534400000 },
       "4": { date: 1244419200000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:339:14
       "3.2": { date: 1226534400000 },
       "4": { date: 1244419200000 },
       "5": { date: 1275868800000 },
-      "5.1": { date: 1311120000000 },
+      "5.1": {},
       "6": { date: 1343174400000 },
       "6.1": { date: 1370908800000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:344:12
       "6.1": { date: 1370908800000 },
       "7": { date: 1382400000000 },
       "8": { date: 1413417600000 },
-      "9": { date: 1443571200000 },
+      "9": {},
       "9.1": { date: 1458518400000 },
       "10": { date: 1474329600000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:345:14
       "7": { date: 1382400000000 },
       "8": { date: 1413417600000 },
       "9": { date: 1443571200000 },
-      "9.1": { date: 1458518400000 },
+      "9.1": {},
       "10": { date: 1474329600000 },
       "10.1": { date: 1490572800000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:349:15
       "10": { date: 1474329600000 },
       "10.1": { date: 1490572800000 },
       "11": { date: 1505779200000 },
-      "11.1": { date: 1523491200000 },
+      "11.1": {},
       "12": { date: 1537747200000 },
       "12.1": { date: 1553472000000 },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:353:15
       "12": { date: 1537747200000 },
       "12.1": { date: 1553472000000 },
       "13": { date: 1568851200000 },
-      "13.1": { date: 1585008000000 },
+      "13.1": {},
       "14": { date: 1600214400000 },
     },

[Survived] ObjectLiteral
alfa-compatibility/src/browser/data.ts:354:13
       "12.1": { date: 1553472000000 },
       "13": { date: 1568851200000 },
       "13.1": { date: 1585008000000 },
-      "14": { date: 1600214400000 },
+      "14": {},
     },
   },
