[Survived] ObjectLiteral
alfa-compatibility/src/feature/data.ts:16:14
  */
 export const Features = {
   "css.properties.border-radius": {
-    support: {
-      chrome: {
-        added: "4" as const,
-      },
-      edge: {
-        added: "12" as const,
-      },
-      firefox: {
-        added: "4" as const,
-      },
-      ie: {
-        added: "9" as const,
-      },
-      opera: {
-        added: "10.5" as const,
-      },
-      safari: {
-        added: "5" as const,
-      },
-    },
+    support: {},
   },
   "css.properties.border-radius.4_values_for_4_corners": {

[Survived] ObjectLiteral
alfa-compatibility/src/feature/data.ts:26:11
       firefox: {
         added: "4" as const,
       },
-      ie: {
-        added: "9" as const,
-      },
+      ie: {},
       opera: {
         added: "10.5" as const,

[Survived] ObjectLiteral
alfa-compatibility/src/feature/data.ts:60:14
     },
   },
   "css.properties.border-radius.elliptical_borders": {
-    support: {
-      chrome: {
-        added: "1" as const,
-      },
-      edge: {
-        added: "12" as const,
-      },
-      firefox: {
-        added: "4" as const,
-      },
-      ie: {
-        added: "9" as const,
-      },
-      opera: {
-        added: "10.5" as const,
-      },
-      safari: {
-        added: "3" as const,
-      },
-    },
+    support: {},
   },
   "css.properties.border-radius.percentages": {

[Survived] ObjectLiteral
alfa-compatibility/src/feature/data.ts:82:14
     },
   },
   "css.properties.border-radius.percentages": {
-    support: {
-      chrome: {
-        added: "8" as const,
-      },
-      edge: {
-        added: "12" as const,
-      },
-      firefox: {
-        added: "4" as const,
-      },
-      ie: {
-        added: "9" as const,
-      },
-      opera: {
-        added: "11.5" as const,
-      },
-      safari: {
-        added: "5.1" as const,
-      },
-    },
+    support: {},
   },
   "css.properties.color": {

[Survived] ObjectLiteral
alfa-compatibility/src/feature/data.ts:114:11
       firefox: {
         added: "1" as const,
       },
-      ie: {
-        added: "3" as const,
-      },
+      ie: {},
       opera: {
         added: "3.5" as const,

[Survived] ObjectLiteral
alfa-compatibility/src/feature/data.ts:211:14
     },
   },
   "css.types.color.alpha_hexadecimal_notation": {
-    support: {
-      chrome: {
-        added: "62" as const,
-      },
-      edge: {
-        added: "79" as const,
-      },
-      firefox: {
-        added: "49" as const,
-      },
-      opera: {
-        added: "49" as const,
-      },
-      safari: {
-        added: "9.1" as const,
-      },
-    },
+    support: {},
   },
   "css.types.color.currentcolor": {

[Survived] ObjectLiteral
alfa-compatibility/src/feature/data.ts:230:14
     },
   },
   "css.types.color.currentcolor": {
-    support: {
-      chrome: {
-        added: "1" as const,
-      },
-      edge: {
-        added: "12" as const,
-      },
-      firefox: {
-        added: "1.5" as const,
-      },
-      ie: {
-        added: "9" as const,
-      },
-      opera: {
-        added: "9.5" as const,
-      },
-      safari: {
-        added: "4" as const,
-      },
-    },
+    support: {},
   },
   "css.types.color.floats_in_rgb_rgba": {

[Survived] ObjectLiteral
alfa-compatibility/src/feature/data.ts:271:14
     },
   },
   "css.types.color.hsl": {
-    support: {
-      chrome: {
-        added: "1" as const,
-      },
-      edge: {
-        added: "12" as const,
-      },
-      firefox: {
-        added: "1" as const,
-      },
-      ie: {
-        added: "9" as const,
-      },
-      opera: {
-        added: "9.5" as const,
-      },
-      safari: {
-        added: "3.1" as const,
-      },
-    },
+    support: {},
   },
   "css.types.color.hsl_function_accepts_alpha": {

[Survived] ObjectLiteral
alfa-compatibility/src/feature/data.ts:312:14
     },
   },
   "css.types.color.keyword_color_values": {
-    support: {
-      chrome: {
-        added: "1" as const,
-      },
-      edge: {
-        added: "12" as const,
-      },
-      firefox: {
-        added: "1" as const,
-      },
-      ie: {
-        added: "3" as const,
-      },
-      opera: {
-        added: "3.5" as const,
-      },
-      safari: {
-        added: "1" as const,
-      },
-    },
+    support: {},
   },
   "css.types.color.rebeccapurple": {

[Survived] ObjectLiteral
alfa-compatibility/src/feature/data.ts:344:11
       firefox: {
         added: "33" as const,
       },
-      ie: {
-        added: "11" as const,
-      },
+      ie: {},
       opera: {
         added: "25" as const,

[Survived] ObjectLiteral
alfa-compatibility/src/feature/data.ts:375:14
     },
   },
   "css.types.color.rgb_functional_notation": {
-    support: {
-      chrome: {
-        added: "1" as const,
-      },
-      edge: {
-        added: "12" as const,
-      },
-      firefox: {
-        added: "1" as const,
-      },
-      ie: {
-        added: "4" as const,
-      },
-      opera: {
-        added: "3.5" as const,
-      },
-      safari: {
-        added: "1" as const,
-      },
-    },
+    support: {},
   },
   "css.types.color.rgb_hexadecimal_notation": {

[Survived] ObjectLiteral
alfa-compatibility/src/feature/data.ts:419:14
     },
   },
   "css.types.color.space_separated_functional_notation": {
-    support: {
-      chrome: {
-        added: "65" as const,
-      },
-      edge: {
-        added: "79" as const,
-      },
-      firefox: {
-        added: "52" as const,
-      },
-      opera: {
-        added: "52" as const,
-      },
-      safari: {
-        added: "12.1" as const,
-      },
-    },
+    support: {},
   },
   "css.types.color.transparent": {
