[Killed] BlockStatement
packages/alfa-cascade/src/ancestor-filter.ts:80:38
 
   private constructor() {}
 
-  public add(element: Element): void {
-    for (const id of element.id) {
-      this._ids.add(id);
-    }
-
-    this._types.add(element.name);
-
-    for (const className of element.classes) {
-      this._classes.add(className);
-    }
-  }
+  public add(element: Element): void {}
 
   public remove(element: Element): void {
killedBy: All tests
statusReason: packages/alfa-cascade/test/ancestor-filter.spec.js(73,7): Ancestor filter behaves as expected

Expected values to be strictly deep-equal:
+ actual - expected

  {
    classes: [],
    ids: [],

[Killed] BlockStatement
packages/alfa-cascade/src/ancestor-filter.ts:81:34
   private constructor() {}
 
   public add(element: Element): void {
-    for (const id of element.id) {
-      this._ids.add(id);
-    }
+    for (const id of element.id) {}
 
     this._types.add(element.name);
killedBy: All tests
statusReason: packages/alfa-cascade/test/ancestor-filter.spec.js(73,7): Ancestor filter behaves as expected

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    classes: [
...

[Killed] BlockStatement
packages/alfa-cascade/src/ancestor-filter.ts:87:46
 
     this._types.add(element.name);
 
-    for (const className of element.classes) {
-      this._classes.add(className);
-    }
+    for (const className of element.classes) {}
   }
 
killedBy: All tests
statusReason: packages/alfa-cascade/test/ancestor-filter.spec.js(73,7): Ancestor filter behaves as expected

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
+   classes: [],
-   classes: [

[Killed] BlockStatement
packages/alfa-cascade/src/ancestor-filter.ts:92:41
     }
   }
 
-  public remove(element: Element): void {
-    for (const id of element.id) {
-      this._ids.remove(id);
-    }
-
-    this._types.remove(element.name);
-
-    for (const className of element.classes) {
-      this._classes.remove(className);
-    }
-  }
+  public remove(element: Element): void {}
 
   /**
killedBy: All tests
statusReason: packages/alfa-cascade/test/ancestor-filter.spec.js(73,7): Ancestor filter behaves as expected

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    classes: [
...

[Killed] BlockStatement
packages/alfa-cascade/src/ancestor-filter.ts:93:34
   }
 
   public remove(element: Element): void {
-    for (const id of element.id) {
-      this._ids.remove(id);
-    }
+    for (const id of element.id) {}
 
     this._types.remove(element.name);
killedBy: All tests
statusReason: packages/alfa-cascade/test/ancestor-filter.spec.js(73,7): Ancestor filter behaves as expected

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    classes: [
...

[Killed] BlockStatement
packages/alfa-cascade/src/ancestor-filter.ts:99:46
 
     this._types.remove(element.name);
 
-    for (const className of element.classes) {
-      this._classes.remove(className);
-    }
+    for (const className of element.classes) {}
   }
 
killedBy: All tests
statusReason: packages/alfa-cascade/test/ancestor-filter.spec.js(73,7): Ancestor filter behaves as expected

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    classes: [
      [

[Killed] BlockStatement
packages/alfa-cascade/src/ancestor-filter.ts:108:28
    * @internal
    */
   public matches(selector: Simple): boolean {
-    if (Id.isId(selector)) {
-      return this._ids.has(selector.name);
-    }
+    if (Id.isId(selector)) {}
 
     if (Class.isClass(selector)) {
killedBy: All tests
statusReason: packages/alfa-cascade/test/ancestor-filter.spec.js(82,11): Ancestor filter behaves as expected

Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
packages/alfa-cascade/src/ancestor-filter.ts:112:34
       return this._ids.has(selector.name);
     }
 
-    if (Class.isClass(selector)) {
-      return this._classes.has(selector.name);
-    }
+    if (Class.isClass(selector)) {}
 
     if (Type.isType(selector)) {
killedBy: All tests
statusReason: packages/alfa-cascade/test/ancestor-filter.spec.js(82,11): Ancestor filter behaves as expected

Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
packages/alfa-cascade/src/ancestor-filter.ts:116:32
       return this._classes.has(selector.name);
     }
 
-    if (Type.isType(selector)) {
-      return this._types.has(selector.name);
-    }
+    if (Type.isType(selector)) {}
 
     return false;
killedBy: All tests
statusReason: packages/alfa-cascade/test/ancestor-filter.spec.js(82,11): Ancestor filter behaves as expected

Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
packages/alfa-cascade/src/ancestor-filter.ts:128:80
    */
   public canReject(selector: Selector): boolean {
     // If the selector is a simple selector, it must be in the filter in order to match.
-    if (Id.isId(selector) || Class.isClass(selector) || Type.isType(selector)) {
-      return !this.matches(selector);
-    }
+    if (Id.isId(selector) || Class.isClass(selector) || Type.isType(selector)) {}
 
     // If the selector is a compound selector, each of its component must be in
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(203,7): #get() respects ancestor filter

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] LogicalOperator
packages/alfa-cascade/src/ancestor-filter.ts:128:9
    */
   public canReject(selector: Selector): boolean {
     // If the selector is a simple selector, it must be in the filter in order to match.
-    if (Id.isId(selector) || Class.isClass(selector) || Type.isType(selector)) {
+    if ((Id.isId(selector) || Class.isClass(selector)) && Type.isType(selector)) {
       return !this.matches(selector);
     }
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(203,7): #get() respects ancestor filter

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] BooleanLiteral
packages/alfa-cascade/src/ancestor-filter.ts:129:14
   public canReject(selector: Selector): boolean {
     // If the selector is a simple selector, it must be in the filter in order to match.
     if (Id.isId(selector) || Class.isClass(selector) || Type.isType(selector)) {
-      return !this.matches(selector);
+      return this.matches(selector);
     }
 
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(203,7): #get() respects ancestor filter

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Survived] BlockStatement
packages/alfa-cascade/src/ancestor-filter.ts:134:40
 
     // If the selector is a compound selector, each of its component must be in
     // the filter in order to match
-    if (Compound.isCompound(selector)) {
-      // Compound selectors are right-leaning, so recurse to the left first as it
-      // is likely the shortest branch.
-      return Iterable.some(selector.selectors, (selector) =>
-        this.canReject(selector),
-      );
-    }
+    if (Compound.isCompound(selector)) {}
 
     // If the selector is a complex selector with a descendant combinator, rejecting

[Survived] MethodExpression
packages/alfa-cascade/src/ancestor-filter.ts:137:14
     if (Compound.isCompound(selector)) {
       // Compound selectors are right-leaning, so recurse to the left first as it
       // is likely the shortest branch.
-      return Iterable.some(selector.selectors, (selector) =>
-        this.canReject(selector),
-      );
+      return Iterable.every(selector.selectors, selector => this.canReject(selector));
     }
 

[Survived] BlockStatement
packages/alfa-cascade/src/ancestor-filter.ts:145:38
     // If the selector is a complex selector with a descendant combinator, rejecting
     // one side of the combinator is enough to reject the full selector.
     // Sibling combinator are not handled by ancestor filters.
-    if (Complex.isComplex(selector)) {
-      const { combinator } = selector;
-
-      if (
-        combinator === Combinator.Descendant ||
-        combinator === Combinator.DirectDescendant
-      ) {
-        // Complex selectors are left-leaning, so recurse to the right first as it
-        // is likely the shortest branch.
-        return this.canReject(selector.right) || this.canReject(selector.left);
-      }
-    }
+    if (Complex.isComplex(selector)) {}
 
     return false;

[Survived] ConditionalExpression
packages/alfa-cascade/src/ancestor-filter.ts:149:9
       const { combinator } = selector;
 
       if (
-        combinator === Combinator.Descendant ||
+        false ||
         combinator === Combinator.DirectDescendant
       ) {

[Survived] ConditionalExpression
packages/alfa-cascade/src/ancestor-filter.ts:149:9
       const { combinator } = selector;
 
       if (
-        combinator === Combinator.Descendant ||
-        combinator === Combinator.DirectDescendant
+        true
       ) {
         // Complex selectors are left-leaning, so recurse to the right first as it

[Survived] EqualityOperator
packages/alfa-cascade/src/ancestor-filter.ts:150:9
 
       if (
         combinator === Combinator.Descendant ||
-        combinator === Combinator.DirectDescendant
+        combinator !== Combinator.DirectDescendant
       ) {
         // Complex selectors are left-leaning, so recurse to the right first as it

[Survived] ConditionalExpression
packages/alfa-cascade/src/ancestor-filter.ts:150:9
 
       if (
         combinator === Combinator.Descendant ||
-        combinator === Combinator.DirectDescendant
+        false
       ) {
         // Complex selectors are left-leaning, so recurse to the right first as it

[Survived] BlockStatement
packages/alfa-cascade/src/ancestor-filter.ts:151:9
       if (
         combinator === Combinator.Descendant ||
         combinator === Combinator.DirectDescendant
-      ) {
-        // Complex selectors are left-leaning, so recurse to the right first as it
-        // is likely the shortest branch.
-        return this.canReject(selector.right) || this.canReject(selector.left);
-      }
+      ) {}
     }
 

[Survived] ConditionalExpression
packages/alfa-cascade/src/ancestor-filter.ts:154:16
       ) {
         // Complex selectors are left-leaning, so recurse to the right first as it
         // is likely the shortest branch.
-        return this.canReject(selector.right) || this.canReject(selector.left);
+        return true;
       }
     }

[Survived] ConditionalExpression
packages/alfa-cascade/src/ancestor-filter.ts:154:16
       ) {
         // Complex selectors are left-leaning, so recurse to the right first as it
         // is likely the shortest branch.
-        return this.canReject(selector.right) || this.canReject(selector.left);
+        return false;
       }
     }

[Killed] BlockStatement
packages/alfa-cascade/src/ancestor-filter.ts:214:35
     return this._entries.has(entry);
   }
 
-  public add(entry: string): void {
-    const count = this._entries.get(entry);
-
-    if (count === undefined) {
-      this._entries.set(entry, 1);
-    } else {
-      this._entries.set(entry, count + 1);
-    }
-  }
+  public add(entry: string): void {}
 
   public remove(entry: string): void {
killedBy: All tests
statusReason: packages/alfa-cascade/test/ancestor-filter.spec.js(13,7): Buckets behave as expected

Expected values to be strictly deep-equal:
+ actual - expected

+ []
- [
-   [

[Killed] BlockStatement
packages/alfa-cascade/src/ancestor-filter.ts:217:30
   public add(entry: string): void {
     const count = this._entries.get(entry);
 
-    if (count === undefined) {
-      this._entries.set(entry, 1);
-    } else {
+    if (count === undefined) {} else {
       this._entries.set(entry, count + 1);
     }
killedBy: All tests
statusReason: packages/alfa-cascade/test/ancestor-filter.spec.js(13,7): Buckets behave as expected

Expected values to be strictly deep-equal:
+ actual - expected

+ []
- [
-   [

[Killed] BlockStatement
packages/alfa-cascade/src/ancestor-filter.ts:219:12
 
     if (count === undefined) {
       this._entries.set(entry, 1);
-    } else {
-      this._entries.set(entry, count + 1);
-    }
+    } else {}
   }
 
killedBy: All tests
statusReason: packages/alfa-cascade/test/ancestor-filter.spec.js(24,7): Buckets behave as expected

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    [
      'a',

[Killed] ArithmeticOperator
packages/alfa-cascade/src/ancestor-filter.ts:220:32
     if (count === undefined) {
       this._entries.set(entry, 1);
     } else {
-      this._entries.set(entry, count + 1);
+      this._entries.set(entry, count - 1);
     }
   }
killedBy: All tests
statusReason: packages/alfa-cascade/test/ancestor-filter.spec.js(24,7): Buckets behave as expected

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    [
      'a',

[Killed] BlockStatement
packages/alfa-cascade/src/ancestor-filter.ts:224:38
     }
   }
 
-  public remove(entry: string): void {
-    const count = this._entries.get(entry);
-
-    if (count === undefined) {
-      return;
-    }
-
-    if (count === 1) {
-      this._entries.delete(entry);
-    } else {
-      this._entries.set(entry, count - 1);
-    }
-  }
+  public remove(entry: string): void {}
 
   public toJSON(): Bucket.JSON {
killedBy: All tests
statusReason: packages/alfa-cascade/test/ancestor-filter.spec.js(38,7): Buckets behave as expected

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    [
      'a',

[Killed] EqualityOperator
packages/alfa-cascade/src/ancestor-filter.ts:231:9
       return;
     }
 
-    if (count === 1) {
+    if (count !== 1) {
       this._entries.delete(entry);
     } else {
killedBy: All tests
statusReason: packages/alfa-cascade/test/ancestor-filter.spec.js(38,7): Buckets behave as expected

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
-   [
-     'a',

[Killed] ConditionalExpression
packages/alfa-cascade/src/ancestor-filter.ts:231:9
       return;
     }
 
-    if (count === 1) {
+    if (false) {
       this._entries.delete(entry);
     } else {
killedBy: All tests
statusReason: packages/alfa-cascade/test/ancestor-filter.spec.js(52,7): Buckets behave as expected

Expected values to be strictly deep-equal:
+ actual - expected

  [
    [
      'a',

[Killed] BlockStatement
packages/alfa-cascade/src/ancestor-filter.ts:233:12
 
     if (count === 1) {
       this._entries.delete(entry);
-    } else {
-      this._entries.set(entry, count - 1);
-    }
+    } else {}
   }
 
killedBy: All tests
statusReason: packages/alfa-cascade/test/ancestor-filter.spec.js(38,7): Buckets behave as expected

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    [
      'a',

[Killed] ArithmeticOperator
packages/alfa-cascade/src/ancestor-filter.ts:234:32
     if (count === 1) {
       this._entries.delete(entry);
     } else {
-      this._entries.set(entry, count - 1);
+      this._entries.set(entry, count + 1);
     }
   }
killedBy: All tests
statusReason: packages/alfa-cascade/test/ancestor-filter.spec.js(38,7): Buckets behave as expected

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    [
      'a',
