[Survived] UnaryOperator
packages/alfa-cascade/src/block.ts:69:22
     [],
     {
       origin: Origin.NormalUserAgent,
-      encapsulation: -1 /* outermost normal */,
+      encapsulation: +1 /* outermost normal */,
       isElementAttached: false,
       specificity: Specificity.empty(),

[Survived] BooleanLiteral
packages/alfa-cascade/src/block.ts:70:26
     {
       origin: Origin.NormalUserAgent,
       encapsulation: -1 /* outermost normal */,
-      isElementAttached: false,
+      isElementAttached: true,
       specificity: Specificity.empty(),
       order: -Infinity,

[Survived] UnaryOperator
packages/alfa-cascade/src/block.ts:72:14
       encapsulation: -1 /* outermost normal */,
       isElementAttached: false,
       specificity: Specificity.empty(),
-      order: -Infinity,
+      order: +Infinity,
     },
   );

[Survived] ConditionalExpression
packages/alfa-cascade/src/block.ts:118:12
 
   /** @public (knip) */
   public get source(): S {
-    return this._owner !== null
+    return true
       ? (this._owner as unknown as S)
       : // By construction if owner is unset, then rule and selector are set.

[Survived] ConditionalExpression
packages/alfa-cascade/src/block.ts:118:12
 
   /** @public (knip) */
   public get source(): S {
-    return this._owner !== null
+    return false
       ? (this._owner as unknown as S)
       : // By construction if owner is unset, then rule and selector are set.

[Survived] ConditionalExpression
packages/alfa-cascade/src/block.ts:153:7
 
   public equals(value: unknown): boolean {
     return (
-      value instanceof Block &&
-      Equatable.equals(value._rule, this._rule) &&
-      Equatable.equals(value._selector, this._selector) &&
-      Equatable.equals(value._owner, this._owner) &&
-      Array.equals(value._declarations, this._declarations) &&
-      Precedence.compare(value._precedence, this._precedence) ===
-        Comparison.Equal
+      true
     );
   }

[Survived] ConditionalExpression
packages/alfa-cascade/src/block.ts:153:7
 
   public equals(value: unknown): boolean {
     return (
-      value instanceof Block &&
-      Equatable.equals(value._rule, this._rule) &&
-      Equatable.equals(value._selector, this._selector) &&
-      Equatable.equals(value._owner, this._owner) &&
-      Array.equals(value._declarations, this._declarations) &&
-      Precedence.compare(value._precedence, this._precedence) ===
-        Comparison.Equal
+      false
     );
   }

[Survived] EqualityOperator
packages/alfa-cascade/src/block.ts:158:7
       Equatable.equals(value._selector, this._selector) &&
       Equatable.equals(value._owner, this._owner) &&
       Array.equals(value._declarations, this._declarations) &&
-      Precedence.compare(value._precedence, this._precedence) ===
-        Comparison.Equal
+      Precedence.compare(value._precedence, this._precedence) !== Comparison.Equal
     );
   }

[Survived] ConditionalExpression
packages/alfa-cascade/src/block.ts:158:7
       Equatable.equals(value._selector, this._selector) &&
       Equatable.equals(value._owner, this._owner) &&
       Array.equals(value._declarations, this._declarations) &&
-      Precedence.compare(value._precedence, this._precedence) ===
-        Comparison.Equal
+      true
     );
   }

[Killed] UpdateOperator
packages/alfa-cascade/src/block.ts:231:7
 
     for (const [_, selectors] of Selector.parse(Lexer.lex(rule.selector))) {
       // The selector was parsed successfully, so blocks will be created, and we need to update order.
-      order++;
+      order--;
 
       for (const [importance, declarations] of Iterable.groupBy(
killedBy: All tests
statusReason: packages/alfa-cascade/test/block.spec.js(13,7): .from() creates a single block for a simple rule

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    [
...

[Killed] ArrowFunction
packages/alfa-cascade/src/block.ts:235:9
 
       for (const [importance, declarations] of Iterable.groupBy(
         rule.style.declarations,
-        (declaration) => declaration.important,
+        () => undefined,
       )) {
         const origin = rule.owner.includes(UserAgent)
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(80,7): .from() split important and non-important declarations in two blocks

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    classes: [],
...

[Killed] BlockStatement
packages/alfa-cascade/src/block.ts:245:43
             ? Origin.ImportantAuthor
             : Origin.NormalAuthor;
 
-        for (const selector of selectors) {
-          // While we don't really know where the rules will be used, and they all look
-          // "outer" from this point of view, we also know that the shadow rules cannot
-          // match within the current tree, and can only match an encapsulating light tree.
-          // Therefore, for anything that will actually match a shadow selector, the selector
-          // appears as encapsulated.
-          const encapsulation = importance
-            ? // Important declarations have positive encapsulation depth, deeper wins.
-              encapsulationDepth
-            : // Normal declarations have negative encapsulation depth, deeper loses.
-              -encapsulationDepth;
-
-          blocks.push(
-            Block.of({ rule, selector }, declarations, {
-              origin,
-              encapsulation,
-              isElementAttached: false,
-              order,
-              specificity: selector.specificity,
-            }),
-          );
-        }
+        for (const selector of selectors) {}
       }
     }
killedBy: All tests
statusReason: packages/alfa-cascade/test/block.spec.js(13,7): .from() creates a single block for a simple rule

Expected values to be strictly deep-equal:
+ actual - expected

  [
+   [],
-   [

[Killed] UnaryOperator
packages/alfa-cascade/src/block.ts:255:15
             ? // Important declarations have positive encapsulation depth, deeper wins.
               encapsulationDepth
             : // Normal declarations have negative encapsulation depth, deeper loses.
-              -encapsulationDepth;
+              +encapsulationDepth;
 
           blocks.push(
killedBy: All tests
statusReason: packages/alfa-cascade/test/block.spec.js(13,7): .from() creates a single block for a simple rule

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    [
...

[Killed] BooleanLiteral
packages/alfa-cascade/src/block.ts:261:34
             Block.of({ rule, selector }, declarations, {
               origin,
               encapsulation,
-              isElementAttached: false,
+              isElementAttached: true,
               order,
               specificity: selector.specificity,
killedBy: All tests
statusReason: packages/alfa-cascade/test/block.spec.js(13,7): .from() creates a single block for a simple rule

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    [
...

[Killed] ArrowFunction
packages/alfa-cascade/src/block.ts:286:13
         Iterable.map(
           Iterable.groupBy(
             style.declarations,
-            (declaration) => declaration.important,
+            () => undefined,
           ),
           ([importance, declarations]) =>
killedBy: All tests
statusReason: packages/alfa-cascade/test/block.spec.js(185,7): .fromStyle() creates blocks for a style attribute

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] UnaryOperator
packages/alfa-cascade/src/block.ts:295:19
                 ? // Important declarations have positive encapsulation depth, deeper wins.
                   encapsulationDepth
                 : // Normal declarations have negative encapsulation depth, deeper loses.
-                  -encapsulationDepth,
+                  +encapsulationDepth,
               isElementAttached: true,
               specificity: Specificity.empty(),
killedBy: All tests
statusReason: packages/alfa-cascade/test/block.spec.js(185,7): .fromStyle() creates blocks for a style attribute

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] BooleanLiteral
packages/alfa-cascade/src/block.ts:296:34
                   encapsulationDepth
                 : // Normal declarations have negative encapsulation depth, deeper loses.
                   -encapsulationDepth,
-              isElementAttached: true,
+              isElementAttached: false,
               specificity: Specificity.empty(),
               // Since style attribute trumps style rules in the cascade sort,
killedBy: All tests
statusReason: packages/alfa-cascade/test/block.spec.js(185,7): .fromStyle() creates blocks for a style attribute

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] UnaryOperator
packages/alfa-cascade/src/block.ts:301:22
               // Since style attribute trumps style rules in the cascade sort,
               // and there is at most one style attribute per element,
               // the order never matters.
-              order: -1,
+              order: +1,
             }),
         ),
killedBy: All tests
statusReason: packages/alfa-cascade/test/block.spec.js(185,7): .fromStyle() creates blocks for a style attribute

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...
