[Killed] ArrayDeclaration
packages/alfa-cascade/src/cascade.ts:71:7
     this._depth = getDepth(root);
     this._device = device;
     this._selectors = SelectorMap.from(
-      [UserAgent, ...root.style],
+      [],
       device,
       this._depth,
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(18,7): .from() builds a cascade with the User Agent style sheet

Expected values to be strictly deep-equal:

0 !== 96

[Killed] BlockStatement
packages/alfa-cascade/src/cascade.ts:85:41
 
     const filter = AncestorFilter.empty();
 
-    const visit = (node: Node): void => {
-      if (Element.isElement(node)) {
-        // Entering an element: add it to the rule tree, and to the ancestor filter.
-        this._entries
-          .get(node, Cache.empty)
-          .get(context, () => this.add(node, context, filter));
-        filter.add(node);
-      }
-
-      for (const child of node.children()) {
-        visit(child);
-      }
-
-      if (Element.isElement(node)) {
-        // Exiting an element: remove it from the ancestor filter.
-        filter.remove(node);
-      }
-    };
+    const visit = (node: Node): void => {};
 
     visit(root);
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(136,7): .get() fetches `:host-context` rules from shadow, when relevant.

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
...

[Killed] BlockStatement
packages/alfa-cascade/src/cascade.ts:86:36
     const filter = AncestorFilter.empty();
 
     const visit = (node: Node): void => {
-      if (Element.isElement(node)) {
-        // Entering an element: add it to the rule tree, and to the ancestor filter.
-        this._entries
-          .get(node, Cache.empty)
-          .get(context, () => this.add(node, context, filter));
-        filter.add(node);
-      }
+      if (Element.isElement(node)) {}
 
       for (const child of node.children()) {
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(136,7): .get() fetches `:host-context` rules from shadow, when relevant.

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
...

[Killed] BlockStatement
packages/alfa-cascade/src/cascade.ts:94:44
         filter.add(node);
       }
 
-      for (const child of node.children()) {
-        visit(child);
-      }
+      for (const child of node.children()) {}
 
       if (Element.isElement(node)) {
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(136,7): .get() fetches `:host-context` rules from shadow, when relevant.

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
...

[Survived] BlockStatement
packages/alfa-cascade/src/cascade.ts:98:36
         visit(child);
       }
 
-      if (Element.isElement(node)) {
-        // Exiting an element: remove it from the ancestor filter.
-        filter.remove(node);
-      }
+      if (Element.isElement(node)) {}
     };
 

[Killed] BlockStatement
packages/alfa-cascade/src/cascade.ts:243:32
     // If this is a Shadow root, get the depth of its host and increase
     // it. If it is not hosted, it has the minimum depth of 1 (0 is not
     // used to allow for negative/positive trick).
-    if (Shadow.isShadow(node)) {
-      return 1 + node.host.map(getDepth).getOr(0);
-    }
+    if (Shadow.isShadow(node)) {}
 
     // If it is slotted, jump to the slot. Otherwise, go to the parent.
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(90,7): .get() fetches `:host` rules from shadow, when relevant.

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
...

[Killed] ArithmeticOperator
packages/alfa-cascade/src/cascade.ts:244:14
     // it. If it is not hosted, it has the minimum depth of 1 (0 is not
     // used to allow for negative/positive trick).
     if (Shadow.isShadow(node)) {
-      return 1 + node.host.map(getDepth).getOr(0);
+      return 1 - node.host.map(getDepth).getOr(0);
     }
 
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(90,7): .get() fetches `:host` rules from shadow, when relevant.

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
...

[Killed] BlockStatement
packages/alfa-cascade/src/cascade.ts:249:36
 
     // If it is slotted, jump to the slot. Otherwise, go to the parent.
     // If there is no parent, we've reached the root and the depth is 1.
-    if (Slotable.isSlotable(node)) {
-      return node
-        .assignedSlot()
-        .map(getDepth)
-        .getOr(node.parent().map(getDepth).getOr(1));
-    }
+    if (Slotable.isSlotable(node)) {}
 
     // Otherwise, just go to the parent, if none, this is the toplevel root.
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(252,7): .get() correctly sort rules from different depths.

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
...
