[Killed] BlockStatement
packages/alfa-cascade/src/rule-tree.ts:112:66
   public add(rules: Iterable<Block>): RuleTree.Node {
     let parent = this._root;
 
-    for (const block of Iterable.sortWith(rules, Block.compare)) {
-      // Insert the next rule into the current parent, using the returned rule
-      // entry as the parent of the next rule to insert. This way, we gradually
-      // build up a path of rule entries and then return the final entry to the
-      // caller.
-      parent = parent.add(block);
-    }
+    for (const block of Iterable.sortWith(rules, Block.compare)) {}
 
     return parent;
killedBy: All tests
statusReason: packages/alfa-cascade/test/rule-tree.spec.js(74,7): .add() creates a single branch in the rule tree

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

+ []
...
- [

[Killed] BlockStatement
packages/alfa-cascade/src/rule-tree.ts:169:41
       return this._parent;
     }
 
-    public *ancestors(): Iterable<Node> {
-      for (const parent of this._parent) {
-        yield parent;
-        yield* parent.ancestors();
-      }
-    }
+    public *ancestors(): Iterable<Node> {}
 
     public *inclusiveAncestors(): Iterable<Node> {
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(59,7): .get() returns the rule tree node of the given element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

+ undefined
...
- {

[Killed] BlockStatement
packages/alfa-cascade/src/rule-tree.ts:170:42
     }
 
     public *ancestors(): Iterable<Node> {
-      for (const parent of this._parent) {
-        yield parent;
-        yield* parent.ancestors();
-      }
+      for (const parent of this._parent) {}
     }
 
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(59,7): .get() returns the rule tree node of the given element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

+ undefined
...
- {

[Killed] BlockStatement
packages/alfa-cascade/src/rule-tree.ts:176:50
       }
     }
 
-    public *inclusiveAncestors(): Iterable<Node> {
-      yield this;
-      yield* this.ancestors();
-    }
+    public *inclusiveAncestors(): Iterable<Node> {}
 
     /**
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(59,7): .get() returns the rule tree node of the given element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

+ undefined
...
- {

[Killed] EqualityOperator
packages/alfa-cascade/src/rule-tree.ts:206:9
       if (
         // We cannot simply test === between the .selector because we do not
         // want to identify two null.
-        (this._block.selector ?? 0) === (block.selector ?? 1)
+        // We cannot simply test === between the .selector because we do not
+// want to identify two null.
+(this._block.selector ?? 0) !== (block.selector ?? 1)
       ) {
         return this;
killedBy: All tests
statusReason: packages/alfa-cascade/test/rule-tree.spec.js(45,7): .add() doesn't change a tree that already has the exact same selector

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
...

[Killed] ConditionalExpression
packages/alfa-cascade/src/rule-tree.ts:206:9
       if (
         // We cannot simply test === between the .selector because we do not
         // want to identify two null.
-        (this._block.selector ?? 0) === (block.selector ?? 1)
+        false
       ) {
         return this;
killedBy: All tests
statusReason: packages/alfa-cascade/test/rule-tree.spec.js(45,7): .add() doesn't change a tree that already has the exact same selector

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
...

[Killed] BlockStatement
packages/alfa-cascade/src/rule-tree.ts:207:9
         // We cannot simply test === between the .selector because we do not
         // want to identify two null.
         (this._block.selector ?? 0) === (block.selector ?? 1)
-      ) {
-        return this;
-      }
+      ) {}
 
       // Otherwise, if there is a child with an identical but separate selector,
killedBy: All tests
statusReason: packages/alfa-cascade/test/rule-tree.spec.js(45,7): .add() doesn't change a tree that already has the exact same selector

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
...

[Killed] BlockStatement
packages/alfa-cascade/src/rule-tree.ts:216:43
       // This happens, e.g., when encountering two ".foo" selectors. They are
       // then sorted by order of appearance (by assumption) and the later must
       // be a descendant of the former as it has higher precedence.
-      for (const child of this._children) {
-        if (
-          // We cannot simply test .equals between the .selector because we do not
-          // want to identify two None.
-          child._block.selector !== null &&
-          child._block.selector.equals(block.selector)
-        ) {
-          return child.add(block);
-        }
-      }
+      for (const child of this._children) {}
 
       // Otherwise, the selector is brand new (for this branch of the tree).
killedBy: All tests
statusReason: packages/alfa-cascade/test/rule-tree.spec.js(119,7): .add() share branches as long as selectors are the same

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] ConditionalExpression
packages/alfa-cascade/src/rule-tree.ts:220:11
         if (
           // We cannot simply test .equals between the .selector because we do not
           // want to identify two None.
-          child._block.selector !== null &&
-          child._block.selector.equals(block.selector)
+          true
         ) {
           return child.add(block);
killedBy: All tests
statusReason: packages/alfa-cascade/test/rule-tree.spec.js(100,7): .add() creates separate trees for entries that don't share initial selectors

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] ConditionalExpression
packages/alfa-cascade/src/rule-tree.ts:220:11
         if (
           // We cannot simply test .equals between the .selector because we do not
           // want to identify two None.
-          child._block.selector !== null &&
-          child._block.selector.equals(block.selector)
+          false
         ) {
           return child.add(block);
killedBy: All tests
statusReason: packages/alfa-cascade/test/rule-tree.spec.js(119,7): .add() share branches as long as selectors are the same

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] BlockStatement
packages/alfa-cascade/src/rule-tree.ts:222:11
           // want to identify two None.
           child._block.selector !== null &&
           child._block.selector.equals(block.selector)
-        ) {
-          return child.add(block);
-        }
+        ) {}
       }
 
killedBy: All tests
statusReason: packages/alfa-cascade/test/rule-tree.spec.js(119,7): .add() share branches as long as selectors are the same

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...
