[Killed] BlockStatement
packages/alfa-cascade/src/selector-map.ts:127:38
   ): Iterable<Block<Block.Source>> {
     function* collect(
       candidates: Iterable<Block<Block.Source>>,
-    ): Iterable<Block<Block.Source>> {
-      for (const block of candidates) {
-        // If the ancestor filter can reject the selector, escape
-        if (
-          isDescendantSelector(block.selector) &&
-          filter.canReject(block.selector.left)
-        ) {
-          continue;
-        }
-
-        // otherwise, do the actual match.
-        if (block.selector.matches(element, context)) {
-          yield block;
-        }
-      }
-    }
+    ): Iterable<Block<Block.Source>> {}
 
     for (const id of element.id) {
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(180,7): #get() returns all blocks whose selector match an element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

+ []
...
- [

[Killed] BlockStatement
packages/alfa-cascade/src/selector-map.ts:128:39
     function* collect(
       candidates: Iterable<Block<Block.Source>>,
     ): Iterable<Block<Block.Source>> {
-      for (const block of candidates) {
-        // If the ancestor filter can reject the selector, escape
-        if (
-          isDescendantSelector(block.selector) &&
-          filter.canReject(block.selector.left)
-        ) {
-          continue;
-        }
-
-        // otherwise, do the actual match.
-        if (block.selector.matches(element, context)) {
-          yield block;
-        }
-      }
+      for (const block of candidates) {}
     }
 
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(59,7): .get() returns the rule tree node of the given element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

+ undefined
...
- {

[Killed] ConditionalExpression
packages/alfa-cascade/src/selector-map.ts:131:11
       for (const block of candidates) {
         // If the ancestor filter can reject the selector, escape
         if (
-          isDescendantSelector(block.selector) &&
-          filter.canReject(block.selector.left)
+          true
         ) {
           continue;
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(59,7): .get() returns the rule tree node of the given element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

+ undefined
...
- {

[Killed] ConditionalExpression
packages/alfa-cascade/src/selector-map.ts:131:11
       for (const block of candidates) {
         // If the ancestor filter can reject the selector, escape
         if (
-          isDescendantSelector(block.selector) &&
-          filter.canReject(block.selector.left)
+          false
         ) {
           continue;
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(203,7): #get() respects ancestor filter

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] BlockStatement
packages/alfa-cascade/src/selector-map.ts:133:11
         if (
           isDescendantSelector(block.selector) &&
           filter.canReject(block.selector.left)
-        ) {
-          continue;
-        }
+        ) {}
 
         // otherwise, do the actual match.
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(203,7): #get() respects ancestor filter

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] BlockStatement
packages/alfa-cascade/src/selector-map.ts:138:55
         }
 
         // otherwise, do the actual match.
-        if (block.selector.matches(element, context)) {
-          yield block;
-        }
+        if (block.selector.matches(element, context)) {}
       }
     }
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(180,7): #get() returns all blocks whose selector match an element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

+ []
...
- [

[Killed] ConditionalExpression
packages/alfa-cascade/src/selector-map.ts:138:13
         }
 
         // otherwise, do the actual match.
-        if (block.selector.matches(element, context)) {
+        if (false) {
           yield block;
         }
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(180,7): #get() returns all blocks whose selector match an element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

+ []
...
- [

[Survived] BlockStatement
packages/alfa-cascade/src/selector-map.ts:144:34
       }
     }
 
-    for (const id of element.id) {
-      yield* collect(this._ids.get(id));
-    }
+    for (const id of element.id) {}
 
     yield* collect(this._types.get(element.name));

[Killed] BlockStatement
packages/alfa-cascade/src/selector-map.ts:150:46
 
     yield* collect(this._types.get(element.name));
 
-    for (const className of element.classes) {
-      yield* collect(this._classes.get(className));
-    }
+    for (const className of element.classes) {}
 
     yield* collect(this._other);
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(180,7): #get() returns all blocks whose selector match an element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] BlockStatement
packages/alfa-cascade/src/selector-map.ts:172:36
   public *getForHost(
     host: Element,
     context: Context,
-  ): Iterable<Block<Block.Source>> {
-    yield* this._shadow.filter(
-      (block) =>
-        Selector.isHostSelector(block.selector) &&
-        block.selector.matchHost(host, context),
-    );
-  }
+  ): Iterable<Block<Block.Source>> {}
 
   /**
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(227,7): #getForHost() only returns shadow rules

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

+ []
...
- [

[Killed] MethodExpression
packages/alfa-cascade/src/selector-map.ts:173:12
     host: Element,
     context: Context,
   ): Iterable<Block<Block.Source>> {
-    yield* this._shadow.filter(
-      (block) =>
-        Selector.isHostSelector(block.selector) &&
-        block.selector.matchHost(host, context),
-    );
+    yield* this._shadow;
   }
 
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(136,7): .get() fetches `:host-context` rules from shadow, when relevant.

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
+     declarations: [

[Killed] ArrowFunction
packages/alfa-cascade/src/selector-map.ts:174:7
     context: Context,
   ): Iterable<Block<Block.Source>> {
     yield* this._shadow.filter(
-      (block) =>
-        Selector.isHostSelector(block.selector) &&
-        block.selector.matchHost(host, context),
+      () => undefined,
     );
   }
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(227,7): #getForHost() only returns shadow rules

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

+ []
...
- [

[Killed] ConditionalExpression
packages/alfa-cascade/src/selector-map.ts:175:9
   ): Iterable<Block<Block.Source>> {
     yield* this._shadow.filter(
       (block) =>
-        Selector.isHostSelector(block.selector) &&
-        block.selector.matchHost(host, context),
+        false,
     );
   }
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(227,7): #getForHost() only returns shadow rules

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

+ []
...
- [

[Killed] ConditionalExpression
packages/alfa-cascade/src/selector-map.ts:175:9
   ): Iterable<Block<Block.Source>> {
     yield* this._shadow.filter(
       (block) =>
-        Selector.isHostSelector(block.selector) &&
-        block.selector.matchHost(host, context),
+        true,
     );
   }
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(136,7): .get() fetches `:host-context` rules from shadow, when relevant.

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
+     declarations: [

[Survived] BooleanLiteral
packages/alfa-cascade/src/selector-map.ts:194:22
   public *getForSlotted(
     slotted: Element,
     context: Context,
-    debug: boolean = false,
+    debug: boolean = true,
   ): Iterable<Block<Block.Source>> {
     yield* this._shadow.filter((block) => {

[Killed] BlockStatement
packages/alfa-cascade/src/selector-map.ts:195:36
     slotted: Element,
     context: Context,
     debug: boolean = false,
-  ): Iterable<Block<Block.Source>> {
-    yield* this._shadow.filter((block) => {
-      return (
-        Selector.hasSlotted(block.selector) &&
-        Selector.matchSlotted(block.selector, slotted, context)
-      );
-    });
-  }
+  ): Iterable<Block<Block.Source>> {}
 
   public toJSON(): SelectorMap.JSON {
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(188,7): .get() fetches `::slotted` rules from shadow, when relevant.

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

+ undefined
...
- {

[Killed] BlockStatement
packages/alfa-cascade/src/selector-map.ts:196:43
     context: Context,
     debug: boolean = false,
   ): Iterable<Block<Block.Source>> {
-    yield* this._shadow.filter((block) => {
-      return (
-        Selector.hasSlotted(block.selector) &&
-        Selector.matchSlotted(block.selector, slotted, context)
-      );
-    });
+    yield* this._shadow.filter((block) => {});
   }
 
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(188,7): .get() fetches `::slotted` rules from shadow, when relevant.

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

+ undefined
...
- {

[Killed] MethodExpression
packages/alfa-cascade/src/selector-map.ts:196:12
     context: Context,
     debug: boolean = false,
   ): Iterable<Block<Block.Source>> {
-    yield* this._shadow.filter((block) => {
-      return (
-        Selector.hasSlotted(block.selector) &&
-        Selector.matchSlotted(block.selector, slotted, context)
-      );
-    });
+    yield* this._shadow;
   }
 
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(188,7): .get() fetches `::slotted` rules from shadow, when relevant.

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
+     declarations: [

[Killed] ConditionalExpression
packages/alfa-cascade/src/selector-map.ts:198:9
   ): Iterable<Block<Block.Source>> {
     yield* this._shadow.filter((block) => {
       return (
-        Selector.hasSlotted(block.selector) &&
-        Selector.matchSlotted(block.selector, slotted, context)
+        true
       );
     });
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(188,7): .get() fetches `::slotted` rules from shadow, when relevant.

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
+     declarations: [

[Killed] LogicalOperator
packages/alfa-cascade/src/selector-map.ts:198:9
   ): Iterable<Block<Block.Source>> {
     yield* this._shadow.filter((block) => {
       return (
-        Selector.hasSlotted(block.selector) &&
-        Selector.matchSlotted(block.selector, slotted, context)
+        Selector.hasSlotted(block.selector) || Selector.matchSlotted(block.selector, slotted, context)
       );
     });
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(188,7): .get() fetches `::slotted` rules from shadow, when relevant.

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
+     declarations: [

[Killed] BlockStatement
packages/alfa-cascade/src/selector-map.ts:246:55
     const other: Array<Block<Block.Source>> = [];
     const shadow: Array<Block<Block.Source>> = [];
 
-    const add = (block: Block<Block.Source>): void => {
-      const keySelector = block.selector.key;
-
-      if (!keySelector.isSome()) {
-        if (Selector.isShadow(block.selector)) {
-          // These selectors select nodes in the light tree, they are stored
-          // separately and need to be checked when building the cascade of
-          // the hosting tree, not of the same tree.
-          shadow.push(block);
-        } else {
-          other.push(block);
-        }
-      } else {
-        const key = keySelector.get();
-        const buckets = { id: ids, class: classes, type: types };
-        buckets[key.type].add(key.name, block);
-      }
-    };
+    const add = (block: Block<Block.Source>): void => {};
 
     const visit = (rule: Rule) => {
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(22,7): .from() builds a selector map with a single rule

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    classes: [],
    ids: [],

[Killed] BlockStatement
packages/alfa-cascade/src/selector-map.ts:249:34
     const add = (block: Block<Block.Source>): void => {
       const keySelector = block.selector.key;
 
-      if (!keySelector.isSome()) {
-        if (Selector.isShadow(block.selector)) {
-          // These selectors select nodes in the light tree, they are stored
-          // separately and need to be checked when building the cascade of
-          // the hosting tree, not of the same tree.
-          shadow.push(block);
-        } else {
-          other.push(block);
-        }
-      } else {
+      if (!keySelector.isSome()) {} else {
         const key = keySelector.get();
         const buckets = { id: ids, class: classes, type: types };
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(60,7): .from() stores rules in increasing order, amongst all non-disabled sheets

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    classes: [
...

[Killed] BlockStatement
packages/alfa-cascade/src/selector-map.ts:250:48
       const keySelector = block.selector.key;
 
       if (!keySelector.isSome()) {
-        if (Selector.isShadow(block.selector)) {
-          // These selectors select nodes in the light tree, they are stored
-          // separately and need to be checked when building the cascade of
-          // the hosting tree, not of the same tree.
-          shadow.push(block);
-        } else {
+        if (Selector.isShadow(block.selector)) {} else {
           other.push(block);
         }
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(60,7): .from() stores rules in increasing order, amongst all non-disabled sheets

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    classes: [
...

[Killed] ConditionalExpression
packages/alfa-cascade/src/selector-map.ts:250:13
       const keySelector = block.selector.key;
 
       if (!keySelector.isSome()) {
-        if (Selector.isShadow(block.selector)) {
+        if (true) {
           // These selectors select nodes in the light tree, they are stored
           // separately and need to be checked when building the cascade of
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(60,7): .from() stores rules in increasing order, amongst all non-disabled sheets

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    classes: [
...

[Killed] BlockStatement
packages/alfa-cascade/src/selector-map.ts:255:16
           // separately and need to be checked when building the cascade of
           // the hosting tree, not of the same tree.
           shadow.push(block);
-        } else {
-          other.push(block);
-        }
+        } else {}
       } else {
         const key = keySelector.get();
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(60,7): .from() stores rules in increasing order, amongst all non-disabled sheets

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    classes: [
...

[Killed] BlockStatement
packages/alfa-cascade/src/selector-map.ts:258:14
         } else {
           other.push(block);
         }
-      } else {
-        const key = keySelector.get();
-        const buckets = { id: ids, class: classes, type: types };
-        buckets[key.type].add(key.name, block);
-      }
+      } else {}
     };
 
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(18,7): .from() builds a cascade with the User Agent style sheet

Expected values to be strictly deep-equal:

0 !== 96

[Killed] BlockStatement
packages/alfa-cascade/src/selector-map.ts:267:40
 
     const visit = (rule: Rule) => {
       // For style rule, we just store its blocks.
-      if (StyleRule.isStyleRule(rule)) {
-        // Style rules with empty style blocks aren't relevant and so can be
-        // skipped entirely.
-        if (rule.style.isEmpty()) {
-          return;
-        }
-
-        let blocks: Array<Block<Block.Source>> = [];
-        [blocks, order] = Block.from(rule, order, encapsulationDepth);
-
-        for (const block of blocks) {
-          add(block);
-        }
-      }
+      if (StyleRule.isStyleRule(rule)) {}
 
       // For media rules, we recurse into the child rules if and only if the
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(22,7): .from() builds a selector map with a single rule

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    classes: [],
    ids: [],

[Survived] ConditionalExpression
packages/alfa-cascade/src/selector-map.ts:270:13
       if (StyleRule.isStyleRule(rule)) {
         // Style rules with empty style blocks aren't relevant and so can be
         // skipped entirely.
-        if (rule.style.isEmpty()) {
+        if (false) {
           return;
         }

[Survived] BlockStatement
packages/alfa-cascade/src/selector-map.ts:270:35
       if (StyleRule.isStyleRule(rule)) {
         // Style rules with empty style blocks aren't relevant and so can be
         // skipped entirely.
-        if (rule.style.isEmpty()) {
-          return;
-        }
+        if (rule.style.isEmpty()) {}
 
         let blocks: Array<Block<Block.Source>> = [];

[Killed] BlockStatement
packages/alfa-cascade/src/selector-map.ts:277:37
         let blocks: Array<Block<Block.Source>> = [];
         [blocks, order] = Block.from(rule, order, encapsulationDepth);
 
-        for (const block of blocks) {
-          add(block);
-        }
+        for (const block of blocks) {}
       }
 
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(22,7): .from() builds a selector map with a single rule

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    classes: [],
    ids: [],

[Killed] BlockStatement
packages/alfa-cascade/src/selector-map.ts:284:45
 
       // For media rules, we recurse into the child rules if and only if the
       // media condition matches the device.
-      else if (MediaRule.isMediaRule(rule)) {
-        if (!rule.queries.matches(device)) {
-          return;
-        }
-
-        for (const child of rule.children()) {
-          visit(child);
-        }
-      }
+      else if (MediaRule.isMediaRule(rule)) {}
 
       // For import rules, we recurse into the imported style sheet if and only
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(18,7): .from() builds a cascade with the User Agent style sheet

Expected values to be strictly deep-equal:

95 !== 96

[Killed] BooleanLiteral
packages/alfa-cascade/src/selector-map.ts:285:13
       // For media rules, we recurse into the child rules if and only if the
       // media condition matches the device.
       else if (MediaRule.isMediaRule(rule)) {
-        if (!rule.queries.matches(device)) {
+        if (rule.queries.matches(device)) {
           return;
         }
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(122,7): .from() only recurses into media rules that match the device

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    classes: [],
...

[Killed] ConditionalExpression
packages/alfa-cascade/src/selector-map.ts:285:13
       // For media rules, we recurse into the child rules if and only if the
       // media condition matches the device.
       else if (MediaRule.isMediaRule(rule)) {
-        if (!rule.queries.matches(device)) {
+        if (true) {
           return;
         }
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(122,7): .from() only recurses into media rules that match the device

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    classes: [],
    ids: [],

[Killed] BlockStatement
packages/alfa-cascade/src/selector-map.ts:289:46
           return;
         }
 
-        for (const child of rule.children()) {
-          visit(child);
-        }
+        for (const child of rule.children()) {}
       }
 
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(122,7): .from() only recurses into media rules that match the device

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    classes: [],
    ids: [],

[Killed] BlockStatement
packages/alfa-cascade/src/selector-map.ts:296:47
 
       // For import rules, we recurse into the imported style sheet if and only
       // if the import condition matches the device.
-      else if (ImportRule.isImportRule(rule)) {
-        if (!rule.queries.matches(device)) {
-          return;
-        }
-
-        for (const child of rule.sheet.children()) {
-          visit(child);
-        }
-      } else if (SupportsRule.isSupportsRule(rule)) {
+      else if (ImportRule.isImportRule(rule)) {} else if (SupportsRule.isSupportsRule(rule)) {
         if (rule.query.every((query) => !query.matches(device))) {
           // If the option is None, the condition failed to parse and the rule is discarded.
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(138,7): .from() only recurses into import rules that match the device

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    classes: [],
    ids: [],

[Killed] ConditionalExpression
packages/alfa-cascade/src/selector-map.ts:297:13
       // For import rules, we recurse into the imported style sheet if and only
       // if the import condition matches the device.
       else if (ImportRule.isImportRule(rule)) {
-        if (!rule.queries.matches(device)) {
+        if (false) {
           return;
         }
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(138,7): .from() only recurses into import rules that match the device

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    classes: [],
...

[Killed] BooleanLiteral
packages/alfa-cascade/src/selector-map.ts:297:13
       // For import rules, we recurse into the imported style sheet if and only
       // if the import condition matches the device.
       else if (ImportRule.isImportRule(rule)) {
-        if (!rule.queries.matches(device)) {
+        if (rule.queries.matches(device)) {
           return;
         }
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(138,7): .from() only recurses into import rules that match the device

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    classes: [],
...

[Killed] BlockStatement
packages/alfa-cascade/src/selector-map.ts:301:52
           return;
         }
 
-        for (const child of rule.sheet.children()) {
-          visit(child);
-        }
+        for (const child of rule.sheet.children()) {}
       } else if (SupportsRule.isSupportsRule(rule)) {
         if (rule.query.every((query) => !query.matches(device))) {
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(138,7): .from() only recurses into import rules that match the device

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    classes: [],
    ids: [],

[Killed] BlockStatement
packages/alfa-cascade/src/selector-map.ts:304:53
         for (const child of rule.sheet.children()) {
           visit(child);
         }
-      } else if (SupportsRule.isSupportsRule(rule)) {
-        if (rule.query.every((query) => !query.matches(device))) {
-          // If the option is None, the condition failed to parse and the rule is discarded.
-          return;
-        }
-
-        for (const child of rule.children()) {
-          visit(child);
-        }
-      }
+      } else if (SupportsRule.isSupportsRule(rule)) {}
 
       // Otherwise, we recurse into whichever child rules are declared by the
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(160,7): .from() only recurses into supports rules whose condition matches

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    classes: [],
    ids: [],

[Killed] ConditionalExpression
packages/alfa-cascade/src/selector-map.ts:305:13
           visit(child);
         }
       } else if (SupportsRule.isSupportsRule(rule)) {
-        if (rule.query.every((query) => !query.matches(device))) {
+        if (true) {
           // If the option is None, the condition failed to parse and the rule is discarded.
           return;
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(160,7): .from() only recurses into supports rules whose condition matches

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    classes: [],
    ids: [],

[Killed] BlockStatement
packages/alfa-cascade/src/selector-map.ts:305:66
           visit(child);
         }
       } else if (SupportsRule.isSupportsRule(rule)) {
-        if (rule.query.every((query) => !query.matches(device))) {
-          // If the option is None, the condition failed to parse and the rule is discarded.
-          return;
-        }
+        if (rule.query.every((query) => !query.matches(device))) {}
 
         for (const child of rule.children()) {
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(160,7): .from() only recurses into supports rules whose condition matches

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    classes: [],
...

[Survived] BlockStatement
packages/alfa-cascade/src/selector-map.ts:317:12
 
       // Otherwise, we recurse into whichever child rules are declared by the
       // current rule.
-      else {
-        for (const child of rule.children()) {
-          visit(child);
-        }
-      }
+      else {}
     };
 

[Survived] BlockStatement
packages/alfa-cascade/src/selector-map.ts:318:46
       // Otherwise, we recurse into whichever child rules are declared by the
       // current rule.
       else {
-        for (const child of rule.children()) {
-          visit(child);
-        }
+        for (const child of rule.children()) {}
       }
     };

[Killed] BlockStatement
packages/alfa-cascade/src/selector-map.ts:324:33
       }
     };
 
-    for (const sheet of sheets) {
-      if (sheet.disabled) {
-        continue;
-      }
-
-      if (sheet.condition.isSome()) {
-        const query = Feature.parseMediaQuery(Lexer.lex(sheet.condition.get()));
-
-        if (query.every(([, query]) => !query.matches(device))) {
-          continue;
-        }
-      }
-
-      for (const rule of sheet.children()) {
-        visit(rule);
-      }
-    }
+    for (const sheet of sheets) {}
 
     return SelectorMap.of(ids, classes, types, other, shadow);
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(22,7): .from() builds a selector map with a single rule

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    classes: [],
    ids: [],

[Killed] ConditionalExpression
packages/alfa-cascade/src/selector-map.ts:325:11
     };
 
     for (const sheet of sheets) {
-      if (sheet.disabled) {
+      if (false) {
         continue;
       }
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(60,7): .from() stores rules in increasing order, amongst all non-disabled sheets

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    classes: [
...

[Killed] BlockStatement
packages/alfa-cascade/src/selector-map.ts:325:27
     };
 
     for (const sheet of sheets) {
-      if (sheet.disabled) {
-        continue;
-      }
+      if (sheet.disabled) {}
 
       if (sheet.condition.isSome()) {
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(60,7): .from() stores rules in increasing order, amongst all non-disabled sheets

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    classes: [
...

[Survived] BlockStatement
packages/alfa-cascade/src/selector-map.ts:329:37
         continue;
       }
 
-      if (sheet.condition.isSome()) {
-        const query = Feature.parseMediaQuery(Lexer.lex(sheet.condition.get()));
-
-        if (query.every(([, query]) => !query.matches(device))) {
-          continue;
-        }
-      }
+      if (sheet.condition.isSome()) {}
 
       for (const rule of sheet.children()) {
