[Survived] ConditionalExpression
packages/alfa-cascade/src/selector-map.ts:332:13
       if (sheet.condition.isSome()) {
         const query = Feature.parseMediaQuery(Lexer.lex(sheet.condition.get()));
 
-        if (query.every(([, query]) => !query.matches(device))) {
+        if (false) {
           continue;
         }

[Survived] ConditionalExpression
packages/alfa-cascade/src/selector-map.ts:332:13
       if (sheet.condition.isSome()) {
         const query = Feature.parseMediaQuery(Lexer.lex(sheet.condition.get()));
 
-        if (query.every(([, query]) => !query.matches(device))) {
+        if (true) {
           continue;
         }

[Killed] BlockStatement
packages/alfa-cascade/src/selector-map.ts:337:44
         }
       }
 
-      for (const rule of sheet.children()) {
-        visit(rule);
-      }
+      for (const rule of sheet.children()) {}
     }
 
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(18,7): .from() builds a cascade with the User Agent style sheet

Expected values to be strictly deep-equal:

0 !== 96

[Killed] BlockStatement
packages/alfa-cascade/src/selector-map.ts:363:62
       this._nodes = nodes;
     }
 
-    public add(key: string, node: Block<Block.Source>): void {
-      const nodes = this._nodes.get(key);
-
-      if (nodes === undefined) {
-        this._nodes.set(key, [node]);
-      } else {
-        nodes.push(node);
-      }
-    }
+    public add(key: string, node: Block<Block.Source>): void {}
 
     public get(key: string): Array<Block<Block.Source>> {
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(18,7): .from() builds a cascade with the User Agent style sheet

Expected values to be strictly deep-equal:

0 !== 96

[Killed] BlockStatement
packages/alfa-cascade/src/selector-map.ts:366:32
     public add(key: string, node: Block<Block.Source>): void {
       const nodes = this._nodes.get(key);
 
-      if (nodes === undefined) {
-        this._nodes.set(key, [node]);
-      } else {
+      if (nodes === undefined) {} else {
         nodes.push(node);
       }
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(22,7): .from() builds a selector map with a single rule

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    classes: [],
    ids: [],

[Killed] BlockStatement
packages/alfa-cascade/src/selector-map.ts:368:14
 
       if (nodes === undefined) {
         this._nodes.set(key, [node]);
-      } else {
-        nodes.push(node);
-      }
+      } else {}
     }
 
killedBy: All tests
statusReason: packages/alfa-cascade/test/selector-map.spec.js(80,7): .from() split important and non-important declarations in two blocks

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    classes: [],
...
