[Survived] BlockStatement
packages/alfa-compatibility/src/browser.ts:98:43
     return browser in Browsers;
   }
 
-  function* getBrowsers(): Iterable<Name> {
-    for (const browser in Browsers) {
-      if (isBrowser(browser)) {
-        yield browser;
-      }
-    }
-  }
+  function* getBrowsers(): Iterable<Name> {}
 
   export function isVersion<N extends Name>(

[Survived] BlockStatement
packages/alfa-compatibility/src/browser.ts:99:37
   }
 
   function* getBrowsers(): Iterable<Name> {
-    for (const browser in Browsers) {
-      if (isBrowser(browser)) {
-        yield browser;
-      }
-    }
+    for (const browser in Browsers) {}
   }
 

[Survived] BlockStatement
packages/alfa-compatibility/src/browser.ts:100:31
 
   function* getBrowsers(): Iterable<Name> {
     for (const browser in Browsers) {
-      if (isBrowser(browser)) {
-        yield browser;
-      }
+      if (isBrowser(browser)) {}
     }
   }

[Survived] BlockStatement
packages/alfa-compatibility/src/browser.ts:113:75
     return version in Browsers[browser].releases;
   }
 
-  function* getVersions<N extends Name>(browser: N): Iterable<Version<N>> {
-    for (const version in Browsers[browser].releases) {
-      if (isVersion(browser, version)) {
-        yield version;
-      }
-    }
-  }
+  function* getVersions<N extends Name>(browser: N): Iterable<Version<N>> {}
 
   type Versions<N extends Name> = { [V in Version<N>]: Release<N, V> };

[Survived] BlockStatement
packages/alfa-compatibility/src/browser.ts:114:55
   }
 
   function* getVersions<N extends Name>(browser: N): Iterable<Version<N>> {
-    for (const version in Browsers[browser].releases) {
-      if (isVersion(browser, version)) {
-        yield version;
-      }
-    }
+    for (const version in Browsers[browser].releases) {}
   }
 

[Survived] BlockStatement
packages/alfa-compatibility/src/browser.ts:115:40
 
   function* getVersions<N extends Name>(browser: N): Iterable<Version<N>> {
     for (const version in Browsers[browser].releases) {
-      if (isVersion(browser, version)) {
-        yield version;
-      }
+      if (isVersion(browser, version)) {}
     }
   }

[Survived] ArrayDeclaration
packages/alfa-compatibility/src/browser.ts:131:20
 
       return {
         ...support,
-        [browser]: [...getVersions(browser)].reduce(
+        [browser]: [].reduce(
           <V extends Version<N>>(support: Versions<N>, version: V) => {
             const { date } = releases[version as keyof typeof releases];

[Survived] ConditionalExpression
packages/alfa-compatibility/src/browser.ts:173:14
     export function isEvery<N extends Name>(
       query: Query<N>,
     ): query is Every<N> {
-      return query.length === 1;
+      return true;
     }
 

[Survived] EqualityOperator
packages/alfa-compatibility/src/browser.ts:173:14
     export function isEvery<N extends Name>(
       query: Query<N>,
     ): query is Every<N> {
-      return query.length === 1;
+      return query.length !== 1;
     }
 

[Survived] ConditionalExpression
packages/alfa-compatibility/src/browser.ts:179:14
     export function isSingle<N extends Name>(
       query: Query<N>,
     ): query is Single<N> {
-      return query.length === 2;
+      return false;
     }
 

[Survived] EqualityOperator
packages/alfa-compatibility/src/browser.ts:179:14
     export function isSingle<N extends Name>(
       query: Query<N>,
     ): query is Single<N> {
-      return query.length === 2;
+      return query.length !== 2;
     }
 

[Survived] EqualityOperator
packages/alfa-compatibility/src/browser.ts:185:14
     export function isRange<N extends Name>(
       query: Query<N>,
     ): query is Range<N> {
-      return query.length === 3;
+      return query.length !== 3;
     }
   }

[Survived] ConditionalExpression
packages/alfa-compatibility/src/browser.ts:185:14
     export function isRange<N extends Name>(
       query: Query<N>,
     ): query is Range<N> {
-      return query.length === 3;
+      return false;
     }
   }

[Survived] ConditionalExpression
packages/alfa-compatibility/src/browser.ts:196:43
     const browser = query[0];
     const support = Iterable.filter(
       scope,
-      (release): release is Release<N> => release.browser === browser,
+      (release): release is Release<N> => false,
     );
 

[Survived] ConditionalExpression
packages/alfa-compatibility/src/browser.ts:196:43
     const browser = query[0];
     const support = Iterable.filter(
       scope,
-      (release): release is Release<N> => release.browser === browser,
+      (release): release is Release<N> => true,
     );
 

[Survived] BlockStatement
packages/alfa-compatibility/src/browser.ts:199:31
       (release): release is Release<N> => release.browser === browser,
     );
 
-    if (Query.isEvery(query)) {
-      yield* support;
-    } else if (Query.isSingle(query)) {
+    if (Query.isEvery(query)) {} else if (Query.isSingle(query)) {
       const version = query[1];
       const release = getRelease(browser, version);

[Survived] BlockStatement
packages/alfa-compatibility/src/browser.ts:201:39
 
     if (Query.isEvery(query)) {
       yield* support;
-    } else if (Query.isSingle(query)) {
-      const version = query[1];
-      const release = getRelease(browser, version);
-
-      if (Iterable.includes(support, release)) {
-        yield release;
-      }
-    } else {
+    } else if (Query.isSingle(query)) {} else {
       let lower = 0;
       let upper = Infinity;

[Survived] ConditionalExpression
packages/alfa-compatibility/src/browser.ts:205:11
       const version = query[1];
       const release = getRelease(browser, version);
 
-      if (Iterable.includes(support, release)) {
+      if (false) {
         yield release;
       }

[Survived] BlockStatement
packages/alfa-compatibility/src/browser.ts:205:48
       const version = query[1];
       const release = getRelease(browser, version);
 
-      if (Iterable.includes(support, release)) {
-        yield release;
-      }
+      if (Iterable.includes(support, release)) {}
     } else {
       let lower = 0;

[Survived] ConditionalExpression
packages/alfa-compatibility/src/browser.ts:213:9
       let upper = Infinity;
 
       switch (query[1]) {
-        case "<":
-          upper = getRelease(browser, query[2]).date - 1;
-          break;
+        case "<":
         case ">":
           lower = getRelease(browser, query[2]).date + 1;

[Survived] ArithmeticOperator
packages/alfa-compatibility/src/browser.ts:214:19
 
       switch (query[1]) {
         case "<":
-          upper = getRelease(browser, query[2]).date - 1;
+          upper = getRelease(browser, query[2]).date + 1;
           break;
         case ">":

[Survived] ConditionalExpression
packages/alfa-compatibility/src/browser.ts:216:9
         case "<":
           upper = getRelease(browser, query[2]).date - 1;
           break;
-        case ">":
-          lower = getRelease(browser, query[2]).date + 1;
-          break;
+        case ">":
         case "<=":
           upper = getRelease(browser, query[2]).date;

[Survived] ArithmeticOperator
packages/alfa-compatibility/src/browser.ts:217:19
           upper = getRelease(browser, query[2]).date - 1;
           break;
         case ">":
-          lower = getRelease(browser, query[2]).date + 1;
+          lower = getRelease(browser, query[2]).date - 1;
           break;
         case "<=":

[Survived] ConditionalExpression
packages/alfa-compatibility/src/browser.ts:219:9
         case ">":
           lower = getRelease(browser, query[2]).date + 1;
           break;
-        case "<=":
-          upper = getRelease(browser, query[2]).date;
-          break;
+        case "<=":
         case ">=":
           lower = getRelease(browser, query[2]).date;

[Survived] ConditionalExpression
packages/alfa-compatibility/src/browser.ts:226:9
           lower = getRelease(browser, query[2]).date;
           break;
 
-        default:
-          lower = getRelease(browser, query[1]).date;
-          upper = getRelease(browser, query[2]).date - 1;
+        default:
       }
 

[Survived] ArithmeticOperator
packages/alfa-compatibility/src/browser.ts:228:19
 
         default:
           lower = getRelease(browser, query[1]).date;
-          upper = getRelease(browser, query[2]).date - 1;
+          upper = getRelease(browser, query[2]).date + 1;
       }
 

[Survived] BlockStatement
packages/alfa-compatibility/src/browser.ts:231:51
           upper = getRelease(browser, query[2]).date - 1;
       }
 
-      for (const version of getVersions(browser)) {
-        const release = getRelease(browser, version);
-
-        if (
-          release.date >= lower &&
-          release.date <= upper &&
-          Iterable.includes(support, release)
-        ) {
-          yield release;
-        }
-      }
+      for (const version of getVersions(browser)) {}
     }
   }

[Survived] ConditionalExpression
packages/alfa-compatibility/src/browser.ts:235:11
         const release = getRelease(browser, version);
 
         if (
-          release.date >= lower &&
-          release.date <= upper &&
-          Iterable.includes(support, release)
+          false
         ) {
           yield release;

[Survived] LogicalOperator
packages/alfa-compatibility/src/browser.ts:235:11
         const release = getRelease(browser, version);
 
         if (
-          release.date >= lower &&
-          release.date <= upper &&
-          Iterable.includes(support, release)
+          release.date >= lower && release.date <= upper || Iterable.includes(support, release)
         ) {
           yield release;

[Survived] ConditionalExpression
packages/alfa-compatibility/src/browser.ts:236:11
 
         if (
           release.date >= lower &&
-          release.date <= upper &&
+          true &&
           Iterable.includes(support, release)
         ) {

[Survived] EqualityOperator
packages/alfa-compatibility/src/browser.ts:236:11
 
         if (
           release.date >= lower &&
-          release.date <= upper &&
+          release.date > upper &&
           Iterable.includes(support, release)
         ) {

[Survived] BlockStatement
packages/alfa-compatibility/src/browser.ts:238:11
           release.date >= lower &&
           release.date <= upper &&
           Iterable.includes(support, release)
-        ) {
-          yield release;
-        }
+        ) {}
       }
     }

[Survived] ConditionalExpression
packages/alfa-compatibility/src/browser.ts:255:62
 
       return getRelease(browser, version);
     })
-    .filter((release: Release | null): release is Release => release !== null);
+    .filter((release: Release | null): release is Release => true);
 
   export function getDefaultScope(): Scope {

[Survived] EqualityOperator
packages/alfa-compatibility/src/browser.ts:255:62
 
       return getRelease(browser, version);
     })
-    .filter((release: Release | null): release is Release => release !== null);
+    .filter((release: Release | null): release is Release => release === null);
 
   export function getDefaultScope(): Scope {
