[Survived] BlockStatement
packages/alfa-compatibility/src/feature.ts:54:31
 
   function* getImplementers<N extends Name>(
     feature: N,
-  ): Iterable<Implementer<N>> {
-    for (const browser in Features[feature].support) {
-      const implementer = browser as Browser.Name;
-
-      if (isImplementer(feature, implementer)) {
-        yield implementer;
-      }
-    }
-  }
+  ): Iterable<Implementer<N>> {}
 
   export function getScope<N extends Name>(

[Survived] BlockStatement
packages/alfa-compatibility/src/feature.ts:55:54
   function* getImplementers<N extends Name>(
     feature: N,
   ): Iterable<Implementer<N>> {
-    for (const browser in Features[feature].support) {
-      const implementer = browser as Browser.Name;
-
-      if (isImplementer(feature, implementer)) {
-        yield implementer;
-      }
-    }
+    for (const browser in Features[feature].support) {}
   }
 

[Survived] BlockStatement
packages/alfa-compatibility/src/feature.ts:58:48
     for (const browser in Features[feature].support) {
       const implementer = browser as Browser.Name;
 
-      if (isImplementer(feature, implementer)) {
-        yield implementer;
-      }
+      if (isImplementer(feature, implementer)) {}
     }
   }
