[Killed] ConditionalExpression
packages/alfa-comparable/src/comparable.ts:57:12
    * interface.
    */
   export function isComparable<T>(value: unknown): value is Comparable<T> {
-    return isObject(value) && isFunction(value.compare);
+    return false;
   }
 
killedBy: All tests
statusReason: packages/alfa-css-feature/test/media.spec.js(336,7): #matches() matches conjunction query

Expected values to be strictly deep-equal:

false !== true

[Survived] ConditionalExpression
packages/alfa-comparable/src/comparable.ts:57:12
    * interface.
    */
   export function isComparable<T>(value: unknown): value is Comparable<T> {
-    return isObject(value) && isFunction(value.compare);
+    return true;
   }
 

[Killed] ConditionalExpression
packages/alfa-comparable/src/comparable.ts:166:9
     a: T,
     b: T,
   ): Comparison {
-    if (a < b) {
+    if (false) {
       return Comparison.Less;
     }
killedBy: All tests
statusReason: packages/alfa-comparable/test/comparable.spec.js(26,7): compareLexicographically compares heterogenous tuples

Expected values to be strictly deep-equal:

0 !== -1

[Killed] ConditionalExpression
packages/alfa-comparable/src/comparable.ts:166:9
     a: T,
     b: T,
   ): Comparison {
-    if (a < b) {
+    if (true) {
       return Comparison.Less;
     }
killedBy: All tests
statusReason: packages/alfa-comparable/test/comparable.spec.js(12,7): compareLexicographically compares couple of integers

Failing lexicographic comparison of [266, 0] and [223, 146] at seed 0.18113270470327247

Failing lexicographic comparison of [266, 0] and [223, 146] at seed 0.18113270470327247

Expected values to be strictly deep-equal:

[Killed] BlockStatement
packages/alfa-comparable/src/comparable.ts:170:16
       return Comparison.Less;
     }
 
-    if (a > b) {
-      return Comparison.Greater;
-    }
+    if (a > b) {}
 
     return Comparison.Equal;
killedBy: All tests
statusReason: packages/alfa-comparable/test/comparable.spec.js(12,7): compareLexicographically compares couple of integers

Failing lexicographic comparison of [266, 0] and [223, 146] at seed 0.17975720721747912

Failing lexicographic comparison of [266, 0] and [223, 146] at seed 0.17975720721747912

Expected values to be strictly deep-equal:

[Killed] ConditionalExpression
packages/alfa-comparable/src/comparable.ts:170:9
       return Comparison.Less;
     }
 
-    if (a > b) {
+    if (false) {
       return Comparison.Greater;
     }
killedBy: All tests
statusReason: packages/alfa-comparable/test/comparable.spec.js(12,7): compareLexicographically compares couple of integers

Failing lexicographic comparison of [266, 0] and [223, 146] at seed 0.6397127429754252

Failing lexicographic comparison of [266, 0] and [223, 146] at seed 0.6397127429754252

Expected values to be strictly deep-equal:

[Killed] UpdateOperator
packages/alfa-comparable/src/comparable.ts:187:35
     b: T,
     comparer: TupleComparer<T>,
   ): Comparison {
-    for (let i = 0; i < a.length; i++) {
+    for (let i = 0; i < a.length; i--) {
       const comparison = (comparer[i] as Comparer<T[typeof i]>)(a[i], b[i]);
       if (comparison === Comparison.Equal) {
killedBy: All tests
statusReason: packages/alfa-comparable/src/comparable.js(244,51): compareLexicographically compares heterogenous tuples
TypeError: comparer[i] is not a function

[Killed] ConditionalExpression
packages/alfa-comparable/src/comparable.ts:187:21
     b: T,
     comparer: TupleComparer<T>,
   ): Comparison {
-    for (let i = 0; i < a.length; i++) {
+    for (let i = 0; false; i++) {
       const comparison = (comparer[i] as Comparer<T[typeof i]>)(a[i], b[i]);
       if (comparison === Comparison.Equal) {
killedBy: All tests
statusReason: packages/alfa-comparable/test/comparable.spec.js(12,7): compareLexicographically compares couple of integers

Failing lexicographic comparison of [266, 0] and [223, 146] at seed 0.55783004899214

Failing lexicographic comparison of [266, 0] and [223, 146] at seed 0.55783004899214

Expected values to be strictly deep-equal:

[Killed] ConditionalExpression
packages/alfa-comparable/src/comparable.ts:189:11
   ): Comparison {
     for (let i = 0; i < a.length; i++) {
       const comparison = (comparer[i] as Comparer<T[typeof i]>)(a[i], b[i]);
-      if (comparison === Comparison.Equal) {
+      if (true) {
         continue;
       }
killedBy: All tests
statusReason: packages/alfa-comparable/test/comparable.spec.js(12,7): compareLexicographically compares couple of integers

Failing lexicographic comparison of [266, 0] and [223, 146] at seed 0.07756057765708957

Failing lexicographic comparison of [266, 0] and [223, 146] at seed 0.07756057765708957

Expected values to be strictly deep-equal:

[Killed] EqualityOperator
packages/alfa-comparable/src/comparable.ts:189:11
   ): Comparison {
     for (let i = 0; i < a.length; i++) {
       const comparison = (comparer[i] as Comparer<T[typeof i]>)(a[i], b[i]);
-      if (comparison === Comparison.Equal) {
+      if (comparison !== Comparison.Equal) {
         continue;
       }
killedBy: All tests
statusReason: packages/alfa-comparable/test/comparable.spec.js(12,7): compareLexicographically compares couple of integers

Failing lexicographic comparison of [266, 0] and [223, 146] at seed 0.7005852742464542

Failing lexicographic comparison of [266, 0] and [223, 146] at seed 0.7005852742464542

Expected values to be strictly deep-equal:

[Survived] EqualityOperator
packages/alfa-comparable/src/comparable.ts:202:12
    * Check if one value is less than another.
    */
   export function isLessThan<T>(a: Comparable<T>, b: T): boolean {
-    return a.compare(b) < 0;
+    return a.compare(b) >= 0;
   }
 

[Survived] ConditionalExpression
packages/alfa-comparable/src/comparable.ts:202:12
    * Check if one value is less than another.
    */
   export function isLessThan<T>(a: Comparable<T>, b: T): boolean {
-    return a.compare(b) < 0;
+    return false;
   }
 

[Survived] EqualityOperator
packages/alfa-comparable/src/comparable.ts:209:12
    * Check if one value is less than or equal to another.
    */
   export function isLessThanOrEqual<T>(a: Comparable<T>, b: T): boolean {
-    return a.compare(b) <= 0;
+    return a.compare(b) < 0;
   }
 

[Survived] ConditionalExpression
packages/alfa-comparable/src/comparable.ts:209:12
    * Check if one value is less than or equal to another.
    */
   export function isLessThanOrEqual<T>(a: Comparable<T>, b: T): boolean {
-    return a.compare(b) <= 0;
+    return true;
   }
 

[Survived] ConditionalExpression
packages/alfa-comparable/src/comparable.ts:216:12
    * Check if one value is equal to another
    */
   export function isEqual<T>(a: Comparable<T>, b: T): boolean {
-    return a.compare(b) === 0;
+    return false;
   }
 

[Survived] ConditionalExpression
packages/alfa-comparable/src/comparable.ts:216:12
    * Check if one value is equal to another
    */
   export function isEqual<T>(a: Comparable<T>, b: T): boolean {
-    return a.compare(b) === 0;
+    return true;
   }
 

[Survived] ConditionalExpression
packages/alfa-comparable/src/comparable.ts:223:12
    * Check if one value is greater than another.
    */
   export function isGreaterThan<T>(a: Comparable<T>, b: T): boolean {
-    return a.compare(b) > 0;
+    return true;
   }
 

[Survived] EqualityOperator
packages/alfa-comparable/src/comparable.ts:223:12
    * Check if one value is greater than another.
    */
   export function isGreaterThan<T>(a: Comparable<T>, b: T): boolean {
-    return a.compare(b) > 0;
+    return a.compare(b) >= 0;
   }
 

[Survived] EqualityOperator
packages/alfa-comparable/src/comparable.ts:230:12
    * Check if one value is greater than or equal to another.
    */
   export function isGreaterThanOrEqual<T>(a: Comparable<T>, b: T): boolean {
-    return a.compare(b) >= 0;
+    return a.compare(b) > 0;
   }
 }

[Survived] EqualityOperator
packages/alfa-comparable/src/comparable.ts:230:12
    * Check if one value is greater than or equal to another.
    */
   export function isGreaterThanOrEqual<T>(a: Comparable<T>, b: T): boolean {
-    return a.compare(b) >= 0;
+    return a.compare(b) < 0;
   }
 }
