[Killed] StringLiteral
packages/alfa-cascade/src/user-agent.ts:16:5
    */
 
   h.rule.style(
-    "[hidden], base, basefont, datalist, head, link, meta, noembed, noframes, param, rp, script, source, style, template, track, title",
+    "",
     {
       display: "none",
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(18,7): .from() builds a cascade with the User Agent style sheet

Expected values to be strictly deep-equal:

80 !== 96

[Killed] StringLiteral
packages/alfa-cascade/src/user-agent.ts:18:16
   h.rule.style(
     "[hidden], base, basefont, datalist, head, link, meta, noembed, noframes, param, rp, script, source, style, template, track, title",
     {
-      display: "none",
+      display: "",
     },
   ),
killedBy: All tests
statusReason: packages/alfa-aria/test/name.spec.js(890,7): .from() ignores hidden `<label>` elements

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

+ Some {
+   _value: Name {
+     _sources: [

[Killed] ObjectLiteral
packages/alfa-cascade/src/user-agent.ts:30:33
     display: "inline",
   }),
 
-  h.rule.style("embed[hidden]", {
-    display: "inline",
-    height: "0",
-    width: "0",
-  }),
+  h.rule.style("embed[hidden]", {}),
 
   h.rule.style("input[type=hidden i]", {
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(18,7): .from() builds a cascade with the User Agent style sheet

Expected values to be strictly deep-equal:

95 !== 96

[Survived] StringLiteral
packages/alfa-cascade/src/user-agent.ts:32:13
 
   h.rule.style("embed[hidden]", {
     display: "inline",
-    height: "0",
+    height: "",
     width: "0",
   }),

[Survived] StringLiteral
packages/alfa-cascade/src/user-agent.ts:33:12
   h.rule.style("embed[hidden]", {
     display: "inline",
     height: "0",
-    width: "0",
+    width: "",
   }),
 

[Killed] ArrayDeclaration
packages/alfa-cascade/src/user-agent.ts:40:31
     display: "none !important",
   }),
 
-  h.rule.media("(scripting)", [
-    h.rule.style("noscript", {
-      display: "none !important",
-    }),
-  ]),
+  h.rule.media("(scripting)", []),
 
   /**
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(18,7): .from() builds a cascade with the User Agent style sheet

Expected values to be strictly deep-equal:

95 !== 96

[Killed] StringLiteral
packages/alfa-cascade/src/user-agent.ts:41:18
   }),
 
   h.rule.media("(scripting)", [
-    h.rule.style("noscript", {
+    h.rule.style("", {
       display: "none !important",
     }),
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(18,7): .from() builds a cascade with the User Agent style sheet

Expected values to be strictly deep-equal:

95 !== 96

[Survived] StringLiteral
packages/alfa-cascade/src/user-agent.ts:42:16
 
   h.rule.media("(scripting)", [
     h.rule.style("noscript", {
-      display: "none !important",
+      display: "",
     }),
   ]),

[Killed] ObjectLiteral
packages/alfa-cascade/src/user-agent.ts:50:30
    * {@link https://html.spec.whatwg.org/#the-page}
    */
 
-  h.rule.style("html, body", {
-    display: "block",
-  }),
+  h.rule.style("html, body", {}),
 
   /**
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(18,7): .from() builds a cascade with the User Agent style sheet

Expected values to be strictly deep-equal:

94 !== 96

[Killed] ObjectLiteral
packages/alfa-cascade/src/user-agent.ts:60:5
 
   h.rule.style(
     "address, blockquote, center, div, figure, figcaption, footer, form, header, hr, legend, listing, main, p, plaintext, pre, xmp",
-    {
-      display: "block",
-    },
+    {},
   ),
 
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(18,7): .from() builds a cascade with the User Agent style sheet

Expected values to be strictly deep-equal:

81 !== 96

[Killed] StringLiteral
packages/alfa-cascade/src/user-agent.ts:65:16
     },
   ),
 
-  h.rule.style("dialog:not([open])", {
+  h.rule.style("", {
     display: "none",
   }),
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(59,7): .get() returns the rule tree node of the given element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
...

[Killed] ObjectLiteral
packages/alfa-cascade/src/user-agent.ts:69:26
     display: "none",
   }),
 
-  h.rule.style("dialog", {
-    background: "white",
-    color: "black",
-  }),
+  h.rule.style("dialog", {}),
 
   h.rule.style("dialog::backdrop", {
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(59,7): .get() returns the rule tree node of the given element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
...

[Killed] ObjectLiteral
packages/alfa-cascade/src/user-agent.ts:74:36
     color: "black",
   }),
 
-  h.rule.style("dialog::backdrop", {
-    background: "rgb(0 0 0 / 0.1)",
-  }),
+  h.rule.style("dialog::backdrop", {}),
 
   h.rule.style("slot", {
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(59,7): .get() returns the rule tree node of the given element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
...

[Killed] StringLiteral
packages/alfa-cascade/src/user-agent.ts:74:16
     color: "black",
   }),
 
-  h.rule.style("dialog::backdrop", {
+  h.rule.style("", {
     background: "rgb(0 0 0 / 0.1)",
   }),
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(59,7): .get() returns the rule tree node of the given element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
...

[Survived] StringLiteral
packages/alfa-cascade/src/user-agent.ts:75:17
   }),
 
   h.rule.style("dialog::backdrop", {
-    background: "rgb(0 0 0 / 0.1)",
+    background: "",
   }),
 

[Killed] StringLiteral
packages/alfa-cascade/src/user-agent.ts:78:16
     background: "rgb(0 0 0 / 0.1)",
   }),
 
-  h.rule.style("slot", {
+  h.rule.style("", {
     display: "contents",
   }),
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(18,7): .from() builds a cascade with the User Agent style sheet

Expected values to be strictly deep-equal:

95 !== 96

[Killed] ObjectLiteral
packages/alfa-cascade/src/user-agent.ts:86:41
    * {@link https://html.spec.whatwg.org/#phrasing-content-3}
    */
 
-  h.rule.style("cite, dfn, em, i, var", { fontStyle: "italic" }),
+  h.rule.style("cite, dfn, em, i, var", {}),
   h.rule.style("b, strong", { fontWeight: "bolder" }),
   h.rule.style("code, kbd, samp, tt", { fontFamily: "monospace" }),
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(18,7): .from() builds a cascade with the User Agent style sheet

Expected values to be strictly deep-equal:

91 !== 96

[Killed] ObjectLiteral
packages/alfa-cascade/src/user-agent.ts:87:29
    */
 
   h.rule.style("cite, dfn, em, i, var", { fontStyle: "italic" }),
-  h.rule.style("b, strong", { fontWeight: "bolder" }),
+  h.rule.style("b, strong", {}),
   h.rule.style("code, kbd, samp, tt", { fontFamily: "monospace" }),
   h.rule.style("big", { fontSize: "larger" }),
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(18,7): .from() builds a cascade with the User Agent style sheet

Expected values to be strictly deep-equal:

94 !== 96

[Killed] ObjectLiteral
packages/alfa-cascade/src/user-agent.ts:88:39
 
   h.rule.style("cite, dfn, em, i, var", { fontStyle: "italic" }),
   h.rule.style("b, strong", { fontWeight: "bolder" }),
-  h.rule.style("code, kbd, samp, tt", { fontFamily: "monospace" }),
+  h.rule.style("code, kbd, samp, tt", {}),
   h.rule.style("big", { fontSize: "larger" }),
   h.rule.style("small", { fontSize: "smaller" }),
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(18,7): .from() builds a cascade with the User Agent style sheet

Expected values to be strictly deep-equal:

92 !== 96

[Survived] StringLiteral
packages/alfa-cascade/src/user-agent.ts:88:53
 
   h.rule.style("cite, dfn, em, i, var", { fontStyle: "italic" }),
   h.rule.style("b, strong", { fontWeight: "bolder" }),
-  h.rule.style("code, kbd, samp, tt", { fontFamily: "monospace" }),
+  h.rule.style("code, kbd, samp, tt", { fontFamily: "" }),
   h.rule.style("big", { fontSize: "larger" }),
   h.rule.style("small", { fontSize: "smaller" }),

[Survived] StringLiteral
packages/alfa-cascade/src/user-agent.ts:89:35
   h.rule.style("cite, dfn, em, i, var", { fontStyle: "italic" }),
   h.rule.style("b, strong", { fontWeight: "bolder" }),
   h.rule.style("code, kbd, samp, tt", { fontFamily: "monospace" }),
-  h.rule.style("big", { fontSize: "larger" }),
+  h.rule.style("big", { fontSize: "" }),
   h.rule.style("small", { fontSize: "smaller" }),
 

[Killed] ObjectLiteral
packages/alfa-cascade/src/user-agent.ts:92:23
   h.rule.style("big", { fontSize: "larger" }),
   h.rule.style("small", { fontSize: "smaller" }),
 
-  h.rule.style("sub", { verticalAlign: "sub" }),
+  h.rule.style("sub", {}),
   h.rule.style("sup", { verticalAlign: "super" }),
 
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(18,7): .from() builds a cascade with the User Agent style sheet

Expected values to be strictly deep-equal:

95 !== 96

[Killed] StringLiteral
packages/alfa-cascade/src/user-agent.ts:93:16
   h.rule.style("small", { fontSize: "smaller" }),
 
   h.rule.style("sub", { verticalAlign: "sub" }),
-  h.rule.style("sup", { verticalAlign: "super" }),
+  h.rule.style("", { verticalAlign: "super" }),
 
   h.rule.style("ruby", { display: "ruby" }),
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(18,7): .from() builds a cascade with the User Agent style sheet

Expected values to be strictly deep-equal:

95 !== 96

[Killed] StringLiteral
packages/alfa-cascade/src/user-agent.ts:93:40
   h.rule.style("small", { fontSize: "smaller" }),
 
   h.rule.style("sub", { verticalAlign: "sub" }),
-  h.rule.style("sup", { verticalAlign: "super" }),
+  h.rule.style("sup", { verticalAlign: "" }),
 
   h.rule.style("ruby", { display: "ruby" }),
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r62/rule.expectation.spec.js(354,7): evaluate() passes an <a> element in superscript

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
...

[Killed] StringLiteral
packages/alfa-cascade/src/user-agent.ts:95:16
   h.rule.style("sub", { verticalAlign: "sub" }),
   h.rule.style("sup", { verticalAlign: "super" }),
 
-  h.rule.style("ruby", { display: "ruby" }),
+  h.rule.style("", { display: "ruby" }),
   h.rule.style("rt", { display: "ruby-text" }),
 
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(18,7): .from() builds a cascade with the User Agent style sheet

Expected values to be strictly deep-equal:

95 !== 96

[Killed] StringLiteral
packages/alfa-cascade/src/user-agent.ts:96:16
   h.rule.style("sup", { verticalAlign: "super" }),
 
   h.rule.style("ruby", { display: "ruby" }),
-  h.rule.style("rt", { display: "ruby-text" }),
+  h.rule.style("", { display: "ruby-text" }),
 
   h.rule.style(":link", { color: "#0000ee" }),
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(18,7): .from() builds a cascade with the User Agent style sheet

Expected values to be strictly deep-equal:

95 !== 96

[Killed] StringLiteral
packages/alfa-cascade/src/user-agent.ts:98:34
   h.rule.style("ruby", { display: "ruby" }),
   h.rule.style("rt", { display: "ruby-text" }),
 
-  h.rule.style(":link", { color: "#0000ee" }),
+  h.rule.style(":link", { color: "" }),
   h.rule.style(":visited", { color: "#551a8b" }),
   h.rule.style(":link:active, :visited:active", { color: "#ff0000" }),
killedBy: All tests
statusReason: packages/alfa-rules/test/sia-r62/rule.expectation.contrast.spec.js(45,7): evaluate() passes an <a> element that has a difference in contrast of 3:1 as a distinguishing feature

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
    {
+     mode: 'automatic',

[Killed] ObjectLiteral
packages/alfa-cascade/src/user-agent.ts:98:25
   h.rule.style("ruby", { display: "ruby" }),
   h.rule.style("rt", { display: "ruby-text" }),
 
-  h.rule.style(":link", { color: "#0000ee" }),
+  h.rule.style(":link", {}),
   h.rule.style(":visited", { color: "#551a8b" }),
   h.rule.style(":link:active, :visited:active", { color: "#ff0000" }),
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(19,7): .from() builds a cascade with the User Agent style sheet

Expected values to be strictly deep-equal:

7 !== 8

[Killed] ObjectLiteral
packages/alfa-cascade/src/user-agent.ts:100:49
 
   h.rule.style(":link", { color: "#0000ee" }),
   h.rule.style(":visited", { color: "#551a8b" }),
-  h.rule.style(":link:active, :visited:active", { color: "#ff0000" }),
+  h.rule.style(":link:active, :visited:active", {}),
   h.rule.style(":link, :visited", {
     textDecoration: "underline",
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(19,7): .from() builds a cascade with the User Agent style sheet

Expected values to be strictly deep-equal:

6 !== 8

[Killed] ObjectLiteral
packages/alfa-cascade/src/user-agent.ts:101:35
   h.rule.style(":link", { color: "#0000ee" }),
   h.rule.style(":visited", { color: "#551a8b" }),
   h.rule.style(":link:active, :visited:active", { color: "#ff0000" }),
-  h.rule.style(":link, :visited", {
-    textDecoration: "underline",
-    cursor: "pointer",
-  }),
+  h.rule.style(":link, :visited", {}),
 
   h.rule.style(":focus", { outline: "auto" }),
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(19,7): .from() builds a cascade with the User Agent style sheet

Expected values to be strictly deep-equal:

6 !== 8

[Killed] StringLiteral
packages/alfa-cascade/src/user-agent.ts:106:16
     cursor: "pointer",
   }),
 
-  h.rule.style(":focus", { outline: "auto" }),
+  h.rule.style("", { outline: "auto" }),
 
   h.rule.style("mark", { background: "yellow", color: "black" }),
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(19,7): .from() builds a cascade with the User Agent style sheet

Expected values to be strictly deep-equal:

7 !== 8

[Survived] StringLiteral
packages/alfa-cascade/src/user-agent.ts:110:44
 
   h.rule.style("mark", { background: "yellow", color: "black" }),
 
-  h.rule.style("ins, u", { textDecoration: "underline" }),
+  h.rule.style("ins, u", { textDecoration: "" }),
   h.rule.style("del, s, strike", { textDecoration: "line-through" }),
 

[Killed] StringLiteral
packages/alfa-cascade/src/user-agent.ts:117:16
    * {@link https://html.spec.whatwg.org/#sections-and-headings}
    */
 
-  h.rule.style("article, aside, h1, h2, h3, h4, h5, h6, hgroup, nav, section", {
+  h.rule.style("", {
     display: "block",
   }),
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(18,7): .from() builds a cascade with the User Agent style sheet

Expected values to be strictly deep-equal:

91 !== 96

[Killed] ObjectLiteral
packages/alfa-cascade/src/user-agent.ts:121:22
     display: "block",
   }),
 
-  h.rule.style("h1", { fontSize: "2.00em", fontWeight: "bold" }),
+  h.rule.style("h1", {}),
   h.rule.style("h2", { fontSize: "1.50em", fontWeight: "bold" }),
   h.rule.style("h3", { fontSize: "1.17em", fontWeight: "bold" }),
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(59,7): .get() returns the rule tree node of the given element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
...

[Survived] StringLiteral
packages/alfa-cascade/src/user-agent.ts:121:56
     display: "block",
   }),
 
-  h.rule.style("h1", { fontSize: "2.00em", fontWeight: "bold" }),
+  h.rule.style("h1", { fontSize: "2.00em", fontWeight: "" }),
   h.rule.style("h2", { fontSize: "1.50em", fontWeight: "bold" }),
   h.rule.style("h3", { fontSize: "1.17em", fontWeight: "bold" }),

[Killed] ObjectLiteral
packages/alfa-cascade/src/user-agent.ts:122:22
   }),
 
   h.rule.style("h1", { fontSize: "2.00em", fontWeight: "bold" }),
-  h.rule.style("h2", { fontSize: "1.50em", fontWeight: "bold" }),
+  h.rule.style("h2", {}),
   h.rule.style("h3", { fontSize: "1.17em", fontWeight: "bold" }),
   h.rule.style("h4", { fontSize: "1.00em", fontWeight: "bold" }),
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(59,7): .get() returns the rule tree node of the given element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
...

[Killed] StringLiteral
packages/alfa-cascade/src/user-agent.ts:122:16
   }),
 
   h.rule.style("h1", { fontSize: "2.00em", fontWeight: "bold" }),
-  h.rule.style("h2", { fontSize: "1.50em", fontWeight: "bold" }),
+  h.rule.style("", { fontSize: "1.50em", fontWeight: "bold" }),
   h.rule.style("h3", { fontSize: "1.17em", fontWeight: "bold" }),
   h.rule.style("h4", { fontSize: "1.00em", fontWeight: "bold" }),
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(59,7): .get() returns the rule tree node of the given element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
...

[Survived] StringLiteral
packages/alfa-cascade/src/user-agent.ts:123:56
 
   h.rule.style("h1", { fontSize: "2.00em", fontWeight: "bold" }),
   h.rule.style("h2", { fontSize: "1.50em", fontWeight: "bold" }),
-  h.rule.style("h3", { fontSize: "1.17em", fontWeight: "bold" }),
+  h.rule.style("h3", { fontSize: "1.17em", fontWeight: "" }),
   h.rule.style("h4", { fontSize: "1.00em", fontWeight: "bold" }),
   h.rule.style("h5", { fontSize: "0.83em", fontWeight: "bold" }),

[Survived] StringLiteral
packages/alfa-cascade/src/user-agent.ts:124:56
   h.rule.style("h1", { fontSize: "2.00em", fontWeight: "bold" }),
   h.rule.style("h2", { fontSize: "1.50em", fontWeight: "bold" }),
   h.rule.style("h3", { fontSize: "1.17em", fontWeight: "bold" }),
-  h.rule.style("h4", { fontSize: "1.00em", fontWeight: "bold" }),
+  h.rule.style("h4", { fontSize: "1.00em", fontWeight: "" }),
   h.rule.style("h5", { fontSize: "0.83em", fontWeight: "bold" }),
   h.rule.style("h6", { fontSize: "0.67em", fontWeight: "bold" }),

[Survived] StringLiteral
packages/alfa-cascade/src/user-agent.ts:125:34
   h.rule.style("h2", { fontSize: "1.50em", fontWeight: "bold" }),
   h.rule.style("h3", { fontSize: "1.17em", fontWeight: "bold" }),
   h.rule.style("h4", { fontSize: "1.00em", fontWeight: "bold" }),
-  h.rule.style("h5", { fontSize: "0.83em", fontWeight: "bold" }),
+  h.rule.style("h5", { fontSize: "", fontWeight: "bold" }),
   h.rule.style("h6", { fontSize: "0.67em", fontWeight: "bold" }),
 

[Killed] StringLiteral
packages/alfa-cascade/src/user-agent.ts:126:16
   h.rule.style("h3", { fontSize: "1.17em", fontWeight: "bold" }),
   h.rule.style("h4", { fontSize: "1.00em", fontWeight: "bold" }),
   h.rule.style("h5", { fontSize: "0.83em", fontWeight: "bold" }),
-  h.rule.style("h6", { fontSize: "0.67em", fontWeight: "bold" }),
+  h.rule.style("", { fontSize: "0.67em", fontWeight: "bold" }),
 
   /**
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(59,7): .get() returns the rule tree node of the given element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
...

[Survived] StringLiteral
packages/alfa-cascade/src/user-agent.ts:126:34
   h.rule.style("h3", { fontSize: "1.17em", fontWeight: "bold" }),
   h.rule.style("h4", { fontSize: "1.00em", fontWeight: "bold" }),
   h.rule.style("h5", { fontSize: "0.83em", fontWeight: "bold" }),
-  h.rule.style("h6", { fontSize: "0.67em", fontWeight: "bold" }),
+  h.rule.style("h6", { fontSize: "", fontWeight: "bold" }),
 
   /**

[Killed] StringLiteral
packages/alfa-cascade/src/user-agent.ts:133:16
    */
 
   h.rule.style("dir, dd, dl, dt, ol, ul", { display: "block" }),
-  h.rule.style("li", { display: "list-item" }),
+  h.rule.style("", { display: "list-item" }),
 
   /**
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(18,7): .from() builds a cascade with the User Agent style sheet

Expected values to be strictly deep-equal:

95 !== 96

[Survived] StringLiteral
packages/alfa-cascade/src/user-agent.ts:133:33
    */
 
   h.rule.style("dir, dd, dl, dt, ol, ul", { display: "block" }),
-  h.rule.style("li", { display: "list-item" }),
+  h.rule.style("li", { display: "" }),
 
   /**

[Killed] StringLiteral
packages/alfa-cascade/src/user-agent.ts:139:16
    * {@link https://html.spec.whatwg.org/#tables}
    */
 
-  h.rule.style("table", { display: "table" }),
+  h.rule.style("", { display: "table" }),
   h.rule.style("caption", { display: "table-caption" }),
   h.rule.style("colgroup, colgroup[hidden]", { display: "table-column-group" }),
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(18,7): .from() builds a cascade with the User Agent style sheet

Expected values to be strictly deep-equal:

95 !== 96

[Survived] StringLiteral
packages/alfa-cascade/src/user-agent.ts:142:47
   h.rule.style("table", { display: "table" }),
   h.rule.style("caption", { display: "table-caption" }),
   h.rule.style("colgroup, colgroup[hidden]", { display: "table-column-group" }),
-  h.rule.style("col, col[hidden]", { display: "table-column" }),
+  h.rule.style("col, col[hidden]", { display: "" }),
   h.rule.style("thead, thead[hidden]", { display: "table-header-group" }),
   h.rule.style("tbody, tbody[hidden]", { display: "table-row-group" }),

[Survived] StringLiteral
packages/alfa-cascade/src/user-agent.ts:143:51
   h.rule.style("caption", { display: "table-caption" }),
   h.rule.style("colgroup, colgroup[hidden]", { display: "table-column-group" }),
   h.rule.style("col, col[hidden]", { display: "table-column" }),
-  h.rule.style("thead, thead[hidden]", { display: "table-header-group" }),
+  h.rule.style("thead, thead[hidden]", { display: "" }),
   h.rule.style("tbody, tbody[hidden]", { display: "table-row-group" }),
   h.rule.style("tfoot, tfoot[hidden]", { display: "table-footer-group" }),

[Killed] ObjectLiteral
packages/alfa-cascade/src/user-agent.ts:144:40
   h.rule.style("colgroup, colgroup[hidden]", { display: "table-column-group" }),
   h.rule.style("col, col[hidden]", { display: "table-column" }),
   h.rule.style("thead, thead[hidden]", { display: "table-header-group" }),
-  h.rule.style("tbody, tbody[hidden]", { display: "table-row-group" }),
+  h.rule.style("tbody, tbody[hidden]", {}),
   h.rule.style("tfoot, tfoot[hidden]", { display: "table-footer-group" }),
   h.rule.style("tr, tr[hidden]", { display: "table-row" }),
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(59,7): .get() returns the rule tree node of the given element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
...

[Killed] ObjectLiteral
packages/alfa-cascade/src/user-agent.ts:146:34
   h.rule.style("thead, thead[hidden]", { display: "table-header-group" }),
   h.rule.style("tbody, tbody[hidden]", { display: "table-row-group" }),
   h.rule.style("tfoot, tfoot[hidden]", { display: "table-footer-group" }),
-  h.rule.style("tr, tr[hidden]", { display: "table-row" }),
+  h.rule.style("tr, tr[hidden]", {}),
   h.rule.style("td, th, td[hidden], th[hidden]", { display: "table-cell" }),
 
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(59,7): .get() returns the rule tree node of the given element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
...

[Killed] ObjectLiteral
packages/alfa-cascade/src/user-agent.ts:151:5
 
   h.rule.style(
     "colgroup[hidden], col[hidden], thead[hidden], tbody[hidden], tfoot[hidden], tr[hidden], td[hidden], th[hidden]",
-    {
-      visibility: "collapse",
-    },
+    {},
   ),
 
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(59,7): .get() returns the rule tree node of the given element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
...

[Survived] StringLiteral
packages/alfa-cascade/src/user-agent.ts:152:19
   h.rule.style(
     "colgroup[hidden], col[hidden], thead[hidden], tbody[hidden], tfoot[hidden], tr[hidden], td[hidden], th[hidden]",
     {
-      visibility: "collapse",
+      visibility: "",
     },
   ),

[Killed] StringLiteral
packages/alfa-cascade/src/user-agent.ts:158:16
 
   h.rule.style("th", { fontWeight: "bold" }),
 
-  h.rule.style(":is(table, thead, tbody, tfoot, tr) > form", {
+  h.rule.style("", {
     display: "none !important",
   }),
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(59,7): .get() returns the rule tree node of the given element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
...

[Killed] ObjectLiteral
packages/alfa-cascade/src/user-agent.ts:181:5
 
   h.rule.style(
     "input:is([type=reset i], [type=button i], [type=submit i]), button",
-    {
-      textAlign: "center",
-    },
+    {},
   ),
 
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(59,7): .get() returns the rule tree node of the given element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
...

[Killed] StringLiteral
packages/alfa-cascade/src/user-agent.ts:187:5
   ),
 
   h.rule.style(
-    "input:is([type=reset i], [type=button i], [type=submit i], [type=color i]), button",
+    "",
     {
       display: "inline-block",
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(59,7): .get() returns the rule tree node of the given element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
...

[Killed] ObjectLiteral
packages/alfa-cascade/src/user-agent.ts:188:5
 
   h.rule.style(
     "input:is([type=reset i], [type=button i], [type=submit i], [type=color i]), button",
-    {
-      display: "inline-block",
-    },
+    {},
   ),
 
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(59,7): .get() returns the rule tree node of the given element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
...

[Survived] StringLiteral
packages/alfa-cascade/src/user-agent.ts:189:16
   h.rule.style(
     "input:is([type=reset i], [type=button i], [type=submit i], [type=color i]), button",
     {
-      display: "inline-block",
+      display: "",
     },
   ),

[Killed] StringLiteral
packages/alfa-cascade/src/user-agent.ts:194:5
   ),
 
   h.rule.style(
-    "input:is([type=radio i], [type=checkbox i], [type=reset i], [type=button i], [type=submit i], [type=color i], [type=search i]), select, button",
+    "",
     {
       boxSizing: "border-box",
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(59,7): .get() returns the rule tree node of the given element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
...

[Killed] ObjectLiteral
packages/alfa-cascade/src/user-agent.ts:195:5
 
   h.rule.style(
     "input:is([type=radio i], [type=checkbox i], [type=reset i], [type=button i], [type=submit i], [type=color i], [type=search i]), select, button",
-    {
-      boxSizing: "border-box",
-    },
+    {},
   ),
 
killedBy: All tests
statusReason: packages/alfa-cascade/test/cascade.spec.js(59,7): .get() returns the rule tree node of the given element

Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    block: {
...

[Survived] StringLiteral
packages/alfa-cascade/src/user-agent.ts:200:42
     },
   ),
 
-  h.rule.style("textarea", { whiteSpace: "pre-wrap" }),
+  h.rule.style("textarea", { whiteSpace: "" }),
 
   h.rule.style("button", {

[Survived] StringLiteral
packages/alfa-cascade/src/user-agent.ts:211:22
     // forced-color media query could help), so we default to the system color.
     // as of 21.09.23, Chrome uses rgb(240, 240, 240) but Firefox uses
     // rgb(233, 233, 233).
-    backgroundColor: "buttonface",
+    backgroundColor: "",
     // color seems to rather consistently defaults to black, which is the default.
     // color: "buttontext",

[Survived] StringLiteral
packages/alfa-cascade/src/user-agent.ts:222:15
 
   h.rule.style("hr", {
     color: "gray",
-    overflow: "hidden",
+    overflow: "",
   }),
 

[Survived] StringLiteral
packages/alfa-cascade/src/user-agent.ts:230:14
    */
 
   h.rule.style("fieldset", {
-    display: "block",
+    display: "",
   }),
 ]);
